Функция ПолучитьСкладСписания() Экспорт
	Возврат Склад
КонецФункции

Функция ПолучитьТекстЗапросаПолученияСпискаТоваров() Экспорт
	
	Возврат "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура
	|ИЗ
	|	Документ.ВыдачаНаМОЛ.Товары
	|ГДЕ
	|	Ссылка = &ДокументСсылка
	|";
	
КонецФункции

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Подготовка
	
	Заголовок = КонтрольПроведения.ПолучитьСтандарнтыйЗаголовокПриПроведенииДокумента(Ссылка);
	
	Документы[Метаданные().Имя].ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Последовательности
	
	//avdonin {{12.09.2010#
	//
	ПроведенияДокументов.ПоследовательностьОстаткиТоваров(ДополнительныеСвойства, ПринадлежностьПоследовательностям, Отказ);
	//}}avdonin
	
	// Проведение
	
	
	ПроведенияДокументов.ПровестиПоВсемРегистрам(Метаданные().Движения, ДополнительныеСвойства, Движения, Отказ);
	
	// Запись
	
	Движения.Записать();
	
	// Контроль
	
	КонтрольПроведения.ПроверитьПоВсемРегистрам(ЭтотОбъект, Отказ, Заголовок);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("БизнесПроцессСсылка.ВнутренняяЗаявка") Тогда
		ЗаполнитьПоВнутреннемуЗаказу(ДанныеЗаполнения.Заказ);
	КонецЕсли;
КонецПроцедуры

Процедура ЗаполнитьПоВнутреннемуЗаказу(Заказ)
	 Склад = Заказ.Заказчик;
	 ТипЦен = Справочники.ТипыЦен.НайтиПоНаименованию("Розничные",Истина);
	 Валюта = Справочники.Валюты.НайтиПоКоду("643");
	 Для каждого Эл Из Заказ.Товары Цикл
		 НоваяСтрока  =  Товары.Добавить();
		 ЗаполнитьЗначенияСвойств(НоваяСтрока,Эл);
		 НоваяСтрока.Цена = РаботаСНоменклатурой.ПолучитьЦену(НоваяСтрока.Номенклатура, ТипЦен, Валюта, НоваяСтрока.Упаковка); 
		 НоваяСтрока.Сумма = НоваяСтрока.Цена * НоваяСтрока.Количество;
	 КонецЦикла;
КонецПроцедуры	