
Процедура ПриЗаписи(Отказ, Замещение)
	
	// Если ДатаОтсчета не заполнена в регистре сведений журналы в заказе тогда заполним ее
	
	Для Каждого Запись Из ЭтотОбъект Цикл
		
		Если Запись.ДатаОтсчета <> '00010101' Тогда
	
			Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 ИСТИНА ИЗ РегистрСведений.ЗаказыЖурнал ГДЕ Заказ = &Заказ И ДатаОтсчета <> &ПустаяДата");
			Запрос.УстановитьПараметр("Заказ", 		Запись.Заказ);
			Запрос.УстановитьПараметр("ПустаяДата", '00010101');
			
			Если Запрос.Выполнить().Пустой() Тогда
				
				Если Не Заказы.УстановитьРеквизитЖурнала(Запись.Заказ, Новый Структура("ДатаОтсчета", Запись.ДатаОтсчета)) Тогда
					Отказ = Истина; КонецЕсли;КонецЕсли;КонецЕсли;КонецЦикла;
	
КонецПроцедуры
