
Функция ПровестиНаСервере(ДокСсылка, АвтоматическиРедактироватьДокумент = ИСТИНА) Экспорт
	
	Если Не ДокСсылка.Проведен Тогда
		ОбщиеФункции.СообщитьТекст("Документ не проведен " + ДокСсылка);
		Возврат Ложь;
	КонецЕсли;
		
	ДокОбъект = ДокСсылка.ПолучитьОбъект();
	Если ДокОбъект = Неопределено Тогда
		
		ОбщиеФункции.СообщитьТекст("Не удалось получить объект из ссылки");
		Возврат Ложь;
		
	Иначе
	
		// У реализации увеличим время на секунду если у них одинаковая дата
		
		Если АвтоматическиРедактироватьДокумент Тогда
		
			Если 	ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.РеализацияТоваров") Тогда
				
				Если ЗначениеЗаполнено(ДокОбъект.Заказ) И ДокОбъект.Дата = ДокОбъект.Заказ.Дата Тогда
					
					ДокОбъект.Дата = ДокОбъект.Дата + 1;
					
				Иначе
				
					// Проверим может есть корректировки которые также с одной датой в реализации
					
					Запрос = Новый Запрос("
					|ВЫБРАТЬ ПЕРВЫЕ 1 ИСТИНА
					|ИЗ			РегистрНакопления.Взаиморасчеты
					|ГДЕ		Регистратор <> &Ссылка И Период = &Дата
					|");
					
					Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
					Запрос.УстановитьПараметр("Дата", 	ДокОбъект.Дата);
					
					Если Не Запрос.Выполнить().Пустой() Тогда
						ДокОбъект.Дата = ДокОбъект.Дата + 1;
					КонецЕсли;
					
				КонецЕсли;
				
				ДокОбъект.ЗаполнитьДокументыОплаты(ДокСсылка);
				
			ИначеЕсли 	ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПлатежноеПоручениеВходящее") Или
						ТипЗнч(ДокОбъект) = Тип("ДокументОбъект.ПриходныйКассовыйОрдер") Тогда
				
				Заказы.ЗаполнитьТаблицуДокументаОплаты(ДокОбъект, ДокОбъект.Сумма);
				
			КонецЕсли;
		КонецЕсли;
		
		ПараметрыСеанса.КонтрольОстатковВСеансеОтключен = Истина;
		
		Попытка
			ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			стрОшибки = ОписаниеОшибки();
			ОбщиеФункции.СообщитьТекст("Ошибка при проведении документа
									|" + стрОшибки);
			Возврат Ложь;
		КонецПопытки;
		
		ПараметрыСеанса.КонтрольОстатковВСеансеОтключен = Ложь;
		
	КонецЕсли;	
	
	Возврат ИСтина;
	
КонецФункции
