Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос(
	         
	КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() + "
	|;
	 
	// ШАПКА
	
	|ВЫБРАТЬ
	|	Автор, Ответственный
	|ИЗ
	|	Документ.РегистрацияКупонов
	|ГДЕ
	|	Ссылка = &Ссылка
	|;
	
	 // УСЛОВИЯ ИСПОЛЬЗОВАНИЯ
	 
	|ВЫБРАТЬ
	|	Куп.Ссылка.ДатаНачала 		Период,
	|	Куп.Ссылка.ДатаОкончания 	ДатаОкончания,
	|	Куп.Купон 					Купон,
	|	Тов.Товар 					Товар,
	|	Тов.Ссылка.Сумма            Сумма,
	|	Тов.Ссылка.Порог            Порог
	|ИЗ 
	|	Документ.РегистрацияКупонов.Купоны  Куп
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|		Справочник.Купоны.Товары Тов
	|	ПО 
	|		Куп.Купон = Тов.Ссылка
	|
	|ГДЕ
	|	Куп.Ссылка = &Ссылка
	|;
	// СЧЕТЧИК ИСПОЛЬЗОВАНИЯ
	
	|ВЫБРАТЬ
	|	Ссылка.ДатаНачала 	Период,
	|	&ВидДвиженияПриход 	ВидДвижения,
	|	Купон Купон,
	|	Количество
	|ИЗ 
	|	Документ.РегистрацияКупонов.Купоны  
	|
	|ГДЕ
	|	Ссылка = &Ссылка
	|
	|");
	
	Запрос.УстановитьПараметр("Ссылка", 		Ссылка);
	Запрос.УстановитьПараметр("ВидДвиженияПриход", ВидДвиженияНакопления.Приход);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ДополнительныеСвойства.Вставить("ПараметрыСистемы", 		КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[0].Выгрузить()));
	ДополнительныеСвойства.Вставить("Шапка", 					КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[1].Выгрузить()));
	
	ДополнительныеСвойства.Вставить("СкидкиПоКупонам", Пакет[2].Выгрузить());
	ДополнительныеСвойства.Вставить("СчетчикКупонов", Пакет[3].Выгрузить());
	                       
КонецПроцедуры

