
Процедура ЗаполнениеЮнитПакНоменклатуры() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Инвойс.Ссылка,
	|	Инвойс.РасчетВеса
	|ПОМЕСТИТЬ ВТ_Инвойс
	|ИЗ
	|	Документ.Инвойс КАК Инвойс
	|ГДЕ
	|	Инвойс.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Инвойс.МоментВремени УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ИнвойсТоварыПакинг.Номенклатура.Артикул) КАК Артикул,
	|	ИнвойсТоварыПакинг.Номенклатура,
	|	МАКСИМУМ(ИнвойсТоварыПакинг.Цена) КАК Цена,
	|	МАКСИМУМ(ИнвойсТоварыПакинг.Номенклатура.Наименование) КАК Наименование,
	|	МАКСИМУМ(ИнвойсТоварыПакинг.НоменклатураДляТаможни) КАК НоменклатураДляТаможни,
	|	МАКСИМУМ(ИнвойсТоварыПакинг.Количество) КАК Количество,
	|	МАКСИМУМ(ИнвойсТоварыПакинг.Упаковка) КАК Упаковка,
	|	МАКСИМУМ(ИнвойсТоварыПакинг.КоличествоВУпаковке) КАК КоличествоВУпаковке,
	|	МАКСИМУМ(ИнвойсТоварыПакинг.КоличествоМест) КАК КоличествоМест,
	|	МАКСИМУМ(ИнвойсТоварыПакинг.ВесНетто) КАК ВесНеттоУпаковка,
	|	МАКСИМУМ(ИнвойсТоварыПакинг.ВесБрутто) КАК ВесБруттоУпаковка,
	|	МАКСИМУМ(ИнвойсТоварыПакинг.ВесНетто * ИнвойсТоварыПакинг.КоличествоМест) КАК ВесНеттоИтогУпаковка,
	|	МАКСИМУМ(ИнвойсТоварыПакинг.ВесБрутто * ИнвойсТоварыПакинг.КоличествоМест) КАК ВесБруттоИтогУпаковка,
	|	ИнвойсТоварыПакинг.Ссылка.РасчетВеса = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетаВеса.ПоУпаковкам) КАК Исключение
	|ПОМЕСТИТЬ Пакинг
	|ИЗ
	|	Документ.Инвойс.ТоварыПакинг КАК ИнвойсТоварыПакинг
	|ГДЕ
	|	ИнвойсТоварыПакинг.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_Инвойс.Ссылка
	|			ИЗ
	|				ВТ_Инвойс КАК ВТ_Инвойс)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИнвойсТоварыПакинг.Номенклатура,
	|	ИнвойсТоварыПакинг.Ссылка.РасчетВеса = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетаВеса.ПоУпаковкам)
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ИнвойсТоварыПакинг.Упаковка) < 2
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Пакинг.Артикул,
	|	Пакинг.Номенклатура,
	|	Пакинг.Цена,
	|	Пакинг.Наименование,
	|	Пакинг.НоменклатураДляТаможни,
	|	Пакинг.Количество,
	|	Пакинг.Упаковка,
	|	Пакинг.КоличествоВУпаковке,
	|	Пакинг.КоличествоМест,
	|	Пакинг.ВесНеттоУпаковка,
	|	Пакинг.ВесБруттоУпаковка,
	|	Пакинг.ВесНеттоИтогУпаковка,
	|	Пакинг.ВесБруттоИтогУпаковка,
	|	Пакинг.Исключение
	|ИЗ
	|	Пакинг КАК Пакинг
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Док.Номенклатура.Артикул,
	|	Док.Номенклатура,
	|	Док.Цена,
	|	Док.Номенклатура.Наименование,
	|	Док.НоменклатураДляТаможни,
	|	Док.Количество,
	|	Док.Упаковка,
	|	Док.КоличествоВУпаковке,
	|	Док.КоличествоМест,
	|	Док.ВесНетто,
	|	Док.ВесБрутто,
	|	Док.ВесНетто * Док.КоличествоМест,
	|	Док.ВесБрутто * Док.КоличествоМест,
	|	Док.Ссылка.РасчетВеса = ЗНАЧЕНИЕ(Перечисление.ВидыРасчетаВеса.ПоУпаковкам)
	|ИЗ
	|	Документ.Инвойс.ТоварыПакинг КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ Пакинг КАК Пак
	|		ПО (Пак.Номенклатура = Док.Номенклатура)
	|ГДЕ
	|	Док.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_Инвойс.Ссылка
	|			ИЗ
	|				ВТ_Инвойс КАК ВТ_Инвойс)
	|	И Пак.Номенклатура ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	Пакинг.Наименование";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		
		НоменклатураОбъект = Выборка.Номенклатура.ПолучитьОбъект();
		НоменклатураОбъект.Юнитпак = Выборка.КоличествоВУпаковке;
		НоменклатураОбъект.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
