
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Подготовка
	
	Заголовок = КонтрольПроведения.ПолучитьСтандарнтыйЗаголовокПриПроведенииДокумента(Ссылка);
	
	Документы[Метаданные().Имя].ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Проведение
	
	ПроведенияДокументов.ПровестиПоВсемРегистрам(Метаданные().Движения, ДополнительныеСвойства, Движения, Отказ);
	
	// Запись
	
	Движения.Записать();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
		ТипОсн = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипОсн = Тип("БизнесПроцессСсылка.ИнтернетЗаявка") Тогда
		  
		ИнтернетЗаказПокупателя = ДанныеЗаполнения.Заказ;
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ИнтернетЗаказПокупателя, "Валюта, Контрагент, Партнер, СуммаВключаетНДС, УчитыватьНДС");
		ВидОперации = Перечисления.ВидыОперацийЧекККМ.Продажа;
		
		Запрос = Новый Запрос("ВЫБРАТЬ СуммаПриход Сумма ИЗ РегистрНакопления.ДолгиПоЗаказам.Обороты(,,,Заказ = &Заказ)");
		Запрос.УстановитьПараметр("Заказ", ИнтернетЗаказПокупателя);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Сумма = Выборка.Сумма;
		КонецЕсли;
		
	ИначеЕсли
		ТипОсн = Тип("ДокументСсылка.ИнтернетЗаказПокупателя") Тогда
		
		ИнтернетЗаказПокупателя = ДанныеЗаполнения;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения, "Валюта, Контрагент, Партнер, СуммаВключаетНДС, УчитыватьНДС");
		ВидОперации = Перечисления.ВидыОперацийЧекККМ.Продажа;
		
		Запрос = Новый Запрос("ВЫБРАТЬ СуммаПриход Сумма ИЗ РегистрНакопления.ДолгиПоЗаказам.Обороты(,,,Заказ = &Заказ)");
		Запрос.УстановитьПараметр("Заказ", ДанныеЗаполнения);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Сумма = Выборка.Сумма;
		КонецЕсли;
					
	ИначеЕсли
		ТипОсн = Тип("ДокументСсылка.ВозвратОтПокупателя") Тогда
		
		ИнтернетЗаказПокупателя = ДанныеЗаполнения.ДокументОтгрузки.Заказ;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		ВидОперации = Перечисления.ВидыОперацийЧекККМ.Возврат;
					
	КонецЕсли;

КонецПроцедуры
