
&НаСервере
Процедура КоличествоЗаписейНаСервере()
	
	Запрос=Новый Запрос("Выбрать ""Всего записей"" Показатель, количество(*) Количество из РегистрНакопления.ПартииТоваров
	|объединить все
	
	|Выбрать ""из них не указан инвойс"", количество(*) из РегистрНакопления.ПартииТоваров ГДЕ ОписаниеОшибки=Значение(Перечисление.ВидыОшибокПартионногоУчета.НеУказанИнвойс)
	|объединить все
	
	|Выбрать ""из них не указан инвойс"", количество(*) из РегистрНакопления.ПартииТоваров ГДЕ ОписаниеОшибки=Значение(Перечисление.ВидыОшибокПартионногоУчета.НеУказанИнвойс)
	|объединить все
	
	|Выбрать ""из них оприходование не закупавшейся ранее номенклатуры"", количество(*) из РегистрНакопления.ПартииТоваров ГДЕ ОписаниеОшибки=Значение(Перечисление.ВидыОшибокПартионногоУчета.ОприходованиеНовойНоменклатуры)
	|объединить все
	
	|Выбрать ""из них отсутствие необходимого количества"", количество(*) из РегистрНакопления.ПартииТоваров ГДЕ ОписаниеОшибки=Значение(Перечисление.ВидыОшибокПартионногоУчета.ОтсутствиеНоменклатуры)
	|объединить все
	
	|Выбрать ""из них возврат от покупателя товара который не продавался"", количество(*) из РегистрНакопления.ПартииТоваров ГДЕ ОписаниеОшибки=Значение(Перечисление.ВидыОшибокПартионногоУчета.ВозвратОтПокупателяНеизвестногоТовара)
	|объединить все
	
	|Выбрать ""из них с нулевой суммой (все виды ошибок)"", количество(*) из РегистрНакопления.ПартииТоваров ГДЕ Сумма=0
	|объединить все
	
	|Выбрать ""из них с нулевой суммой на текущих остатках"", количество(*) из РегистрНакопления.ПартииТоваров.Остатки ГДЕ СуммаОстаток=0
	|объединить все
	
	|выбрать ""из них поступления без цен"", Количество(*)
	|из
	|документ.ПоступлениеТоваров.Товары
	|ГДЕ Ссылка.Сумма=0 и Ссылка.Проведен
	
	|объединить все
	
	|выбрать ""из них разукомлектации товара, который никогда не приобретался"",Количество(*)
	|из регистрНакопления.ПартииТоваров
	|ГДЕ Сумма=0
	|и Регистратор ссылка документ.Комплектация
	|и Выразить(Регистратор КАК Документ.Комплектация).Операция = Значение(Перечисление.ВидыоперацийКомплектацияНоменклатуры.РазуКомплектация) 
	|и НЕ Номенклатура.ТипНоменклатуры=Значение(Перечисление.ТипыНоменклатуры.Услуга)
	
	|объединить все
	
	|выбрать ""из них оприходование товара, который никогда не приобретался"",Количество(*)
	|из регистрНакопления.ПартииТоваров
	|ГДЕ Сумма=0
	|и Регистратор ссылка документ.ОприходованиеТоваров
	|и НЕ Номенклатура.ТипНоменклатуры=Значение(Перечисление.ТипыНоменклатуры.Услуга)
	
	|объединить все
	
	|выбрать ""из них расчеты себестоимости без привязки к инвойсам"", Количество(*)
	|из
	|документ.РасчетСебестоимости.Себестоимость
	|ГДЕ 
	|Ссылка.проведен
	|и Ссылка.Инвойс=Значение(Документ.Инвойс.ПустаяСсылка)
	
	|объединить все
	
	|выбрать ""из них расчеты себестоимости без привязки к инвойсам, имеющиеся в текущих остатках"", Количество(*)
	|из
	|документ.РасчетСебестоимости.Себестоимость Рег
	|внутреннее соединение РегистрНакопления.ПартииТоваров.Остатки Ост По Ост.Номенклатура=Рег.Номенклатура
	|ГДЕ 
	|Ссылка.проведен
	|и Ссылка.Инвойс=Значение(Документ.Инвойс.ПустаяСсылка)
	|;");
	
	
	ТабПодсчета.Загрузить(Запрос.Выполнить().Выгрузить());
	
	ТекДата='20120101';
	Пока ТекДата<=НачалоГода(ТекущаяДата()) Цикл
		Запрос=Новый Запрос("Выбрать количество(*) Колво из РегистрНакопления.ПартииТоваров ГДЕ Сумма=0 и Период>=&НачДата и Период<=&КонДата");
		Запрос.УстановитьПараметр("НачДата",НачалоГода(ТекДата));
		Запрос.УстановитьПараметр("КонДата",КонецГода(ТекДата));
			
		НовСтр=ТабПодсчета.Добавить();
		НовСтр.Показатель="из них с нулевой суммой за "+Год(ТекДата);
		НовСтр.Количество = Запрос.Выполнить().Выгрузить()[0].Колво;
		
		ТекДата=ДобавитьМесяц(ТекДата,12);
	КонецЦикла;	
		
КонецПроцедуры

&НаКлиенте
Процедура КоличествоЗаписей(Команда)
	КоличествоЗаписейНаСервере();
КонецПроцедуры
