
Процедура ИнвойсПроведенПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = Инвойс.Проведен;
КонецПроцедуры

Процедура СебестоимостьРассчитанаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = РасчетСебестоимости.Проведен;
КонецПроцедуры

Процедура ПоступлениеПроведеноПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = ПоступлениеТоваров.Проведен;
КонецПроцедуры

Процедура КонтейнерРазложенПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = Истина;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	ТипДанных = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипДанных = Тип("ДокументСсылка.Инвойс") Тогда

		Инвойс = ДанныеЗаполнения;
	КонецЕсли;
	
КонецПроцедуры
