
Функция ПредставлениеЗадачи(Задача)
	
	текНомер   = СокрЛП(текНомер);
	Пока Лев(текНомер, 1)="0" Цикл   			  // удаление ведущих нулей
		Номер = Сред(текНомер, 2);
	КонецЦикла;

	Возврат Задача.Наименование + " " + Формат(Дата, "ДЛФ=DD") + " (БП" + текНомер + ")";
	
КонецФункции  

Процедура ОткрытиеСменыПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		
		Задача.Наименование = ПредставлениеЗадачи(Задача);
		Задача.Склад 		= Касса.Склад;
		
	КонецЦикла;
	
	
КонецПроцедуры
Процедура ЗакрытиеСменыПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		
		Задача.Наименование = ПредставлениеЗадачи(Задача);
		Задача.Склад 		= Касса.Склад;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗавершениеПриЗавершении(ТочкаМаршрутаБизнесПроцесса, Отказ)
	
	// Запишем скоко наторговали
	
	Запрос = Новый Запрос("ВЫБРАТЬ Смена,СуммаОборот Сумма ИЗ РегистрНакопления.Продажи.Обороты(,,,Смена = &Смена)");
	Запрос.УстановитьПараметр("Смена", Ссылка);
	
	Выполнение = Запрос.Выполнить();
	Если Не Выполнение.Пустой() Тогда
		
		Выборка = Выполнение.Выбрать();
		Если Выборка.Следующий() Тогда
			
			//Процесс = Ссылка.ПолучитьОбъект();
			Сумма 	= Выборка.Сумма;
			Валюта 	= Касса.ТипЦен.Валюта;
			
			Попытка
				
				Записать();
				
			Исключение
				
				стрОшибки = ОписаниеОшибки();
				ОбщиеФункции.СообщитьТекст("Ошибка при записи суммы продажи за смену
												|" + стрОшибки);
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

