Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос("	ВЫБРАТЬ
							|	Ссылка.ДатаНачала	Период,
							|	ЦеноваяГруппа		ЦеноваяГруппа,
							|	УровеньСкидки		УровеньСкидки,
							|	ПроцентСкидки		ПроцентСкидки
							|ИЗ
							|	Документ.УстановкаПроцентаСкидки.Скидки
							|ГДЕ
							|	Ссылка = &Ссылка");
							
	Запрос.УстановитьПараметр("Ссылка", Ссылка);

	Выполнение = Запрос.Выполнить();
	
	ДополнительныеСвойства.Вставить("СкидкиПоЦеновымГруппам", 	Выполнение.Выгрузить());
	
КонецПроцедуры
