
//Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
//	
//	МассивРеквизитов = Новый Массив;
//	МассивРеквизитов.Добавить("alies");              //0
//	МассивРеквизитов.Добавить("alies_ru");           //0
//	МассивРеквизитов.Добавить("Вес");                //1
//	МассивРеквизитов.Добавить("h1");                 //1
//	МассивРеквизитов.Добавить("meta_description");   //1
//	МассивРеквизитов.Добавить("ВесНетто");           //1
//	МассивРеквизитов.Добавить("meta_keywords");      //1
//	МассивРеквизитов.Добавить("ДатаСоздания");       //0
//	МассивРеквизитов.Добавить("title");               //1
//	МассивРеквизитов.Добавить("НаименованиеПолное");   //0
//	МассивРеквизитов.Добавить("Артикул");              //1
//	МассивРеквизитов.Добавить("Наименование");         //1
//	МассивРеквизитов.Добавить("Новинка");              //1
//	МассивРеквизитов.Добавить("Описание");              //1
//	МассивРеквизитов.Добавить("Производитель");         //1
//	МассивРеквизитов.Добавить("Распродажа");            //1
//	МассивРеквизитов.Добавить("СтранаПроисхождения");//1
//	МассивРеквизитов.Добавить("ОписаниеКороткое");
//	МассивРеквизитов.Добавить("Комплектация");   //1
//	МассивРеквизитов.Добавить("НаименованиеИнтернет");//1
//	МассивРеквизитов.Добавить("Гарантия");//1
//	МассивРеквизитов.Добавить("КороткоеОписание");//2
//	МассивРеквизитов.Добавить("Инструкции");//1
//	МассивРеквизитов.Добавить("ВидеоОбзоры");  //1
//	МассивРеквизитов.Добавить("ТаблицаКомплектации"); //1
//	МассивРеквизитов.Добавить("Особенности");       //1
//	МассивРеквизитов.Добавить("КатегорияТовара");//1
//	
//	
//	МассивРеквизитов.Добавить("ЭтоПредставлениеОбъекта");//1
//	МассивРеквизитов.Добавить("ВыгружатьНаСайт");//1
//	МассивРеквизитов.Добавить("Родитель");//1
//	МассивРеквизитов.Добавить("РодительGarage");//1
//	МассивРеквизитов.Добавить("РодительLicota");//1
//	МассивРеквизитов.Добавить("ДополнительныеРодители");//1
//	МассивРеквизитов.Добавить("ДополнительныеРеквизитыНоменклатуры");//1
//	
//	Параметры = КомпоновщикНастроек.Настройки.ПараметрыДанных;
//	ЗначениеПараметра = Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СписокРеквизитов"));
//	//ЗначениеПараметраПериод = Параметры.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период"));
//	Если НЕ ЗначениеПараметра.Использование ИЛИ НЕ ЗначениеЗаполнено(ЗначениеПараметра.Значение) Тогда
//		ЗначениеПараметра.Использование = Истина;
//   		Параметры.УстановитьЗначениеПараметра("СписокРеквизитов", МассивРеквизитов);
//	КонецЕсли;
//	

//КонецПроцедуры
