
&НаСервере
Функция ПолучитьТаблицуЗначенийСтрокой()
	
	НовТабл = ТабИнвойсы.Выгрузить();
	НовТабл.Очистить();
	
	СтрокиОплат = ТабИнвойсы.НайтиСтроки(Новый Структура("Оплатить", Истина));
	
	Для Каждого Строка Из СтрокиОплат Цикл
		ЗаполнитьЗначенияСвойств(НовТабл.Добавить(), Строка);
	КонецЦикла;
	
	Возврат ЗначениеВСтрокуВнутр(НовТабл);
	
КонецФункции
&НаКлиенте
Процедура Выбрать(Команда)
	
	Закрыть(ПолучитьТаблицуЗначенийСтрокой());
	
КонецПроцедуры


Процедура ЗаполнитьТаблицу()
	
	Запрос = Новый Запрос("ВЫБРАТЬ Инвойс, СуммаПриход СуммаИнвойса, СуммаКонечныйОстаток ДолгПоОплате ИЗ РегистрНакопления.ОплатыИмпорт.ОстаткиИОбороты(, &КонецПериода) ГДЕ СуммаКонечныйОстаток <> 0");
	Запрос.УстановитьПараметр("КонецПериода", ДокументОплаты.Дата);
	ТабИнвойсы.Загрузить(Запрос.Выполнить().Выгрузить());	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДокументОплаты = Параметры.ДокументОплаты;
	Сумма = Параметры.Сумма;
	СуммаРаспределить = Сумма;
	ЗаполнитьТаблицу();
КонецПроцедуры

&НаСервере
Процедура ПересчитатьШапку()
	
	СуммаРаспределить = Сумма -  ТабИнвойсы.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура ТабИнвойсыОплатитьПриИзменении(Элемент)
	ТекДанные = Элементы.ТабИнвойсы.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Если НЕ СуммаРаспределить Тогда
			ТекДанные.Оплатить = Ложь; КонецЕсли;
		ТекДанные.Сумма = ?(ТекДанные.Оплатить, Мин(СуммаРаспределить, ТекДанные.ДолгПоОплате), 0); 
		ПересчитатьШапку();
	КонецЕсли;
		
КонецПроцедуры
