
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Контрагент) Тогда
		
		Для Каждого Элемент ИЗ Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
			
			Если	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Контрагент") Тогда
					КонтрагентИД = Элемент.ИдентификаторПользовательскойНастройки;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Элемент Из Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
			Если ТипЗнч(Элемент) = Тип("ЭлементОтбораКомпоновкиДанных") И Элемент.ИдентификаторПользовательскойНастройки = КонтрагентИД Тогда
				
				Элемент.ПравоеЗначение =  Параметры.Контрагент;
				Элемент.Использование = Истина;
			Иначе
				Элемент.Использование = Ложь;
			КонецЕсли
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
