
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Партнер) Тогда
		
		Для Каждого Элемент ИЗ Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
			
			Если	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Партнер") Тогда
					партнерИД = Элемент.ИдентификаторПользовательскойНастройки;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Элемент Из Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
			Если ТипЗнч(Элемент) = Тип("ЭлементОтбораКомпоновкиДанных") И Элемент.ИдентификаторПользовательскойНастройки = партнерИД Тогда
				
				Элемент.ПравоеЗначение =  Параметры.Партнер;
				Элемент.Использование = Истина;
			Иначе
				Элемент.Использование = Ложь;
			КонецЕсли
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры
