&НаКлиенте
Перем МассивКомментариев Экспорт;
&НаКлиенте
Перем СтруктураКолонокТовары;

// ТИПОВЫЕ

&НаСервере
Процедура УстановитьЗаголовок()
	
	Заголовок = "Обработка интернет заказ " + Заказ.Номер + 
				" от " + Заказ.Дата + 
				" (ЗД " + Объект.Номер + 
				" БП " + Объект.БизнесПроцесс.Номер + 
				")";
	
КонецПроцедуры
&НаКлиенте
Процедура ПоказатьСкрытьАдресацию(Команда)
	
	// Реверснем
	
	КоманднаяПанель.ПодчиненныеЭлементы.ПоказатьСкрытьАдресацию.Пометка = Не КоманднаяПанель.ПодчиненныеЭлементы.ПоказатьСкрытьАдресацию.Пометка;
	
	// Обновим видимость
	
	ФункцииФормЗадач.ВидимостьАдресации(ЭтаФорма);

КонецПроцедуры
&НаСервере
Процедура ПрочитатьРеквизиты()
	
	// ФункцииБизнесПроцессов.ЗаполнитьДанныеЗадачи(Объект, ЭтаФорма);
	ФункцииБизнесПроцессов.ЗаполнитьДанные(ЭтаФорма, 
		Объект.Ссылка.БизнесПроцесс, 
		Объект.Ссылка);
		
КонецПроцедуры
&НаСервере
Процедура УправлениеВидимостьюДоступностью()
	                              
	Выполнена = Объект.Выполнена;
	
	//Элементы.ВыполнитьЗадачу.Доступность 	= Не ТолькоПросмотр И Не Склад.Пустая();
	//Элементы.ОтменитьЗадачу.Доступность 	= Не ТолькоПросмотр И Не Склад.Пустая();
	
	Элементы.КанопкаОтменитьЗадачу.Видимость 		= Не Выполнена;
	Элементы.КнопкаВыполнитьЗадачу.Видимость 		= Не Выполнена;
	Элементы.КнопкаОжидатьОплату.Видимость 			= Не Выполнена;
	Элементы.КнопкаОжидатьПодтверждения.Видимость 	= Не Выполнена;
	
	Элементы.КнопкаВыполнитьЗадачу.Доступность 		= Не Склад.Пустая();
	Элементы.КнопкаОжидатьОплату.Доступность 		= Не Склад.Пустая();
	Элементы.КнопкаОжидатьПодтверждения.Доступность = Не Склад.Пустая();
	
КонецПроцедуры
&НаСервере
Функция ЗаписатьСкладВОбъектах(текОбъект)
	
	Если 	Склад <> текОбъект.БизнесПроцесс.Склад Или
			Склад <> текОбъект.БизнесПроцесс.Заказ.Склад Тогда
			
		Если Склад <> текОбъект.БизнесПроцесс.Склад Тогда
			
			ПроцесОбъект = текОбъект.БизнесПроцесс.ПолучитьОбъект();
			ПроцесОбъект.Склад = Склад;
			
			Попытка
				ПроцесОбъект.Записать();
			Исключение
				стрОшибки = ОписаниеОшибки();
				ОбщиеФункции.СообщитьТекст("Ошибка записи БП заказа при установке нового склада
				|" + стрОшибки);
				Отказ = Истина;
				Возврат Ложь;
			КонецПопытки;
			
		КонецЕсли;
		
		//Если Склад <> текОбъект.БизнесПроцесс.Заказ.Склад Тогда
		//	
		//	ЗаказОбъект = текОбъект.БизнесПроцесс.Заказ.ПолучитьОбъект();
		//	ЗаказОбъект.Склад = Склад;
		//	
		//	Попытка
		//		ЗаказОбъект.Записать();
		//	Исключение
		//		стрОшибки = ОписаниеОшибки();
		//		ОбщиеФункции.СообщитьТекст("Ошибка записи заказа при установке нового склада
		//		|" + стрОшибки);
		//		Отказ = Истина;
		//		Возврат Ложь;
		//	КонецПопытки;
		//	
		//КонецЕсли;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции
&НаСервере
Функция ЗаписатьЗаказ()
	
	// Дату будем ставить всегда текущей чтобы избежать корректировок и минусов
	
	ЗаказОбъект = Объект.БизнесПроцесс.Заказ.ПолучитьОбъект();
	ЗаказОбъект.Дата 	= ТекущаяДата();
	ЗаказОбъект.Склад 	= Склад;
	
	ЗаказОбъект.Товары.Загрузить(Товары.Выгрузить());
	
	Попытка
		
		ЗаказОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
	Исключение
		
		стрОшибки = ОписаниеОшибки();
		ОбщиеФункции.СообщитьТекст("Ошибка записи заказа при установке нового склада
		|" + стрОшибки);
		Отказ = Истина;
		Возврат Ложь;
		
	КонецПопытки;
			
	Возврат Истина;
	
КонецФункции

// КОМАНДЫ 

&НаСервере
Функция ОтменитьПроведениеЗаказа()
	
	ЗаказОбъект = Заказ.ПолучитьОбъект();
	
	Попытка
		
		ЗаказОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		
	Исключение
		
		стрОшибки = ОписаниеОшибки();
		ОбщиеФункции.СообщитьТекст("Ошибка при отмене проведения заказа покупателя
							|" + стрОшибки);
		Возврат Ложь;					
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции
&НаСервере
Функция УстановитьСостояниеИВыполнитьЗадачу(ИмяСостояния, ДопСвойство = Неопределено)
	
	Если Заказы.УстановитьСостояниеЗаказа(Заказ, Перечисления.СостоянияЗаказа[ИмяСостояния]) Тогда
		
		Структура = Новый Структура("ВыполнитьЗадачу",Истина);
		Если ДопСвойство <> Неопределено Тогда
			Структура.Вставить(ДопСвойство, Истина);
		КонецЕсли;
		
		Возврат Записать(Структура);
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОтказПодтверждения(Команда)
	
	Комм = "";
	Если ВвестиСтроку(Комм, "Причина отказа",,Истина) Тогда
		
		Объект.Комментарий = Комм;
	
		Если 	ОтменитьПроведениеЗаказа() И
				УстановитьСостояниеИВыполнитьЗадачу("Отменен", "ОтменаЗаказа") Тогда
			
			Закрыть();
			
		КонецЕсли;	
	КонецЕсли

КонецПроцедуры
&НаКлиенте
Процедура Подтвердить(Команда)
	
	Если УстановитьСостояниеИВыполнитьЗадачу("ВРаботе") Тогда
			
		Закрыть();
		
	КонецЕсли;

КонецПроцедуры
&НаКлиенте
Процедура ОжидатьОплату(Команда)
	
	Если УстановитьСостояниеИВыполнитьЗадачу("ОжиданиеОплаты") Тогда
			
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ОжидатьПодтверждения(Команда)
	
	Если УстановитьСостояниеИВыполнитьЗадачу("ОжиданиеПодтверждения") Тогда
			
		Закрыть();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура текСкладПриИзменении(Элемент)
	
	 УправлениеВидимостьюДоступностью();
	
КонецПроцедуры


// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// комментарии
	ФункцииБизнесПроцессовКлиент.ПолучитьМассивКомментариев(ЭтаФорма, Объект.БизнесПроцесс);
	
	ФункцииФормЗадач.ПриОткрытии(Объект, ЭтаФорма, Отказ); 
	
	СтруктураКолонокТовары = ФункцииФормДокументов.ПолучитьСтруктуруКолонокТовары(Элементы.Товары, Ложь);
	
	УправлениеВидимостьюДоступностью();
	
	Элементы.ПользовательДетально.Видимость = Ложь;
	
КонецПроцедуры
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// информация о товаре
	РаботаСНоменклатурой.ДобавитьОперативнуюИнформациюОТоваре(ЭтаФорма);
	// комментарии
	ФункцииБизнесПроцессов.ДобавитьРаботуСКомментариями(ЭтаФорма);
	
	ПрочитатьРеквизиты();
	
	Склад = Объект.БизнесПроцесс.Склад;
	
	УстановитьЗаголовок();
	
КонецПроцедуры
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Перем ВыполнитьЗадачу, ОтменаЗаказа;
	
	ПараметрыЗаписи.Свойство("ВыполнитьЗадачу", ВыполнитьЗадачу);
	ПараметрыЗаписи.Свойство("ОтменаЗаказа", ОтменаЗаказа);
	
	// Запишем склад в заказ если они отличаются
	
	Если ОтменаЗаказа <> Истина Тогда
		
		Если 	ОтменаЗаказа <> Истина И
				Не ПроверитьРазмещениеИНДСВсегоТовара() Тогда
				
			Отказ = Истина;
			Возврат;
			
		КонецЕсли;
		
		Если Не ЗаписатьСкладВОбъектах(ТекущийОбъект) Тогда
			Отказ = Истина;
		КонецЕсли;
		
		//Если ВыполнитьЗадачу = Истина Тогда
			
		Если Не ЗаписатьЗаказ() Тогда
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
		
	//Иначе
	
		
		
	//КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ФункцииФормЗадач.ПослеЗаписи(Объект, ЭтаФорма, ПараметрыЗаписи);
	
	УправлениеВидимостьюДоступностью();

КонецПроцедуры
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	//Перем ВыполнитьЗадачу, ОтменаЗаказа;
	//
	//ПараметрыЗаписи.Свойство("ВыполнитьЗадачу", ВыполнитьЗадачу);
	//ПараметрыЗаписи.Свойство("ОтменаЗаказа", ОтменаЗаказа);
	//
	//Если ВыполнитьЗадачу = Истина И ОтменаЗаказа <> Истина Тогда
	//	
	//	
	//	
	//КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ПроверитьРазмещениеИНДСВсегоТовара()
	
	Отказ = Ложь;
	
	Инд = -1;
	Для Каждого Строка Из Товары Цикл Инд = Инд + 1;
		
		Если Строка.Размещение.Пустая() Тогда
			
			Отказ = Истина;
			ОбщиеФункции.СообщитьТекст("Нет размещения", "Товары[" + Инд + "].Размещение", Объект);
				
		КонецЕсли;
		
		Если Строка.СтавкаНДС.Пустая() Тогда
			
			Отказ = Истина;
			ОбщиеФункции.СообщитьТекст("Не указана ставка НДС", "Товары[" + Инд + "].СтавкаНДС", Объект);
				
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Не Отказ;
	
КонецФункции
// Пользователь интернет детально
&НаКлиенте
Процедура ПоказатьСкратьЮзера(Команда)
	
	Элементы.ПользовательДетально.Видимость = ?(Элементы.ПользовательДетально.Видимость, Ложь, Истина);
	
КонецПроцедуры


// ТАБЛИЦА

&НаКлиенте
&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)

	ФункцииФормДокументов.НоменклатураПриИзменении(
				Элементы.Товары, 
				СтруктураКолонокТовары);

КонецПроцедуры
&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	
	ФункцииФормДокументов.КоличествоПриИзменении(Элементы.Товары, СтруктураКолонокТовары);
	
КонецПроцедуры
&НаКлиенте
Процедура ЦенаПриИзменении(Элемент)
	
	ФункцииФормДокументов.ЦенаПриИзменении(Элементы.Товары, СтруктураКолонокТовары);
	
КонецПроцедуры
&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	
	ФункцииФормДокументов.СуммаПриИзменении(Элементы.Товары, СтруктураКолонокТовары);
	
КонецПроцедуры
&НаКлиенте
Процедура СтавкаНДСПриИзменении(Элемент)
	
	ФункцииФормДокументов.СтавкаНДСПриИзменении(Элементы.Товары, СтруктураКолонокТовары);
	
КонецПроцедуры
&НаКлиенте
Процедура УпаковкаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры
&НаКлиенте
Процедура СуммаНДСПриИзменении(Элемент)
	
	ФункцииФормДокументов.СуммаНДСПриИзменении(Элементы.Товары, СтруктураКолонокТовары);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцентРучнойСкидкиПриИзменении(Элемент)
	
	ФункцииФормДокументов.ПроцентРучнойСкидкиПриИзменении(Элементы.Товары, СтруктураКолонокТовары);
	
КонецПроцедуры
&НаКлиенте
Процедура СуммаРучнойСкидкиПриИзменении(Элемент)
	
	ФункцииФормДокументов.СуммаРучнойСкидкиПриИзменении(Элементы.Товары, СтруктураКолонокТовары);
	
КонецПроцедуры


// ИНФОРМАЦИЯ О ТОВАРЕ

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	
	// информация о товаре
	ОбработатьОтображениеИнформацииОТоваре()	
	 	
КонецПроцедуры
&НаСервере
Процедура ОбработатьОтображениеИнформацииОТоваре() Экспорт
	РаботаСНоменклатурой.ОбработатьОтображениеИнформацииОТоваре(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ИнфТовараТекстHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	РаботаСНоменклатуройКлиент.ИнфТовараТекстHTMLПриНажатии(ЭтаФорма, Элемент, ДанныеСобытия, СтандартнаяОбработка);
КонецПроцедуры
&НаКлиенте
Процедура ИнфТовараЗаголовокHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	РаботаСНоменклатуройКлиент.ИнфТовараЗаголовокHTMLПриНажатии(ЭтаФорма, Элемент, ДанныеСобытия, СтандартнаяОбработка);
КонецПроцедуры

 &НаКлиенте
Процедура ПоказатьСкрытьИнфОТоваре(Команда)
	РаботаСНоменклатуройКлиент.ПоказатьСкрытьИнфОТоваре(ЭтаФорма);
КонецПроцедуры
&НаКлиенте
Процедура НастройкаИнфОТоваре(Команда) 
	РаботаСНоменклатуройКлиент.НастройкаИнфОТоваре(ЭтаФорма);
КонецПроцедуры


// КОММЕНТАРИИ

&НаКлиенте
Процедура КомандаПоказатьКомментарий(Команда)
	ФункцииБизнесПроцессовКлиент.КомандаПоказатьКомментарий(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	УправлениеВидимостьюДоступностью();
КонецПроцедуры
&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	УправлениеВидимостьюДоступностью();
КонецПроцедуры

// КОМАНДЫ

&НаКлиенте
Процедура ЗаполнитьРучСкидку(Команда)
	
	ДиалогиСПользователем.ЗаполнитьРучСкидку(Товары, СтруктураКолонокТовары);
		
КонецПроцедуры
&НаКлиенте
Процедура ЗаполнитьСтавкуНДС(Команда)
	
	ДиалогиСПользователем.ЗаполнитьСтавкуНДС(Товары, СтруктураКолонокТовары);
	
КонецПроцедуры
