
Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос(
	
	// ПАРАМЕТРЫ СИСТЕМЫ
	
	КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() + "
	|;
	|" + ?(Ссылка.ПоПартнеруСписком,"
	
	// ВЗАИМОРАСЧЕТЫ
	
	|ВЫБРАТЬ
	|	Ссылка.Дата			Период,
	|	&ВидДвиженияПриход	ВидДвижения,
	|	Организация			Организация,
	|	Партнер				Партнер,
	|	Контрагент			Контрагент,
	|   ФормаОтношений,
	|   Сумма,
	|	СуммаУпр
	|ИЗ
	|	Документ.КорректировкаДолга.ПоПартнеру
	|ГДЕ
	|	Ссылка = &Ссылка И
	|	(Сумма <> 0 ИЛИ СуммаУпр <> 0)
	|;
	
	// Долги по отгрузкам
	
	|ВЫБРАТЬ
	|	Ссылка.Дата			Период,
	|	&ВидДвиженияПриход	ВидДвижения,
	|	Организация			Организация,
	|	Партнер				Партнер,
	|	Контрагент			Контрагент,
	|	Заказ			    Заказ,
	|	ДокументОтгрузки	ДокументОтгрузки,
	|   СуммаУпр			Сумма
	|ИЗ
	|	Документ.КорректировкаДолга.ПоПартнеру
	|ГДЕ
	|	Ссылка = &Ссылка И
	|	(Сумма <> 0 ИЛИ СуммаУпр <> 0) И
	|	ФормаОтношений = Значение(Перечисление.ФормаОтношений.Клиент)
	
	//----------------------по одному-----------------------------
	|","
	
	// ВЗАИМОРАСЧЕТЫ
	
	|ВЫБРАТЬ
	|	Дата				Период,
	|	&ВидДвиженияПриход	ВидДвижения,
	|	Организация			Организация,
	|	Партнер				Партнер,
	|	Контрагент			Контрагент,
	|   ФормаОтношений,
	|   Сумма				Сумма,
	|	СуммаУпр			СуммаУпр
	|ИЗ
	|	Документ.КорректировкаДолга
	|ГДЕ
	|	Ссылка = &Ссылка
	|;
		
	// Долги по отгрузкам
	
	|ВЫБРАТЬ
	|	Дата			Период,
	|	&ВидДвиженияПриход	ВидДвижения,
	|	Организация			Организация,
	|	Партнер				Партнер,
	|	Контрагент			Контрагент,
	|	Заказ			    Заказ,
	|	ДокументОтгрузки	ДокументОтгрузки,
	|   СуммаУпр			Сумма
	|ИЗ
	|	Документ.КорректировкаДолга
	|ГДЕ
	|	Ссылка = &Ссылка И
	|	ФормаОтношений = Значение(Перечисление.ФормаОтношений.Клиент)
	|"));
	
	
	//СуммаОперации = Ссылка.Сумма - Ссылка.ДолгДоКорректировки;
	
	
	Запрос.УстановитьПараметр("ВидОперацииКорректировка",	Перечисления.ВидыОперацийВзаиморасчетов.Корректировка);
	//Запрос.УстановитьПараметр("СуммаОперации",				СуммаОперации);
	Запрос.УстановитьПараметр("Ссылка", 					Ссылка);
	Запрос.УстановитьПараметр("ВидДвиженияПриход", 			ВидДвиженияНакопления.Приход);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ДополнительныеСвойства.Вставить("Взаиморасчеты", 	Пакет[1].Выгрузить());
	ДополнительныеСвойства.Вставить("ДолгиПоОтгрузкам", 	Пакет[2].Выгрузить());
	
	
КонецПроцедуры
