
// ПРЕДОПРЕДЕЛЕННЫЕ ФУНКЦИИ

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Подготовка
	
	Заголовок = КонтрольПроведения.ПолучитьСтандарнтыйЗаголовокПриПроведенииДокумента(Ссылка);
	
	Документы[Метаданные().Имя].ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Проведение
	
	ПроведенияДокументов.ПровестиПоВсемРегистрам(Метаданные().Движения, ДополнительныеСвойства, Движения, Отказ);
	
	// Запись
	
	Движения.Записать();
		
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ПоПартнеруСписком Тогда 
		
		// Подсчитаем итог
		
		Сумма = ПоПартнеру.Итог("Сумма");
		
		// Покажем партнеров
		
		ТЗПартнеров = ПоПартнеру.Выгрузить(,"Партнер");
		ТЗПартнеров.Свернуть("Партнер");
		ПартнерыСтр = СтрСоединить(ТЗПартнеров.ВыгрузитьКолонку("Партнер"), ","); 
		
	Иначе
		
		ПартнерыСтр = Строка(Партнер); КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	текОрганизация = ПроверяемыеРеквизиты.Найти("Организация");
	Если текОрганизация <> Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(текОрганизация); КонецЕсли;
	
КонецПроцедуры

