
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДок = Новый ТабличныйДокумент;
	Если ТипЗнч(ПараметрКоманды[0]) = Тип("ДокументСсылка.ПоступлениеТоваров") ИЛИ
		ТипЗнч(ПараметрКоманды[0]) = Тип("ДокументСсылка.ВнутреннийЗаказ") ИЛИ
		ТипЗнч(ПараметрКоманды[0]) = Тип("ДокументСсылка.ПеремещениеТоваров") ИЛИ
		ТипЗнч(ПараметрКоманды[0]) = Тип("ДокументСсылка.УстановкаЦенНоменклатуры") Тогда
		
		ДокументПечать(ПараметрКоманды);
				
    Иначе
		Печать(ПараметрКоманды)

	КонецЕсли;
	     
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивТоваров(Ссылка)
	
	ВремТаблица = Ссылка.Товары.Выгрузить(, "Номенклатура");
	ВремТаблица.Свернуть("Номенклатура");
	
	Возврат ВремТаблица.ВыгрузитьКолонку("Номенклатура");
	
КонецФункции

&НаКлиенте
Процедура ДокументПечать(ПараметрКоманды)
	
	МассивТоваров = Новый Массив;
	
	Инд = -1;
	Для Каждого Ссылка Из ПараметрКоманды Цикл Инд = Инд + 1;
			
		КонвертацияТипов.ДобавитьМассивВКонецМассива(МассивТоваров, ПолучитьМассивТоваров(Ссылка));
			
	КонецЦикла;
	
	Печать(МассивТоваров);
	
КонецПроцедуры

&НаКлиенте
Функция Печать(ПараметрКоманды, ПараметрыПечати = Неопределено)
	
	ОткрытьФорму("Обработка.ПечатьЦенников.Форма", Новый Структура("МассивТоваров", ПараметрКоманды));
	
КонецФункции
