
Процедура ЗаказДоставленПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = Заказы.ПолучитьСостояниеДокументаОтгрузки(ДокументОтгрузки) = Перечисления.СостоянияЗаказа.Доставлен;
КонецПроцедуры

Процедура ЗаказОтправленПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = Заказы.ПолучитьСостояниеДокументаОтгрузки(ДокументОтгрузки) = Перечисления.СостоянияЗаказа.Отправлен;
КонецПроцедуры

Процедура УстановитьЗадачеРеквизитыПоУмолчанию(ФормируемыеЗадачи)
	
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		Задача.Наименование = ФункцииБизнесПроцессов.ПредставлениеЗадачиПоЗаказу(Задача, Заказ);
		Задача.Склад 		= Заказ.Склад;
		Задача.Заказ 		= Заказ;
		//Задача.Параллельная = Истина;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОтправитьЗаказКлиентуПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	УстановитьЗадачеРеквизитыПоУмолчанию(ФормируемыеЗадачи);
КонецПроцедуры

Процедура ПодтверждениеДоставкиЗаказаПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	УстановитьЗадачеРеквизитыПоУмолчанию(ФормируемыеЗадачи);
КонецПроцедуры
