
&НаКлиенте
Процедура ПериодическийПриИзменении(Элемент)
	Элементы.ДатаОкончания.Видимость = Объект.Периодический;
	Элементы.Период.Видимость = Объект.Периодический;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПериодическийПриИзменении(Неопределено);
КонецПроцедуры


#Область СтатьяДДС

&НаКлиенте
Процедура РасходыСтатьяПриИзменении(Элемент)
	ПриИзмененииСтатьиДДС(Элементы.Расходы.ТекущиеДанные.Статья, Элементы.Расходы.ТекущиеДанные.СтатьяДДСБух);
КонецПроцедуры

&НаКлиенте
Процедура РасходыСтатьяДДСБухПриИзменении(Элемент)
	ПриИзмененииСтатьиДДС(Элементы.Расходы.ТекущиеДанные.СтатьяДДСБух, Элементы.Расходы.ТекущиеДанные.Статья);
КонецПроцедуры

Процедура ПриИзмененииСтатьиДДС(Статья, Вторая)
	ФункцииФормДокументов.ПриИзмененииСтатьиДДС(Статья, Вторая);
КонецПроцедуры // ПриИзмененииСтатьиДДС()

#КонецОбласти