
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("Контакт, ЗакрыватьПриЗакрытииВладельца", ПараметрКоманды, Истина);
	ОткрытьФорму("Обработка.КонтактнаяИнформация.Форма.ФормаГлавная", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность);
//	ОткрытьФорму("Обработка.КонтактнаяИнформация.Форма", Новый Структура("Контакт, ЗакрыватьПриЗакрытииВладельца", Элементы.Список.ТекущаяСтрока, Истина), ЭтаФорма, УникальныйИдентификатор); КонецЕсли;

КонецПроцедуры
