
Процедура СформироватьОтчет(ТабДок, мИдентификаторФормы, мДанныеРасшифровки) Экспорт
		
	ОсновнаяСхема = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	ДанныеРасшифровкиКомпоновки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	ПараметрыОтчета = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	ПараметрыОтчета.УстановитьЗначениеПараметра("НачалоПериода", ПериодДат.ДатаНачала);
	ПараметрыОтчета.УстановитьЗначениеПараметра("КонецПериода", ПериодДат.ДатаОкончания);
	ПараметрыОтчета.УстановитьЗначениеПараметра("ТипЦены", Справочники.ТипыЦен.НайтиПоКоду("000000007")); // закупочная, руб.
	ПараметрыОтчета.УстановитьЗначениеПараметра("ТипЦеныУЕ", Справочники.ТипыЦен.НайтиПоКоду("000000028")); // себестоимость, уе.
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(ОсновнаяСхема, КомпоновщикНастроек.Настройки, ДанныеРасшифровкиКомпоновки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровкиКомпоновки, Истина); 
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабДок);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Адрес = ПоместитьВоВременноеХранилище(ДанныеРасшифровкиКомпоновки, мИдентификаторФормы);
	мДанныеРасшифровки = Адрес;
	
КонецПроцедуры
