
Процедура ПередЗаписью(Отказ)
	ДополнительныеСвойства.Вставить("СтарыйОбъект", Новый Структура("ВыгружатьНаСайт, ОсновнойСкладНаСайте, ВыгружатьНаСайтВместеСОсновным", 
		Ссылка.ВыгружатьНаСайт,
		Ссылка.ОсновнойСкладНаСайте,
		Ссылка.ВыгружатьНаСайтВместеСОсновным));
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	// Проверить
	СказатьОВажностиWarehouseZones = Ложь;
	Для каждого кИз Из ДополнительныеСвойства.СтарыйОбъект Цикл
		Если киз.Значение <> ЭтотОбъект[киз.Ключ] Тогда
			СказатьОВажностиWarehouseZones = Истина;
		КонецЕсли;
	КонецЦикла;
	Если СказатьОВажностиWarehouseZones Тогда
		ОбщиеФункции.ОповеститьПоПочте("s.d@garagetools.ru", "Изменены важные поля у склада", "У склада """ + ЭтотОбъект.Ссылка + """ (" + Строка(ЭтотОбъект.Ссылка.УникальныйИдентификатор()) + ")" + " изменены важные поля. Необходимо проверить актуальность Warehouse Zones в админке сайта. Сообщите администратору сайта", Ложь);
	КонецЕсли;
КонецПроцедуры

