
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И Ссылка.ЗаказыОтправлены <> ЗаказыОтправлены Тогда
		ДатаПроведения = ТекущаяДата();
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения_Ст(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос("ВЫБРАТЬ Заказ, Истина Отправлен ИЗ Документ.НарядНаЗагрузку.ТабЗаказов ГДЕ Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	НачатьТранзакцию();
	
	Пока Выборка.Следующий() Цикл
		
		Запись = РегистрыСведений.ОтправкаЗаказов.СоздатьМенеджерЗаписи(); 
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Если Не ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(Запись) Тогда
			Отказ = Истина; КонецЕсли; КонецЦикла;
	
	Если Отказ Тогда 
		ОтменитьТранзакцию()
	Иначе
		ЗафиксироватьТранзакцию(); КонецЕсли;
	
КонецПроцедуры
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Подготовка

	Заголовок = КонтрольПроведения.ПолучитьСтандарнтыйЗаголовокПриПроведенииДокумента(Ссылка);

	Документы[Метаданные().Имя].ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства);

	// Проведение

	Если Не Отказ Тогда ПроведенияДокументов.ПровестиПоВсемРегистрам(Метаданные().Движения, ДополнительныеСвойства, Движения, Отказ); КонецЕсли;

	// Запись

	Движения.Записать();

	// Обновим статусы заказов
	Табл = ТабЗаказов.Выгрузить(,"Заказ");
	Табл.Свернуть("Заказ");

	Для Каждого Строка Из Табл Цикл 
		Если ТипЗнч(Строка.Заказ)<>Тип("ДокументСсылка.ЗаказПокупателя")
		   И ТипЗнч(Строка.Заказ)<>Тип("ДокументСсылка.ИнтернетЗаказПокупателя")
		   И ТипЗнч(Строка.Заказ)<>Тип("ДокументСсылка.ВнутреннийЗаказ")
		   И ТипЗнч(Строка.Заказ)<>Тип("ДокументСсылка.ЗаказНаряд") Тогда
			Продолжить;
		КонецЕсли;
		Заказы.ОбновитьРеквизитыЖурнала(Строка.Заказ);
	КонецЦикла;

	УстановитьПривилегированныйРежим(Истина);
	Для Каждого ТекСтрока Из ТабЗаказов Цикл
		Если ЗначениеЗаполнено(ТекСтрока.ТрекНомер) И ЗначениеЗаполнено(ТекСтрока.ДокументОтгрузки) И ЗначениеЗаполнено(ТекСтрока.Заказ) Тогда
			НовРег = РегистрыСведений.ТрекНомерПоДокументамОтгрузки.СоздатьМенеджерЗаписи();
			НовРег.Период = ДатаПроведения;			
			НовРег.ДокументОтгрузки = ТекСтрока.ДокументОтгрузки;
			НовРег.Заказ = ТекСтрока.Заказ;
			НовРег.НарядНаЗагрузку = Ссылка;
			НовРег.ТрекНомер = ТекСтрока.ТрекНомер;
			Если НЕ ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(НовРег,Истина) Тогда
				Отказ = Истина;
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	
	
КонецПроцедуры
