
Процедура ПрименитьИзменения() Экспорт
	
	Если Заказ.Организация = Организация Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСтавкуНДС = Ложь;
	
	Если Заказ.Организация.УчитыватьНДС <> Организация.УчитыватьНДС Тогда
		ЗаполнитьСтавкуНДС = Истина;
	КонецЕсли;
	
	// замена ставки ндс
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                     |	ЗаказыПокупателей.Регистратор
	                     |ИЗ
	                     |	РегистрНакопления.ЗаказыПокупателей КАК ЗаказыПокупателей
	                     |ГДЕ
	                     |	ЗаказыПокупателей.ЗаказПокупателя = &Заказ
	                     |
	                     |СГРУППИРОВАТЬ ПО
	                     |	ЗаказыПокупателей.Регистратор");
						 
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Выборка = Запрос.Выполнить().Выбрать();
	
	//ЗаказОбъект = ЗаказНаряд.ПолучитьОбъект();
	//ЗаказОбъект.Организация = Касса.Организация;
	//
	//ЗаполнитьЗначенияСвойств(СтруктураКолонокТовары, ЗаказОбъект); 

	//СтруктураКолонокТовары.ЕстьВсего = Ложь;
	//СтруктураРеквизитов = ФункцииФормДокументов.ОрганизацияПриИзменении(ЗаказОбъект);
	//
	//Для Каждого Строка ИЗ СтруктураРеквизитов Цикл
	//	Имя = Строка.Ключ;
	//	Если СтруктураКолонокТовары.Свойство("ст" + Имя) Тогда
	//		СтруктураКолонокТовары["ст" + Имя] = СтруктураКолонокТовары[Имя];	
	//	КонецЕсли;
	//КонецЦикла;
	//
	//ЗаполнитьЗначенияСвойств(СтруктураКолонокТовары, СтруктураРеквизитов);
	//
	//Для Каждого СтрокаТовара ИЗ ЗаказОбъект.Товары Цикл
	//	
	//	ФункцииФормДокументов.РассчитатьСуммыТабличныхЧастей(СтрокаТовара, СтруктураКолонокТовары);
	//	СтрокаТовара.Сумма = ?(СтрокаТовара.Гарантия, 0, СтрокаТовара.Сумма);

	//КонецЦикла;			
	//
	//Попытка
	//	ЗаказОбъект.Записать(?(ЗаказОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
	//Исключение
	//	стрОшибки = ОписаниеОшибки();
	//	ОбщиеФункции.СообщитьТекст("Ошибка при записи заказ-наряда
	//							|" + стрОшибки);
	//	Возврат Ложь;
	//КонецПопытки;
	//
	//Организация =  ЗаказОбъект.Организация;
	//
	//Если Касса.Организация = Организация Тогда
	//	Возврат Истина;
	//КонецЕсли;
	//
	//Возврат Ложь;
						 
	                               
КонецПроцедуры