
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОткрытьФорму(	"ОбщаяФорма.НастроенныйОтчет",
					Новый Структура("ИмяОтчета, ИмяМакета, Отборы, ЗаголовокОкна",
						"ДолгиПоОтгрузкам",
						"ДвижениеПоПартнеру",
						Новый Структура("Контрагент", 
											ПараметрКоманды),
						"Долги по отгрузкам (" + ПараметрКоманды + ")"),
					ПараметрыВыполненияКоманды.Источник,
					ПараметрыВыполненияКоманды.Уникальность,
					ПараметрыВыполненияКоманды.Окно);

КонецПроцедуры
