
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если Количество() Тогда
		
		// Проверим чтобы склад был не таможенный
		
		Для Каждого Запись Из ЭтотОбъект Цикл Если Запись.Склад.Таможня Тогда ОбщиеФункции.СообщитьТекст(Строка(Запись.Склад) + " это таможенный склад!"); Отказ = Истина; Прервать; КонецЕсли; КонецЦикла;
		
		// Добавим для сайта
		
		Если 	Не Отказ И Константы.ИнтеграцияССайтом.Получить() Тогда
			HTTP.ЗаписатьВсюНоменклатуруДляПередачиНаСайтИзНабора_ФоновымЗаданием(ЭтотОбъект);
		КонецЕсли; 
	КонецЕсли;
							
КонецПроцедуры
