
Процедура СогласованПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = Заказ.Согласован;
КонецПроцедуры


Процедура ОформлениеПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	Если НЕ Заказы.УстановитьСостояниеЗаказа(Заказ, ?(Заказ.Согласован, Перечисления.СостоянияЗаказа.Согласован, Перечисления.СостоянияЗаказа.НаСогласовании)) Тогда Отказ = Истина; КонецЕсли;
	
КонецПроцедуры


Процедура ОформлениеПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)

	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		Задача.Наименование = Задача.Наименование + " (" + Заказ.Партнер + ")";
		Задача.Пользователь = Заказ.Автор;
	КонецЦикла;
	
	Если НЕ Заказы.УстановитьСостояниеЗаказа(Заказ, Перечисления.СостоянияЗаказа.Редактируется) Тогда Отказ = Истина; КонецЕсли;

КонецПроцедуры

Процедура ЗавершитьСогласованиеОбработка(ТочкаМаршрутаБизнесПроцесса)
	

КонецПроцедуры

Процедура СогласованиеСПоставщикомПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		Задача.Наименование = Задача.Наименование + " (" + Заказ.Партнер + ")";
	КонецЦикла;

КонецПроцедуры

Процедура Согласован1ПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	Результат = Заказ.Согласован; 
КонецПроцедуры
