
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Таблица = ПолучитьИзВременногоХранилища(Параметры.АдресТоваровВХранилище);
	УдалитьИзВременногоХранилища(Параметры.АдресТоваровВХранилище); 

	Для Каждого Строка Из Таблица Цикл
		НоваяСтрока = ТаблицаПодбораАналогов.Добавить();
		НоваяСтрока.Номенклатура = Строка.Номенклатура;
		НоваяСтрока.АртикулНоменклатуры = Строка.Номенклатура.Артикул;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	
	КоличествоСимволов = СтрЧислоВхождений(ШаблонАртикула,"?");
	ШаблонЗамены = "";
	
	Для Номер = 1 По КоличествоСимволов Цикл
		ШаблонЗамены = ШаблонЗамены + "?";	
	КонецЦикла;
	
	
	
	НомерСтроки = ЗаполнениеНачало;
	Для Каждого Строка Из ТаблицаПодбораАналогов Цикл
		Если СтрДлина(""+НомерСтроки) > КоличествоСимволов Тогда
			Строка.Аналог = Неопределено;
			Строка.АртикулАналога = "";
			Продолжить;
		КонецЕсли;
		
				
		ИскомыйАртикул = СтрЗаменить(ШаблонАртикула, ШаблонЗамены, Формат(НомерСтроки, "ЧЦ=" + КоличествоСимволов + "; ЧВН="));

		Аналог = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",ИскомыйАртикул);
		Если Аналог <> Справочники.Номенклатура.ПустаяСсылка() Тогда
			Строка.Аналог = Аналог;
			Строка.АртикулАналога = Аналог.Артикул;
		Иначе 
			Строка.Аналог = Неопределено;
			Строка.АртикулАналога = "";
		КонецЕсли;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	ОповеститьОВыборе(ПоместитьВХранилище());
КонецПроцедуры

&НаСервере
Функция ПоместитьВХранилище()
	
	Возврат ПоместитьВоВременноеХранилище(ТаблицаПодбораАналогов.Выгрузить(), УникальныйИдентификатор);

КонецФункции


&НаКлиенте
Процедура ТаблицаПодбораАналоговПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
		Элементы.ТаблицаПодбораАналогов.ТекущиеДанные.АртикулНоменклатуры = ПолучитьАртикул(Элементы.ТаблицаПодбораАналогов.ТекущиеДанные.Номенклатура); 
		Элементы.ТаблицаПодбораАналогов.ТекущиеДанные.АртикулАналога = ПолучитьАртикул(Элементы.ТаблицаПодбораАналогов.ТекущиеДанные.Аналог);

КонецПроцедуры

&НаСервере
Функция ПолучитьАртикул(Товар)
	Возврат Товар.Артикул;
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
		//Элементы.ТаблицаПодбораАналогов.Обновить();
		//ОбновитьОтображениеДанных();
КонецПроцедуры

