
&НаКлиенте
Процедура ОбновитьКарточкуКонтакта(Контакт) Экспорт
	Если Контакт <> Неопределено Тогда
		КарточкаКонтрагента = УправлениеКонтактнойИнформацией.ПолучитьКарточкуКонтактаHTML(Контакт, "Контрагенты");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТекущийКонтрагент") Тогда
		Контрагент = Параметры.ТекущийКонтрагент;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Список.ТекущаяСтрока <> Неопределено Тогда
		ОбновитьКарточкуКонтакта(Элементы.Список.ТекущаяСтрока);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	СтруктураПараметров = Новый Структура("Контрагент", Контрагент);	
	Форма = ПолучитьФорму("Справочник.Контрагенты.Форма.ФормаЭлемента", СтруктураПараметров);
	Форма.Открыть();

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПриЗакрытииФормыЭлемента" Тогда
		ОбновитьКарточкуКонтакта(Параметр);
	КонецЕсли;

КонецПроцедуры
