
&НаСервере
Процедура ДобавитьВМассивНоменклатуры(Документ, МассивНоменклатуры)
	
	ИмяДок = Документ.Метаданные().Имя;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ Номенклатура ИЗ Документ." + ИмяДок + ".Товары ГДЕ Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Документ);
	
	КонвертацияТипов.ДобавитьМассивВКонецМассива(МассивНоменклатуры, Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
	ПоказатьВводЗначения(Новый ОписаниеОповещения("ОкончаниеВводаПараметровОтчета", ЭтотОбъект, ПараметрКоманды), КэшируемыеФункции.ВалютаУправленческогоУчета(), "Валюта цен"); 	
	
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеВводаПараметровОтчета(ВыбЗнач, Параметры) Экспорт
	
	МассивНоменклатуры = Новый Массив;
	
	Для Каждого Параметр Из Параметры Цикл
		
		ДобавитьВМассивНоменклатуры(Параметр, МассивНоменклатуры);
		
	КонецЦикла;
	
	ПараметрыФормы = Новый Структура("Отбор, КлючНазначенияИспользования, СформироватьПриОткрытии", 
	 							Новый Структура("Номенклатура, Валюта", 
											МассивНоменклатуры, ВыбЗнач),,
								Истина);
								
	ОткрытьФорму("Отчет.ПрайсЛистПоступления.ФормаОбъекта", ПараметрыФормы); 
	
	
	
КонецПроцедуры