
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	Партнеры.Ссылка,
	//	|	Партнеры.ОсновнойМенеджер,
	//	|	Партнеры.ОсновнойРегион
	//	|ИЗ
	//	|	Справочник.Партнеры КАК Партнеры
	//	|ГДЕ
	//	|	Партнеры.ОсновнойМенеджер = &ОсновнойМенеджерВПартнере
	//	|	И Партнеры.ОсновнойРегион = &РегионВПартнере";
	//
	//Запрос.УстановитьПараметр("ОсновнойМенеджерВПартнере", ОсновнойМенеджерВПартнере);
	//Запрос.УстановитьПараметр("РегионВПартнере", РегионВПартнере);
	//
	//РезультатЗапроса = Запрос.Выполнить();
	//ТабПартнеры.Загрузить(РезультатЗапроса.Выгрузить());
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Контрагенты.Ссылка,
		|	Контрагенты.ОсновнойМенеджер,
		|	Контрагенты.ОсновнойРегион
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ОсновнойМенеджер = &ОсновнойМенеджерВКонтрагенте";
		//|	И Контрагенты.ОсновнойРегион = &РегионВПартнере";
	
		Запрос.УстановитьПараметр("ОсновнойМенеджерВКонтрагенте", ОсновнойМенеджерВКонтрагенте);
		
		Если ЗначениеЗаполнено(РегионВКонтрагенте) Тогда
			Запрос.Текст = Запрос.Текст + " И Контрагенты.ОсновнойРегион = &РегионВКонтрагенте";
			Запрос.УстановитьПараметр("РегионВКонтрагенте", РегионВКонтрагенте);
		КонецЕсли;
		
		РезультатЗапроса = Запрос.Выполнить();
		ТабПартнеры.Загрузить(РезультатЗапроса.Выгрузить());

КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаменитьНаСервере()
	Для Каждого Стр Из ТабПартнеры Цикл
		ЭлСпр=Стр.Ссылка;
		Спр=ЭлСпр.получитьОбъект();
		Спр.ОсновнойМенеджер=ПоменятьНаМенеджера;
		Спр.Записать();
	КонецЦикла;
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Заменить(Команда)
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса",
      ЭтотОбъект);	
 
    ПоказатьВопрос(Оповещение,
        "Выполнить?",
        РежимДиалогаВопрос.ДаНетОтмена,
        0, // таймаут в секундах
        КодВозвратаДиалога.Да, // (необ.) кнопка по умолчанию
        "" // (необ.) заголовок
    );    
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
 
    Если Результат = КодВозвратаДиалога.Да Тогда
       ЗаменитьНаСервере();
	   Сообщить("Выполнено");
   КонецЕсли;	
 
КонецПроцедуры
