
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Пользователь") Тогда Пользователь=Параметры.Пользователь;  КонецЕсли;
	Если Параметры.Свойство("Сценарий") Тогда Сценарий=Параметры.Сценарий;          КонецЕсли;
	Если Параметры.Свойство("ДатаЗапретаРЕдактирования") Тогда ДатаЗапретаРЕдактирования=Параметры.ДатаЗапретаРЕдактирования;          КонецЕсли;
	
	ОбновитьТабЧасти(Пользователь,Сценарий);
	
КонецПроцедуры

Процедура ОбновитьТабЧасти(Пользователь,Сценарий);
	Отделы.Очистить();
	СтатьиБюджета.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НастройкиДоступаБюджетирование.ОбъектДоступа
	|ИЗ
	|	РегистрСведений.НастройкиДоступаБюджетирование КАК НастройкиДоступаБюджетирование
	|ГДЕ
	|	НастройкиДоступаБюджетирование.Сценарий = &Сценарий
	|	И НастройкиДоступаБюджетирование.Пользователь = &Пользователь";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Сценарий", Сценарий);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ТипЗнч(ВыборкаДетальныеЗаписи.ОбъектДоступа) = Тип("СправочникСсылка.Отделы") Тогда
			НоваяСтрока=Отделы.Добавить();
			НоваяСтрока.Отдел=ВыборкаДетальныеЗаписи.ОбъектДоступа;
		ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.ОбъектДоступа) = Тип("СправочникСсылка.СтатьиБюджета")  Тогда
			НоваяСтрока=СтатьиБюджета.Добавить();
			НоваяСтрока.СтатьяБюджета=ВыборкаДетальныеЗаписи.ОбъектДоступа;
        КонецЕсли;
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	ЕСли  Пользователь <> Справочники.Пользователи.ПустаяСсылка() Тогда
		ДатаЗапретаРедактирования="";
    Иначе		
	    Отделы.Очистить();
	    СтатьиБюджета.Очистить();
	КонецЕсли;

	
	НаборЗаписей = РегистрыСведений.НастройкиДоступаБюджетирование.СоздатьНаборЗаписей();
	
	НаборЗаписей.Отбор.Сценарий.Установить(Сценарий); 
	НаборЗаписей.Отбор.Пользователь.Установить(Пользователь);
		
	Для Каждого СтрОтдел Из Отделы Цикл
		
		НоваяЗапись = НаборЗаписей.Добавить(); 
		
		НоваяЗапись.Сценарий = Сценарий; 
		НоваяЗапись.Пользователь = Пользователь; 
		НоваяЗапись.ОбъектДоступа = СтрОтдел.Отдел;
		
	КонецЦикла;
	
	Для Каждого СтрСтатья Из СтатьиБюджета Цикл
		
		НоваяЗапись = НаборЗаписей.Добавить(); 
		
		НоваяЗапись.Сценарий = Сценарий; 
		НоваяЗапись.Пользователь = Пользователь; 
		НоваяЗапись.ОбъектДоступа = СтрСтатья.СтатьяБюджета;
		
	КонецЦикла;
	
	Если ЗначениеЗАполнено(ДатаЗапретаРедактирования) тогда
		
		НоваяЗапись = НаборЗаписей.Добавить(); 
		
		НоваяЗапись.Сценарий = Сценарий; 
		НоваяЗапись.Пользователь = Справочники.Пользователи.ПустаяСсылка(); 
		НоваяЗапись.ОбъектДоступа = ДатаЗапретаРедактирования;

	КонецЕсли;	
	
	НаборЗаписей.Записать(); 
	
	ОбновитьТабЧасти(Пользователь,Сценарий);
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();
КонецПроцедуры
