
Процедура Admitad(Источник, Отказ, РежимПроведения) Экспорт 
	
	Если ЗначениеЗАполнено (Источник.Admitad_uid) Тогда  
	
	Заказ=Источник.Ссылка;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Отправка_Admitad.Заказ
	|ИЗ
	|	РегистрСведений.Отправка_Admitad КАК Отправка_Admitad
	|ГДЕ
	|	Отправка_Admitad.Заказ = &Заказ";
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не  РезультатЗапроса.Пустой() Тогда
		Возврат;
	Иначе 
				
		СерверAdmitad = Константы.Сервер_Admitad.Получить();
		
		Соединение = Новый HTTPСоединение(СерверAdmitad,,,,,,Новый ЗащищенноеСоединениеOpenSSL);   //ad.admitad.com
		
		Для Каждого Товар Из  Заказ.Товары  Цикл
			
			Запрос = Новый HTTPЗапрос("/r?campaign_code=105ff51b0e&postback=1&postback_key=B7FC0cBaeBa2cd317Dc035ADe64ce510&action_code=1&uid="+СокрЛП(Заказ.Admitad_uid)+"&order_id="+Заказ.УникальныйИдентификатор()+
			"&tariff_code=1&price="+Формат(Товар.Цена, "ЧГ=")+"&position_count="+Формат(Заказ.Товары.Количество(), "ЧГ=")+"&position_id="+Формат(Товар.НомерСтроки," ЧГ=")+"&quantity="+Формат(Товар.Количество, "ЧГ=")+"&product_id="+Товар.Номенклатура.УникальныйИдентификатор()+
			"&payment_type=sale&client_id="+Заказ.Контрагент.Уникальныйидентификатор());
			
			// https://ad.admitad.com/r
			
			Ответ = Соединение.ОтправитьДляОбработки(Запрос);
			ОтправленыВсеСтроки=Истина;
			
			Если Не Ответ.КодСостояния = 200 тогда 
				
				ОтправленыВсеСтроки=Ложь;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ОтправленыВсеСтроки Тогда
			
			НаборЗаписей = РегистрыСведений.Отправка_Admitad.СоздатьНаборЗаписей(); 
			НаборЗаписей.Отбор.Заказ.Установить(Заказ); 
			
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Заказ   = Заказ;  
			НаборЗаписей.Записать();
			
		КонецЕсли;
	КонецЕСли;
	КонецЕСли;
КонецПроцедуры	
