
////////////////////////////////////////////////////////////////////////////////
// КОНТАКТНАЯ ИНФОРМАЦИЯ

&НаКлиенте
Процедура КонтактнаяИнформацияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	УправлениеКонтактнойИнформациейКлиент.ПриНачалеРедактирования(ЭтаФорма, Объект.Ссылка, НоваяСтрока, Копирование);

КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиент.ПредставлениеНачалоВыбора(ЭтаФорма, Объект.Ссылка, Модифицированность, СтандартнаяОбработка);
	
КонецПроцедуры

Функция ЗаписатьЭтотОбъект() Экспорт
	
	Попытка
		Рез = Записать();
	Исключение
		Сообщить("Ошибка сохранения данных: " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;

	Возврат Рез;
	
КонецФункции
 
&НаКлиенте
Процедура КонтактнаяИнформацияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Объект.Ссылка.Пустая() Тогда
	
	Ответ = Вопрос("Данные еще не записаны" + Символы.ПС + 
					"Переход к заполнению Контактной Информации возможен только после записи данных" + Символы.ПС +
					"Данные будут записаны", РежимДиалогаВопрос.ОКОтмена, 0);
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
	   Отказ = Истина; 
	   Возврат;
	КонецЕсли;
	
	Если НЕ ЗаписатьЭтотОбъект() Тогда
		Возврат;
	КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Обработчик механизма "Контактная информация"
	УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтаФорма, Объект.Ссылка);
    ЗаполнитьОтветственныеЛица();	
	
	guid = XMLСтрока(Объект.Ссылка);
	
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Обработчик механизма "Контактная информация"
	УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект.Ссылка, Отказ);
    СохранитьОтветственныеЛица();
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////
// ОТВЕТСТВЕННЫЕ ЛИЦА

Процедура ЗаполнитьОтветственныеЛица()
	
	Запрос = Новый Запрос("	ВЫБРАТЬ
							|	ОтветственноеЛицо,
							|	ФизическоеЛицо,
							|	Должность
							|ИЗ
							|	РегистрСведений.ОтветственныеЛицаОрганизации.СрезПоследних(, Организация = &Организация)
							|");
	Запрос.УстановитьПараметр("Организация", Объект.Ссылка);

	Рез = Запрос.Выполнить();
	Если НЕ Рез.Пустой() Тогда
		ОтветственныеЛица.Загрузить(Рез.Выгрузить());
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтветственныеЛицаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	Если Объект.Ссылка.Пустая() Тогда
	
	Ответ = Вопрос("Данные еще не записаны" + Символы.ПС + 
					"Переход к заполнению Ответственных Лиц возможен только после записи данных" + Символы.ПС +
					"Данные будут записаны", РежимДиалогаВопрос.ОКОтмена, 0);
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
	   Отказ = Истина; 
	   Возврат;
	КонецЕсли;
	
	Если НЕ ЗаписатьЭтотОбъект() Тогда
		Возврат;
	КонецЕсли;

	КонецЕсли;

КонецПроцедуры

Процедура СохранитьОтветственныеЛица()
	
	// ничего лучше не придумалось
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос("	ВЫБРАТЬ
							|	ОтвЛица.ОтветственноеЛицо,
							|   ОтвЛица.ФизическоеЛицо,
							|	ОтвЛица.Должность
							|ПОМЕСТИТЬ
							|	ОтвЛицаОрганизации
							|ИЗ
							|	&ВыбТаблица КАК ОтвЛица");
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	                                     
	Запрос.УстановитьПараметр("ВыбТаблица", ОтветственныеЛица.Выгрузить());
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ
					|	Таб.ФизическоеЛицо,
					|	Таб.ОтветственноеЛицо,
					|	Таб.Должность
					|ИЗ
					|	Перечисление.ОтветственныеЛицаОрганизации Переч
					|	ЛЕВОЕ СОЕДИНЕНИЕ
					|	   (ВЫБРАТЬ Организация, ФизическоеЛицо, ОтветственноеЛицо, Должность ИЗ РегистрСведений.ОтветственныеЛицаОрганизации.СрезПоследних(, Организация = &Организация)) Рег
					|   ПО
					|		Переч.Ссылка = Рег.ОтветственноеЛицо
					|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
					|		ОтвЛицаОрганизации Таб
					|	ПО
					|		Переч.Ссылка = Таб.ОтветственноеЛицо
					|ГДЕ
					|	Таб.ФизическоеЛицо <> Рег.ФизическоеЛицо
					|	ИЛИ Таб.Должность <> Рег.Должность ИЛИ Рег.ОтветственноеЛицо ЕСТЬ NULL
					|";
					
	Запрос.УстановитьПараметр("Организация", Объект.Ссылка);						
	Рез 	= Запрос.Выполнить();
	
	Если НЕ Рез.Пустой() Тогда
		Выборка = Рез.Выбрать();
		
		Пока Выборка.Следующий() Цикл
		
			Запись = РегистрыСведений.ОтветственныеЛицаОрганизации.СоздатьМенеджерЗаписи();
   			Запись.Организация = Объект.Ссылка;
			Запись.Период = ТекущаяДата();
	        Запись.ОтветственноеЛицо = Выборка.ОтветственноеЛицо;
			
			Запись.ФизическоеЛицо = Выборка.ФизическоеЛицо;
			Запись.Должность = Выборка.Должность;
			
			Запись.Записать();
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры
