
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.Ссылка.Пустая() Тогда
		КартинкаНажатие(Неопределено, Истина);
	Иначе
		ОбновитьКартинку();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКартинку()
	АдресКартинки = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Картинка");
КонецПроцедуры

&НаКлиенте
Процедура КартинкаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	новАдресКартинки = "";
	ИмяФайла = "";
	Если ПоместитьФайл(новАдресКартинки, "", ИмяФайла, Истина, УникальныйИдентификатор) Тогда
		АдресКартинки = новАдресКартинки;
		Модифицированность = Истина;
		
		ИмяФайла = СтрЗаменить(ИмяФайла, "\", Символы.ПС);
		Объект.Наименование = СтрПолучитьСтроку(ИмяФайла, СтрЧислоСтрок(ИмяФайла));
		имяФайла = Объект.Наименование;
		ИмяФайла = СтрЗаменить(ИмяФайла, ".", Символы.ПС);
		Объект.Расширение = СтрПолучитьСтроку(ИмяФайла, СтрЧислоСтрок(ИмяФайла));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоАдресВременногоХранилища(АдресКартинки) Тогда
		ТекущийОбъект.Картинка = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресКартинки));
	КонецЕсли;
КонецПроцедуры
