
&НаСервере
Функция ОтброситьПоследнююТочку(ИмяФайла)
	
	// Послежнюю точку в названии не берет и все что от нее справа тоже остальное забираем
	
	новСтр	= "";
	стр 	= СтрЗаменить(ИмяФайла,".",Символы.ПС);
	строк 	= СтрЧислоСтрок(стр);
	Если строк = 1 Тогда Возврат ИмяФайла; КонецЕсли;
	Для Ном = 1 По строк - 1 Цикл новСтр = новСтр + ?(новСтр = "","",".") + СтрПолучитьСтроку(стр, Ном); КонецЦикла;
	
	Возврат новСтр;
	
КонецФункции

&НаСервере
Процедура УдалитьФайлыИзВременногоХранилищаНаСервере(Адреса)
	
	Для Каждого Элемент Из Адреса Цикл УдалитьИзВременногоХранилища(Элемент.Адрес) КонецЦикла
	
КонецПроцедуры
&НаСервере
Функция ПолучитьАдресаНаСервереВХранилище(текНоменклатура)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ	Ссылка, Наименование КАК ИмяФайла, ЭтоПредставлениеОбъекта, Картинка
	|ИЗ			Справочник.КартинкиНоменклатуры
	|ГДЕ 		Владелец = &Номенклатура
	|");
	
	Запрос.УстановитьПараметр("Номенклатура", текНоменклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Адреса = Новый Массив;
	
	Пока Выборка.Следующий() Цикл 
		
		Картинка = Выборка.Картинка.Получить(); 
		Если ТипЗнч(Картинка) = Тип("Картинка") Тогда
			Адрес = ПоместитьВоВременноеХранилище(Картинка); 
			Адреса.Добавить(Новый Структура("Адрес, Гуид, ИмяФайла, Расширение", 
					Адрес, 
					XMLСтрока(Выборка.Ссылка), 
					ОтброситьПоследнююТочку(Выборка.ИмяФайла), 
					НРег(Строка(Картинка.Формат())))); КонецЕсли;КонецЦикла;
	
	Возврат Адреса;
	
КонецФункции
&НаСервере
Функция ПолучитьТовары()
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ Ссылка ИЗ Справочник.Номенклатура ГДЕ Ссылка В ИЕРАРХИИ(&Ссылки) И НЕ ПометкаУдаления");
	Запрос.УстановитьПараметр("Ссылки", Номенклатура.ВыгрузитьЗначения());
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаКлиенте
Процедура ВыгрузитьНаКлиенте(ПолеИмениФайла)
	
	Ном 		= 0;
	Товары 		= ПолучитьТовары();
	Всего		= Товары.Количество();
	текКаталог	= ?(Прав(Каталог,1) = "\",Каталог, Каталог + "\");
	
	Для Каждого Товар Из Товары Цикл Ном = Ном + 1; ОбработкаПрерыванияПользователя();
		
		Адреса = ПолучитьАдресаНаСервереВХранилище(Товар);
		Для Каждого Элемент Из Адреса Цикл
			
			Картинка = ПолучитьИзВременногоХранилища(Элемент.Адрес);
			Картинка.Записать(текКаталог + Элемент[ПолеИмениФайла] + "." + Элемент.Расширение); 
			
			Если Всего > 1 Тогда
				Состояние("Записываю картинку" , Ном / Всего * 100 , Товар);КонецЕсли;КонецЦикла;
		
		УдалитьФайлыИзВременногоХранилищаНаСервере(Адреса);КонецЦикла; // чистим за собой
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаGUID(Команда)
	
	ВыгрузитьНаКлиенте("Гуид");
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаАртикул(Команда)
	
	//ВыгрузитьНаСервере("Артикул");
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаКакИмяФайла(Команда)
	
	ВыгрузитьНаКлиенте("ИмяФайла");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Номенклатура 	= Параметры.Номенклатура;
	//Каталог 		= Константы.КаталогКартинокДляСайта.Получить();
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДВ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Если ДВ.Выбрать() Тогда
		Каталог = ДВ.Каталог; КонецЕсли;
	
КонецПроцедуры
