
&НаКлиенте
Процедура ОбновитьКарточкуКонтакта(Контакт) Экспорт
	Если Контакт <> Неопределено Тогда
		КарточкаКонтактногоЛица = УправлениеКонтактнойИнформацией.ПолучитьКарточкуКонтактаHTML(Контакт, "КонтактныеЛица");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ОбновитьКарточкуКонтакта(Элементы.Список.ТекущаяСтрока);	

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ПриЗакрытииФормыЭлемента" Тогда
		ОбновитьКарточкуКонтакта(Параметр);
	КонецЕсли;
КонецПроцедуры
