
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДок = Новый ТабличныйДокумент;
	Если Не Печать(ТабДок, ПараметрКоманды) Тогда
		ПоказатьПредупреждение(,"Наряд на загрузку уже отправлен. Печатать можно только неотправленные документы.");
		Возврат;
	КонецЕсли;

	ФункцииФормДокументов.УстановитьНастройкиТабличногоДокумента(ТабДок);
	
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабДок.АвтоМасштаб = Истина;

	ТабДок.Показать();

КонецПроцедуры

&НаСервере
Функция Печать(ТабДок, ПараметрКоманды)
	
	//Инд = -1;
	//Для Каждого Ссылка Из ПараметрКоманды Цикл Инд = Инд + 1;
	//	
	//	Если Инд Тогда
	//		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	//	КонецЕсли;
	//	
	//		Документы.НарядНаЗагрузку.Печать_НарядНаЗагрузку(ТабДок, Ссылка, 2);
	//
	//КонецЦикла;
		
	Если ПараметрКоманды.ЗаказыОтправлены Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Документы.НарядНаЗагрузку.Печать_НарядНаЗагрузку(ТабДок, ПараметрКоманды, 2);
	Возврат Истина;
КонецФункции

