
&НаСервере
Функция НастройкаПользователя(ИмяНастройки)
	Возврат ОбщиеФункции.НастройкаПользователя(ИмяНастройки);
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = 
		Новый Структура("СформироватьПриОткрытии, Параметры",
					Истина,
	 				Новый Структура("ПутьККартинкам",
							НастройкаПользователя("ПутьККартинкам")
									));
	
	ОткрытьФорму("Отчет.РемонтируемыйТовар.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
