
&НаКлиенте
Процедура СкладыПометкаПриИзменении(Элемент)
//	ВсеСклады = КонвертацияТипов.ПолучитьОтмеченныеЗначенияСписка(Склады).Количество() = Склады.Количество();

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Если ЗначениеЗаполнено(Параметры.Поставщик) Тогда Поставщик = Параметры.Поставщик; КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	Склады = КонвертацияТипов.ПолучитьОтмеченныеЗначенияСпискаСписком(Склады);
	Закрыть(Новый Структура("Склады, Поставщик, Производитель, ТолькоПодтверженные, ПроизводительНеЗаполнен, КатегорияТовара", Склады, Поставщик, Производитель.ВыгрузитьЗначения(), ТолькоПодтверженные, ПроизводительНеЗаполнен, КатегорияТовара));

КонецПроцедуры

Функция ПолучитьПроизводителей()
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ Ссылка ИЗ Справочник.Производители ГДЕ НЕ ПометкаУдаления УПОРЯДОЧИТЬ ПО Наименование");
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаКлиенте
Процедура ПроизводительНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка =Ложь;	
	
	Производители 	= ПолучитьПроизводителей();
	СписокВыбора 	= Новый СписокЗначений;
	
	// Проставим отметки
	
	СтарыеОтметки = Новый Массив;
	
	СписокВыбора.ЗагрузитьЗначения(Производители);
	
	Для Каждого ЭлементСписка Из СписокВыбора Цикл
		
		ЭлементСписка.Пометка = Производитель.НайтиПоЗначению(ЭлементСписка.Значение) <> Неопределено;
		Если ЭлементСписка.Пометка Тогда
			СтарыеОтметки.Добавить(ЭлементСписка.Значение);
		КонецЕсли;
	КонецЦикла;
	
	// Выберем
	
	Если СписокВыбора.ОтметитьЭлементы("Выбор производителей:") Тогда 
		
		НовыеОтметки = Новый Массив;
		
		Производитель.Очистить();
		Для Каждого ЭлементСписка Из СписокВыбора Цикл
			Если ЭлементСписка.Пометка Тогда
				
				ВыбранноеЗначение = ЭлементСписка.Значение;
				
				Производитель.Добавить(ВыбранноеЗначение);
				
				Если СтарыеОтметки.Найти(ВыбранноеЗначение) = Неопределено Тогда
					НовыеОтметки.Добавить(ВыбранноеЗначение);
				КонецЕсли;
				
			КонецЕсли; 
		КонецЦикла;
		
	КонецЕсли;
	//ПроизводительНачалоВыбораНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
		
	Если ЗначениеЗаполнено(Параметры.Поставщик) Тогда
		Настройки.Удалить("Поставщик"); КонецЕсли;
	
	СкладыСохр = Настройки["Склады"];
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ Ссылка ИЗ Справочник.Склады ГДЕ НЕ ВАрхив И Не ПометкаУдаления УПОРЯДОЧИТЬ ПО Наименование");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл Склады.Добавить(Выборка.Ссылка,, СкладыСохр.НайтиПоЗначению(Выборка.Ссылка) <> Неопределено); КонецЦикла;
	
	Настройки.Удалить("Склады");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ Склады.Количество() Тогда ЗаполнитьСписокСкладов(); КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокСкладов()

	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ Ссылка ИЗ Справочник.Склады ГДЕ НЕ ВАрхив И Не ПометкаУдаления УПОРЯДОЧИТЬ ПО Наименование");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл Склады.Добавить(Выборка.Ссылка,, Истина); КонецЦикла;

КонецПроцедуры
