Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	ИменаРегистров = Новый Массив;
	ПоВсем=Ложь;
	Если Не ДополнительныеСвойства.Свойство("ИменаРегистров",ИменаРегистров) Тогда
		ПоВсем=Истина;
		ИменаРегистров = Новый Массив;
	КонецЕсли;	
	
	Нтаб=Новый Структура;
	ТекстЗапроса="выбрать ""фиктивный запрос для совместимости""";
	ТекНомер=0;	
	
	Если ИменаРегистров.Найти("ЦеныНоменклатуры")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ЦеныНоменклатуры",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		// ЦЕНЫ НОМЕНКЛАТУРЫ
		
		"ВЫБРАТЬ
		|	&Период		 			Период,
		|	НомерСтроки,
		|	Номенклатура,
		|	Себестоимость 			Цена,
		|	&ТипЦенСебестоимость	ТипЦен,
		|	&ВалютаУУ				Валюта
		|ИЗ
		|	Документ.РасчетСебестоимости.Себестоимость КАК Док
		|ГДЕ
		|	Док.Ссылка = &Ссылка
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&Период		 					Период,
		|	НомерСтроки,
		|	Номенклатура,                   
		|	МаркетинговаяСебестоимостьУЕ 	Цена,
		|	Док.Ссылка.ТипЦен				ТипЦен,
		|	Док.Ссылка.Валюта				Валюта
		|ИЗ
		|	Документ.РасчетСебестоимости.Себестоимость КАК Док
		|ГДЕ
		|	Док.Ссылка = &Ссылка	
		|"
	КонецЕсли;	
	
	
	Если ИменаРегистров.Найти("РасчетСебестоимости")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("РасчетСебестоимости",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		
		// РАСЧЕТ СЕБЕСТОИМОСТИ
		
		"ВЫБРАТЬ
		|	&Период				 	Период,
		|	НомерСтроки,
		|	Номенклатура,
		|	Ссылка.Инвойс							Инвойс,
		|	МаркетинговаяСебестоимость				Себестоимостьруб,
		|	МаркетинговаяСебестоимостьУЕ			Себестоимость,
		|	Удорожание,
		|	Себестоимость							СебестоимостьУпр,
		|	Ссылка.КурсОплаты                       КурсОплаты,
		|	ЦенаЗакупочная							ЦенаЗакупочная,
		|	// переводим в валюту управленческого учета
		|	(ТаможеннаяСтоимость/Количество)*(ЕСТЬNULL(Рег.Курс,1)/ЕСТЬNULL(Рег.Кратность,1))	ТаможеннаяСтоимость
		|ИЗ
		|	Документ.РасчетСебестоимости.Себестоимость КАК Док
		|	ЛЕВОЕ СОЕДИНЕНИЕ
		|		РегистрСведений.КурсыВалют.СрезПоследних(&Период, Валюта = &ВалютаДокумента) Рег
		|	ПО ИСТИНА
		|ГДЕ
		|	Док.Ссылка = &Ссылка
		|"
		
	КонецЕсли;	
	
	
	Если ИменаРегистров.Найти("ТаможенныеЦены")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ТаможенныеЦены",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		
		// ТАМОЖЕННЫЕ ЦЕНЫ
		
		"ВЫБРАТЬ
		|	&Период					Период,
		|	НоменклатураДляТаможни,
		|	МАКСИМУМ(ЦенаПоРиску),
		|	МАКСИМУМ(Пошлина),
		|	МАКСИМУМ(КоэффициентТаможенногоПлатежа)
		|ИЗ
		|	Документ.РасчетСебестоимости.Товары КАК Док
		|ГДЕ
		|	Док.Ссылка = &Ссылка И НоменклатураДляТаможни <> ЗНАЧЕНИЕ(Справочник.НоменклатураДляТаможни.ПустаяСсылка)
		|СГРУППИРОВАТЬ ПО 
		|	НоменклатураДляТаможни
		|"
		
	КонецЕсли;	
	
	
	Если ИменаРегистров.Найти("ПартииТоваров")<>Неопределено ИЛИ ПоВсем Тогда 
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ПартииТоваров",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		"Выбрать 
		|&Период					Период,
		|&ВидДвиженияПриход			ВидДвижения,
		|Ссылка.Инвойс 				Партия,
		|Ссылка.Инвойс.Дата 		ДатаПартии,
		|Ссылка.Инвойс.Контрагент 	Поставщик,
		|Номенклатура, 
		|0 Количество,
		|ТаможенныйПлатеж*Ссылка.КурсОплаты   Сумма,
		|Выбор Когда Ссылка.Инвойс=Значение(документ.Инвойс.ПустаяСсылка) Тогда Значение(Перечисление.ВидыОшибокПартионногоУчета.НеУказанИнвойс) Иначе Неопределено Конец ОписаниеОшибки
		|из документ.РасчетСебестоимости.Себестоимость
		|ГДЕ Ссылка=&Ссылка
		|"
	КонецЕсли;	
	
	Запрос=Новый Запрос;
	Запрос.Текст=ТекстЗапроса;
	
	Запрос.УстановитьПараметр("ВидДвиженияПриход", 	ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", Ссылка.Дата);
	Запрос.УстановитьПараметр("ВалютаДокумента", Ссылка.Валюта);
	Запрос.УстановитьПараметр("ТипЦенСебестоимость", Константы.Себестоимость.Получить());
	Запрос.УстановитьПараметр("ВалютаУУ", ОбщиеФункции.ПолучитьЗначениеКонстантыВОбласти("ВалютаУправленческогоУчета"));

	Пакет = Запрос.ВыполнитьПакет();
	
	Для Каждого Элем Из Нтаб Цикл
		ДополнительныеСвойства.Вставить(Элем.Ключ,Пакет[Элем.Значение].Выгрузить());
	КонецЦикла;	
		
КонецПроцедуры
