
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Касса = Параметры.Касса;
	Если ЗначениеЗаполнено(Касса) Тогда
		
		Для Каждого Элемент ИЗ Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
			
			Если	Элемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Касса") Тогда
					партнерИД = Элемент.ИдентификаторПользовательскойНастройки;
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Элемент Из Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
			Если ТипЗнч(Элемент) = Тип("ЭлементОтбораКомпоновкиДанных") И Элемент.ИдентификаторПользовательскойНастройки = партнерИД Тогда
				
				Элемент.ПравоеЗначение =  Касса;
				Элемент.Использование = Истина;
			Иначе
				Элемент.Использование = Ложь;
			КонецЕсли
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры
