&НаКлиенте                                                 
Процедура ПоказатьСкрытьИнформацию(Форма) Экспорт
		
	Форма.ИнфПартнераОтображать 				= Не Форма.ИнфПартнераОтображать;
	Форма.Элементы.ИнфПартнераКнопка.Пометка 	= Форма.ИнфПартнераОтображать;
	
	Если Форма.ИнфПартнераОтображать Тогда
		Слежение.Записать("Информация. О контрагенте открытие", "Справочник.Контрагенты");
	Иначе
		Слежение.Записать("Информация. О контрагенте закрытие", "Справочник.Контрагенты"); КонецЕсли;
	
	Форма.ОбработатьОтображениеИнфОПартнере();

КонецПроцедуры

Процедура ИнфТекстHTMLПриНажатии(Форма, Элемент, ДанныеСобытия, СтандартнаяОбработка, Список = "Список", Ссылка = Неопределено) Экспорт 
	
	Если HTMLОбработкаКлиент.ТекстHTMLПриНажатии(ДанныеСобытия, СтандартнаяОбработка) Тогда
			Форма[Элемент.Имя].Обновить(); КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если Ссылка = Неопределено Тогда
		ТекущиеДанные = ?(Список = "Список", Форма.Элементы[Список].ТекущаяСтрока, Форма.Элементы[Список].ТекущиеДанные);
		Если ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
	Ссылка = ?(Список = "Список", ТекущиеДанные, ТекущиеДанные.Контрагент); КонецЕсли;
	
	ОрганизацияСсылка = Неопределено;
	ЗаказСсылка = Неопределено;
	ID  = ДанныеСобытия.Element.id;
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ДокументСсылка.ПлатежноеПоручениеВходящее"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ПриходныйКассовыйОрдер"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ОплатаБанковскойКартой"));
	
	Если
		Лев(ID, 6) = "Credit" И ОперативнаяИнформация.ОрганизацияДляРасшифровки(Сред(ID, 7), ОрганизацияСсылка) Тогда		          

		ПараметрыФормы = Новый Структура("Отбор, КлючНазначенияИспользования, СформироватьПриОткрытии", Новый Структура("Контрагент, Организация", Ссылка, ОрганизацияСсылка), , Истина);
		ОткрытьФорму("Отчет.ВзаиморасчетыПоПартнеру.ФормаОбъекта", ПараметрыФормы, Форма);

 	ИначеЕсли Лев(ID, 5) = "Order" И ОперативнаяИнформация.ЗаказДляРасшифровки(Сред(ID, 6, 3), Сред(ID, 9), ЗаказСсылка) Тогда
		
		ПараметрыФормы = Новый Структура("Отбор, КлючНазначенияИспользования, СформироватьПриОткрытии", Новый Структура("Заказ, МассивТипов", ЗаказСсылка, МассивТипов), , Истина);
		ОткрытьФорму("Отчет.ВедомостьОдногоЗаказа.ФормаОбъекта", ПараметрыФормы, Форма);	
	ИначеЕсли ID = "КИ" Тогда
		
		ОткрытьФорму("Обработка.КонтактнаяИнформация.Форма.ФормаГлавная", Новый Структура("Контакт", Ссылка), Форма); 
	
	Иначе HTMLОбработкаКлиент.ТекстHTMLПриНажатии(ДанныеСобытия, СтандартнаяОбработка);
		
	// } silber
		
	КонецЕсли;	
КонецПроцедуры
