
Процедура СохранитьКартинку(текКартинка, Префикс, Отказ, Формат)
	
	Если текКартинка <> Неопределено Тогда
		
		Формат 		= КонвертацияТипов.РасширениеКартинки(текКартинка);
		
		ИмяФайла 	= КэшируемыеФункции.ПолучитьПутьКОблакуЛокально() + "\products\" + Формат(Владелец.ПорядковыйНомер, "ЧГ=") + "-" + Наименование + "-" + Префикс + "." + Формат;
			
		Попытка
			текКартинка.Записать(ИмяФайла);
		Исключение
			стрОшибки = ОписаниеОшибки();
			ОбщиеФункции.СообщитьТекст("Ошибка при записи картинки в облако
			|ИмяФайла = " + ИмяФайла + "
			|" + стрОшибки);
			Отказ = Истина; КонецПопытки; КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	// Проверим что нет одинаковых справочник с основным реквизитом
	//	представление должно быть одним
	//	поэтому если их несколько то заберем основное представление у другого
	
	Если Не ОбменДанными.Загрузка Тогда
	
		Если ЭтоПредставлениеОбъекта Тогда
		
			Запрос = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Справочник." + Метаданные().Имя + " ГДЕ Владелец = &Владелец И Ссылка <> &Ссылка И ЭтоПредставлениеОбъекта = ИСТИНА");
			Запрос.УстановитьПараметр("Ссылка", 	Ссылка);
			Запрос.УстановитьПараметр("Владелец",	Владелец);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				
				СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
				СправочникОбъект.ЭтоПредставлениеОбъекта = Ложь;
				
				Попытка
					СправочникОбъект.Записать();
				Исключение
					ОпОшибки = ОписаниеОшибки();
					ОбщиеФункции.СообщитьТекст("Ошибка при снятии основной картинки с объекта" + Выборка.Ссылка + "
					|" + ОпОшибки);
					Отказ = Истина;
				КонецПопытки;
				
			КонецЦикла;
		КонецЕсли;
		
		// Выгрузим на сайт
		
		//Если Не Отказ И ВыгружатьНаСайт И не HTTP.ДатьЗаданиеНаИзменениеСайту(Владелец, Перечисления.КомандыHTTP.PUT, "/api/products.json",,Ложь) Тогда Отказ = Истина КонецЕсли;
		
		#Если Не ВнешнееСоединение Тогда
		
			Если Не Отказ И (ВыгружатьНаСайт ИЛИ ДополнительныеСвойства.ТекОбъект.ВыгружатьНаСайт) Тогда 
				ПараметрыЗаписи = Неопределено;
				Если ВыгружатьНаСайт И НЕ ПометкаУдаления Тогда
					АдресРесурсаСервера	= ?(Владелец.ЭтоГруппа, "/api/product_categories", "/api/products");
					
					Если Владелец.ЭтоГруппа Тогда
						ОбновляемыеДанные = API2.ПолучитьКатегории(Новый Структура("Ссылка", Владелец)); //Новый Структура("image", Ссылка);
					Иначе // это элемент номенклатуры
						//лКартинки = Новый Массив;
						//лКартинки.Добавить(Новый Структура("image, position", Ссылка, ?(ЭтоПредставлениеОбъекта, 0, 1)));
						//ОбновляемыеДанные = Новый Структура("images", лКартинки);
						
						ОбновляемыеДанные = API2.ПолучитьТовары(Новый Структура("Ссылка, Области", Владелец, Новый Структура("Картинки")));
		 			КонецЕсли;
					
					ПараметрыЗаписи = Новый Структура("КомандаHTTP, АдресРесурсаСервера, Очередь, Суффикс, ТелоЗапроса", 
												Перечисления.КомандыHTTP.POST,
												АдресРесурсаСервера,
												40,
												"update",
												ОбновляемыеДанные);
				ИначеЕсли НЕ Владелец.ЭтоГруппа Тогда
					
					АдресРесурсаСервера	= "/api/products";
					
					ПараметрыЗаписи = Новый Структура("КомандаHTTP, АдресРесурсаСервера, Очередь, Суффикс, ТелоЗапроса", 
												Перечисления.КомандыHTTP.POST,
												АдресРесурсаСервера,
												40,
												"update",
												API2.ПолучитьТовары(Новый Структура("Ссылка, Области", Владелец, Новый Структура("Картинки")))); 
				КонецЕсли;
											
				Если НЕ ПараметрыЗаписи = Неопределено Тогда 
					API2.ЗаписатьОбъектВБуферНаИзменениеНаСайте(Владелец, ПараметрыЗаписи, Отказ); 
				КонецЕсли; 
			КонецЕсли; 
			
		#КонецЕсли
	КонецЕсли;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если Не ОбменДанными.Загрузка Тогда
	
		// Сохраним картинку в облаке
		Если Не Отказ И КопияКартинки.Пустая() Тогда
			
			СохранитьКартинку(Картинка.Получить(), 	"b", Отказ, РасширениеКартинка);
			//СохранитьКартинку(Аватар.Получить(), 	"s", Отказ, РасширениеАватар); 
		КонецЕсли;
		
		Если НЕ Отказ Тогда
			ДатаИзменения = ТекущаяДата();
			
			Если ЭтоНовый() Тогда
				ДополнительныеСвойства.Вставить("ТекОбъект", Новый Структура("ВыгружатьНаСайт, ПометкаУдаления, ЭтоПредставлениеОбъекта", Ложь, Ложь, Ложь));
			Иначе
				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ ПометкаУдаления, ЭтоПредставлениеОбъекта, ВыгружатьНаСайт ИЗ Справочник.КартинкиНоменклатуры КАК КартинкиНоменклатуры ГДЕ Ссылка = &Ссылка";
				Запрос.УстановитьПараметр("Ссылка", Ссылка);
				Выборка = Запрос.Выполнить().Выбрать();
			    Если Выборка.Следующий() Тогда
					ДополнительныеСвойства.Вставить("ТекОбъект", Новый Структура("ВыгружатьНаСайт, ПометкаУдаления, ЭтоПредставлениеОбъекта", Выборка.ВыгружатьНаСайт, Выборка.ПометкаУдаления, Выборка.ЭтоПредставлениеОбъекта)); КонецЕсли; КонецЕсли; КонецЕсли;КонецЕсли;
	
КонецПроцедуры

