
Функция Маскировать(Знач Стр) Экспорт
	
	Стр=СтрЗаменить(Стр,Символы.ПС,"\n");
	Стр=СтрЗаменить(Стр,Символы.ВК,"\r");
	Стр=СтрЗаменить(Стр,"""","\""");
	Стр=СтрЗаменить(Стр,"'","\'");
	Возврат Стр
	  
КонецФункции

Функция ОтправитьПочтовоеСообщениеПочтовомуКлиенту_Ст(ТекстПисьма, Вложения = Неопределено) Экспорт
	
	Почта = Новый Почта;
	Почта.Подключиться();
	
	Сообщение = Новый ПочтовоеСообщение;
	Сообщение.Текст = ТекстПисьма;
	
	Если Вложения <> Неопределено Тогда
		Сообщение.Вложения.Добавить(Вложения); КонецЕсли;
	
	Почта.Послать(ТекстПисьма);
	Почта.Отключиться();
	
КонецФункции

Функция ОтправитьПочтовоеСообщениеПочтовомуКлиенту(Параметры, ИспользоватьОблако = Ложь) Экспорт
	
	Возврат ?(ИспользоватьОблако,
					ОтправитьПочтовоеСообщениеПочтовомуКлиенту_ЧерезОблоко(Параметры),
					ОтправитьПочтовоеСообщениеПочтовомуКлиенту_ЧерезПочту(Параметры));
	
КонецФункции
Функция ОтправитьПочтовоеСообщениеПочтовомуКлиенту_ЧерезОблоко(Параметры) Экспорт
	
	Кому 		= ?(Параметры.Свойство("Кому"), 	Параметры.Кому, "");
	Копия 		= ?(Параметры.Свойство("Копия"), 	Параметры.Копия, "");
	Тема 		= ?(Параметры.Свойство("Тема"), 	Параметры.Тема, "");
	Текст 		= ?(Параметры.Свойство("Текст"), 	Параметры.Текст, "");
	Подпись		= ?(Параметры.Свойство("Подпись"), 	Параметры.Подпись, "");
	
	// Запишем вложения в облоко и дадим ссылки на него
	
	ТекстВложений = "";
	Если Параметры.Свойство("Вложения") Тогда
		
		ТекстВложений 	= Символы.ПС + ?(Параметры.Вложения.Количество() = 1, "Файл:","Прикрепленные файлы:");
		ТекстФайлов 	= "";
		Для Каждого Вложение Из Параметры.Вложения Цикл ТекстФайлов = ТекстФайлов + Символы.ПС + Вложение.ТекстHTML КонецЦикла; 
		ТекстВложений = ТекстВложений + ТекстФайлов; КонецЕсли;
	
	Текст = "mailto:" + Кому + "?subject=" + Тема + "&body=" + Маскировать(Текст + ТекстВложений + Подпись);
	ЗапуститьПриложение(Текст);
	
КонецФункции
Функция ОтправитьПочтовоеСообщениеПочтовомуКлиенту_ЧерезПочту(Параметры) Экспорт
	
	Кому 		= ?(Параметры.Свойство("Кому"), 	Параметры.Кому, 	"");
	Копия 		= ?(Параметры.Свойство("Копия"), 	Параметры.Копия, 	"");
	Тема 		= ?(Параметры.Свойство("Тема"), 	Параметры.Тема, 	"");
	Текст 		= ?(Параметры.Свойство("Текст"), 	Параметры.Текст, 	"");
	Подпись		= ?(Параметры.Свойство("Подпись"), 	Параметры.Подпись, 	"");
	
	// Запишем вложения в облоко и дадим ссылки на него
	
	ТекстВложений = "";
	Если Параметры.Свойство("Вложения") Тогда
		
		ТекстВложений 	= Символы.ПС + ?(Параметры.Вложения.Количество() = 1, "Файл:","Прикрепленные файлы:");
		ТекстФайлов 	= "";
		Для Каждого Вложение Из Параметры.Вложения Цикл ТекстФайлов = ТекстФайлов + Символы.ПС + Вложение.ТекстHTML КонецЦикла; 
		ТекстВложений = ТекстВложений + ТекстФайлов; КонецЕсли;
	
	Текст = "mailto:" + Кому + "?subject=" + Тема + "&body=" + Маскировать(Текст + ТекстВложений + Подпись);
	ЗапуститьПриложение(Текст);
	
КонецФункции

Функция ПроверитьИнтернетПрофиль(ИнтернетПрофиль) Экспорт
	
	Соединение = Новый ИнтернетПочта;
	
	Попытка
		Соединение.Подключиться(ИнтернетПрофиль);
	Исключение
		стрОшибки = ОписаниеОшибки();
		ОбщиеФункции.СообщитьТекст("Ошибка подключения к почтовому серверу
											|" + стрОшибки);
		Возврат Ложь; КонецПопытки;
	
	Соединение.Отключиться();

	Возврат Истина;
	
КонецФункции

Функция ПолучитьИнтернетПрофильПочты(Форма, ДопПараметры = Неопределено)
	
	// Форма 		- откуда вызывается отправка письма
	// ДопПараметры - если в профиль нужно внести какието дополнения 
	//	или переписать существующие параметры интрнет профиля, например пароля
	
	// Получим параметры
	
	Параметры = Почта2Сервер.ПолучитьНастройкиПрофиляПочты();
	
	Если ДопПараметры <> Неопределено Тогда
		КонвертацияТипов.ДобавитьВСтруктуруСтруктуру(Параметры, ДопПараметры) КонецЕсли;
	
	Если Параметры = Неопределено Тогда
		ОбщиеФункции.СообщитьТекст("Ошибка получения настроек соединения с почтовым сервером, необходимо настроить почту и перегрузить программу.");
		Возврат Неопределено; КонецЕсли;
	
	// Создадим профиль
	
	Профиль = Новый ИнтернетПочтовыйПрофиль;
	ЗаполнитьЗначенияСвойств(Профиль, Параметры);
	
	// Введем пароль если он не введен
	
	Если ПустаяСтрока(Параметры.Пароль) Тогда
		ОткрытьФорму("Документ.Письмо.Форма.ВводПароля", Новый Структура(), Форма) КонецЕсли;
	
	// Вернем
	
	Возврат Профиль;
	
КонецФункции

#Область Пароли

Функция ПолучитьПарольИзКеша(ПрофильСсылка, глПаролиНаПочту) Экспорт
	
	Пароль = глПаролиНаПочту[ПрофильСсылка];
	Возврат ?(Пароль = Неопределено, "", Пароль);
	
КонецФункции
Процедура УстановитьПарольВКеше(ПрофильСсылка, Пароль, глПаролиНаПочту) Экспорт
	
	глПаролиНаПочту.Вставить(ПрофильСсылка, Пароль);
	
КонецПроцедуры
Процедура СброситьПарольВКеше(ПрофильСсылка, глПаролиНаПочту) Экспорт
	
	глПаролиНаПочту.Вставить(ПрофильСсылка, Неопределено);
	
КонецПроцедуры

#КонецОбласти