
&НаСервере
Функция ПолучитьПараметрыДляТабличногоДокумента(Ссылки, СтрНомер)
	
	Возврат Заказы.ПолучитьПараметрыДляТабличногоДокумента(Ссылки, СтрНомер);
	
КонецФункции
/////есть подозрение что сия хрень бездействует
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПолеСортировки = ОткрытьФорму("Документ.ЗаказПокупателя.Форма.ФормаВыбораСортировки",,ПараметрыВыполненияКоманды.Источник,,,,Новый ОписаниеОповещения("ОбработкаОбработкиКоманды",ЭтотОбъект,Новый Структура("ПараметрКоманды, ПараметрыВыполненияКоманды", ПараметрКоманды, ПараметрыВыполненияКоманды)),);	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОбработкиКоманды(Результат, Параметры) Экспорт
		
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТабДок = Новый ТабличныйДокумент;
	Печать(ТабДок, Параметры.ПараметрКоманды, Результат);

	ФункцииФормДокументов.УстановитьНастройкиТабличногоДокумента(ТабДок);
	
	ТабДок.ДвусторонняяПечать = ТипДвустороннейПечати.ПереворотВлево;

	СтрНомера = "";
	ДополнительныеПараметры = ПолучитьПараметрыДляТабличногоДокумента(Параметры.ПараметрКоманды, СтрНомера);
	ОткрытьФорму("ОбщаяФорма.ТабличныйДокумент", Новый Структура("ТабличныйДокумент, ИмяФайла, ДополнительныеПараметры", ТабДок, СтрНомера, ДополнительныеПараметры),Параметры.ПараметрыВыполненияКоманды.Источник, Параметры.ПараметрыВыполненияКоманды.Уникальность, Параметры.ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
////////Конец хрени///////////
&НаСервере
Процедура Печать(ТабДок, ПараметрКоманды, ПолеСортировки)
	
	Инд = -1;
	Для Каждого Ссылка Из ПараметрКоманды Цикл Инд = Инд + 1;
		
		Если Инд Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		Если ТипЗнч(Ссылка) = Тип("БизнесПроцессСсылка.ЗаявкаПокупателя") Тогда
			Документы.ЗаказПокупателя.Печать_СчетЗаказ(ТабДок, Ссылка.Заказ, "Счет",,,ПолеСортировки);
		ИначеЕсли
			ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			Документы.ЗаказПокупателя.Печать_СчетЗаказ(ТабДок, Ссылка, "Счет",,,ПолеСортировки);
		ИначеЕсли
			ТипЗнч(Ссылка) = Тип("ДокументСсылка.ИнтернетЗаказПокупателя") Тогда
			Документы.ЗаказПокупателя.Печать_СчетЗаказ(ТабДок, Ссылка, "Счет",,,ПолеСортировки,,"ИнтернетЗаказПокупателя");
		ИначеЕсли
			ТипЗнч(Ссылка) = Тип("БизнесПроцессСсылка.ИнтернетЗаявка") Тогда
			Документы.ЗаказПокупателя.Печать_СчетЗаказ(ТабДок, Ссылка.Заказ, "Счет",,,ПолеСортировки,,"ИнтернетЗаказПокупателя");
        КонецЕсли;


	КонецЦикла;
		
КонецПроцедуры