
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Справочник.КартинкиРемонта.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
	Список = Новый СписокЗначений;
	Список.ЗагрузитьЗначения(ПараметрКоманды);
	
	ОткрытьФорму(
		"Справочник.КартинкиРемонта.Форма.СписокКартинокПоВладельцу", 
		Новый Структура("РемонтыСписок", Список));
	
КонецПроцедуры
