
&НаСервере
Функция ПустойПользователь()
	
	Возврат Справочники.Пользователи.ПустаяСсылка();
	
КонецФункции
&НаКлиенте
Процедура КладовщикиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		
		Элементы.Кладовщики.ТекущиеДанные.Сборщик = ПустойПользователь();
		
		//ТипПольз = Новый ОписаниеТипов("СправочникСсылка.Пользователи");
		//Типы = Новый Массив; Типы.Добавить(ТипПольз);
		//Типы.Добавить(Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
		//
		//ЭлКладовщик = Элементы.КладовщикиКладовщик;
		//ЭлКладовщик.ОграничениеТипа = ТипПольз;
		//ЭлКладовщик.ОграничениеТипа.ПривестиЗначение();
		//ЭлКладовщик.ОграничениеТипа = Новый ОписаниеТипов(Типы); 
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеРеквизиты(Команда)
	
	ФункцииФормДокументов.ОткрытьОбщиеРеквизиты(ЭтаФорма);
	
КонецПроцедуры
