
&НаКлиенте
Процедура ОбновитьСостояние()
	
	Элементы.Ок.Доступность = Ложь;
	
	Если ПустаяСтрока(Пароль1) Тогда
		
		СтрокаСостояния = "Придумайте пароль";
		
	ИначеЕсли Не ПустаяСтрока(Пароль1) И ПустаяСтрока(Пароль2) Тогда
		
		СтрокаСостояния = "Наберите пароль еще раз";
		
	ИначеЕсли Пароль1 <> Пароль2 Тогда
		
		СтрокаСостояния = "Пароли не совпадают";
		
	ИначеЕсли СтрДлина(Пароль1) < 6 Тогда
		
		СтрокаСостояния = "Короткий пароль";
		
	Иначе
		
		Кол = СтрДлина(Пароль1);
		
		// Проверим цифры
		
		Цифры = "01234567890"; ТолькоЦифры = Истина; ТолькоБуквы = Истина;
		Для Ном = 1 По Кол Цикл Если Найти(Цифры, Сред(Пароль1, Ном, 1)) Тогда ТолькоБуквы = Ложь; Иначе ТолькоЦифры = Ложь; КонецЕсли; КонецЦикла;
		
		Если ТолькоЦифры ИЛИ ТолькоБуквы Тогда СтрокаСостояния = "пароль должен содержать буквы и цифры"; Возврат; КонецЕсли;
		
		// Проверим на 3-х повтор
		
		Ст1 = ""; Ст2 = "";
		Для Ном = 1 По Кол Цикл Ст = Сред(Пароль1, Ном, 1);
			
			Если Ст = Ст1 И Ст1 = Ст2 Тогда 
				СтрокаСостояния = "Плохой пароль";
				Возврат; КонецЕсли; 
			
			Ст2 = Ст1; Ст1 = Ст; КонецЦикла;
		
		СтрокаСостояния 		= ""; 
		Элементы.Ок.Доступность = Истина; КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Пароль1ПриИзменении(Элемент)
	
	ОбновитьСостояние();
	
КонецПроцедуры

&НаКлиенте
Процедура Пароль2ПриИзменении(Элемент)
	
	ОбновитьСостояние();
	
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	
	Закрыть(Пароль1);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.Декорация1.Видимость = Параметры.ПоказатьНадпись1;
	
КонецПроцедуры
