&НаСервере
Процедура СформироватьНаСервере()
	
	Макет = Отчеты.ДвиженияПоТаможенномуСкладу.ПолучитьМакет("ФормаТаможни");
	
	ОбластьШапка 		= Макет.ПолучитьОбласть("Шапка");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрока 		= Макет.ПолучитьОбласть("Строка");
	
	Таблица.Очистить();
	Таблица.Вывести(ОбластьШапка);
	Таблица.Вывести(ОбластьШапкаТаблицы);
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Партия,
	|	Валюта,
	|	Партия.Номер 			НомерПоступления,
	|	Партия.НомерТаможни 	НомерПоступленияТаможни,
	|	Партия.Инвойс.Дата 		ДатаИнвойса,
	|	Партия.Инвойс.Номер 	НомерИнвойса,
	|	Партия.Инвойс.Контрагент 	Поставщик,
	|	ВЫБОР КОГДА Регистратор ССЫЛКА Документ.СписаниеСТаможенногоСклада ТОГДА Регистратор ИНАЧЕ NULL КОНЕЦ ДокументРасхода,
	|	Номенклатура,
	|	МАКСИМУМ(КоличествоКонечныйОстаток) 	Остаток,
	|	СУММА(КоличествоПриход)					КоличествоПриход,
	|	СУММА(КоличествоРасход)					КоличествоРасход,
	|	СУММА(СуммаПриход)						СуммаПриход
	|ИЗ 
	|	РегистрНакопления.ТоварыНаТаможне.ОстаткиИОбороты(,,Регистратор,,Склад = &Склад)
	|
	|СГРУППИРОВАТЬ ПО
	|	Партия, Номенклатура, Регистратор, Валюта
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номенклатура, Партия.Дата
	|");
	
	Запрос.УстановитьПараметр("Склад", Склад);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() ЦИкл
		
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		Таблица.Вывести(ОбластьСтрока); КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	
	СформироватьНаСервере();
	
КонецПроцедуры
