
Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос(
	
	// ПАРАМЕТРЫ СИСТЕМЫ
	
	КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() + "
	|;
	
	// ШАПКА
	
	|ВЫБРАТЬ
	|	Заказ, Склад
	|ИЗ
	|	Документ.ЗаказНаРазборку
	|ГДЕ
	|	Ссылка = &Ссылка
	|;
	
	
	//Заказы на разборку
	
	|ВЫБРАТЬ
	|	&Период				КАК Период,
	|	&ВидДвиженияПриход	КАК ВидДвижения,
	|	СборочныйЛист 		КАК СборочныйЛист,
	|	Ссылка.Склад		КАК Склад,
	|	Ссылка.Заказ		КАК Заказ,
	|	Номенклатура	    КАК Номенклатура,
	|	Количество			Количество
	|ИЗ
	|	Документ.ЗаказНаРазборку.Товары
	|
	|ГДЕ
	|	Ссылка = &Ссылка И Количество <> 0 
	|
	|;
	
	|");
	
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("Период", 			Ссылка.Дата);
	Запрос.УстановитьПараметр("ВидДвиженияПриход", 	ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("ВидДвиженияРасход", 	ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("ПустаяЯчейка", 		Справочники.Ячейки.ПустаяСсылка());
	Запрос.УстановитьПараметр("ЯчейкаНеНайдено", 	Ссылка.Склад.ЯчейкаНеНайдено);
	Запрос.УстановитьПараметр("ПустаяУпаковка", 	Справочники.УпаковкиНоменклатуры.ПустаяСсылка());
	Запрос.УстановитьПараметр("ЗаказПотеряшек", 	Константы.ЗаказРезервПотеряшек.Получить());
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ДополнительныеСвойства.Вставить("ПараметрыСистемы", 		КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[0].Выгрузить()));
	ДополнительныеСвойства.Вставить("Шапка", 					КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[1].Выгрузить()));
	ДополнительныеСвойства.Вставить("ЗаказыНаРазборку", 				Пакет[2].Выгрузить());
	
КонецПроцедуры

