
&НаСервере
Функция ПолучитьСтрТаблицу()
	
	Возврат ЗначениеВСтрокуВнутр(Получатели.Выгрузить());	
	
КонецФункции

&НаКлиенте
Процедура Команда1(Команда)
	
	Закрыть(ПолучитьСтрТаблицу());
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Получатели.Загрузить(ЗначениеИзСтрокиВнутр(Параметры.стрТаблица));
	знКонтрагент = Параметры.знКонтрагент;
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("знКонтрагент", знКонтрагент);
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриемЗначения",ЭтаФорма);	
	ОткрытьФорму("ОбщаяФорма.ВыборЭлектроннойПочты", ПараметрыФормы,,,,,ОписаниеОповещения,);//,ПараметрыФормы);
	
КонецПроцедуры	
	&НаКлиенте
Процедура ПриемЗначения(Результат,Параметры) Экспорт
		
Если Не Результат = Неопределено Тогда
	Прием = Результат;	
	НоваяСтрокаПолучатели = Получатели.Добавить();
	НоваяСтрокаПолучатели.Контрагент = знКонтрагент;
	НоваяСтрокаПолучатели.Кому = Прием.Кому;
КонецЕсли;	

КонецПроцедуры


