
&НаСервере
Функция ПолучитьПараметрыДляТабличногоДокумента(Ссылки, СтрНомер)
	
	Возврат Заказы.ПолучитьПараметрыДляТабличногоДокумента(Ссылки, СтрНомер);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДок = Новый ТабличныйДокумент;
	Печать(ТабДок, ПараметрКоманды);

	ФункцииФормДокументов.УстановитьНастройкиТабличногоДокумента(ТабДок);
	
	ТабДок.ДвусторонняяПечать = ТипДвустороннейПечати.ПереворотВлево;
	//ТабДок.АвтоМасштаб = Истина;
	
	СтрНомера = "";
	ДополнительныеПараметры = ПолучитьПараметрыДляТабличногоДокумента(ПараметрКоманды, СтрНомера);
	ОткрытьФорму("ОбщаяФорма.ТабличныйДокумент", Новый Структура("ТабличныйДокумент, ИмяФайла, ДополнительныеПараметры", ТабДок, СтрНомера, ДополнительныеПараметры),ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

&НаСервере
Процедура Печать(ТабДок, ПараметрКоманды)
	
	ПараметрПечати = Новый Структура("ИмяМакета, СкидкаВТаблице, СтрокаУсловиеПоставки, ОриентацияСтраницы", 
									"КоммерческоеПром", Истина, Истина, ОриентацияСтраницы.Ландшафт);
	
	ПараметрПечати.Вставить("_1ЛистТолькоКогдаДо", 	3);
	ПараметрПечати.Вставить("НаПервомНеБолее", 		5);
	ПараметрПечати.Вставить("НаВторомНеБолее", 		6);
	ПараметрПечати.Вставить("ВКонцеНеБолее",		3);
	
	Инд = -1;
	Для Каждого Ссылка Из ПараметрКоманды Цикл Инд = Инд + 1; Если Инд Тогда ТабДок.ВывестиГоризонтальныйРазделительСтраниц(); КонецЕсли;
		
		Если ТипЗнч(Ссылка) = Тип("БизнесПроцессСсылка.ЗаявкаПокупателя") или ТипЗнч(Ссылка) = Тип("БизнесПроцессСсылка.ИнтернетЗаявка") Тогда
			
			ПечатьНаСервере.ЗаполнитьТабличныйДокумент_КомерческоеПредложение(
				ТабДок, 
				ПечатьНаСервере.ПолучитьДанныеДляЗаказаВЗаказе(Ссылка.Заказ), ПараметрПечати); 
			
		ИначеЕсли
			ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказПокупателя") или ТипЗнч(Ссылка) = Тип("ДокументСсылка.ИнтернетЗаказПокупателя") Тогда

			ПечатьНаСервере.ЗаполнитьТабличныйДокумент_КомерческоеПредложение(
				ТабДок, 
				ПечатьНаСервере.ПолучитьДанныеДляЗаказаВЗаказе(Ссылка), ПараметрПечати); 
				
		ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.КоммерческоеПредложение") Тогда
			
			ПечатьНаСервере.ЗаполнитьТабличныйДокумент_КомерческоеПредложение(
				ТабДок, 
				ПечатьНаСервере.ПолучитьДанныеДляЗаказаВКоммПредложении(Ссылка), ПараметрПечати);	 Конецесли; КонецЦикла;
			
КонецПроцедуры