
&НаКлиенте
Процедура ПриОткрытии(Отказ)

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗадачиПроцесса.Параметры.УстановитьЗначениеПараметра("Ссылка", 		Объект.Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура ЗадачиПроцессаОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Если ТипЗнч(НовыйОбъект) = Тип("ДокументСсылка.Инвойс") Тогда
		Объект.Инвойс = НовыйОбъект;
	ИначеЕсли
		ТипЗнч(НовыйОбъект) = Тип("ДокументСсылка.РасчетСебестоимости") Тогда
		Объект.РасчетСебестоимости = НовыйОбъект;
	ИначеЕсли
		ТипЗнч(НовыйОбъект) = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
		Объект.ПоступлениеТоваров = НовыйОбъект;
	КонецЕсли;

	Записать();
	
КонецПроцедуры

&НаСервере
Функция ВыполнитьТекущуюЗадачу()
	
	Задача = ФункцииБизнесПроцессов.ТекущаяЗадача(Объект.Ссылка);
	ЗадачаОбъект = Задача.ПолучитьОбъект();
	ЗадачаОбъект.ВыполнитьЗадачу();
	
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ИнвойсЗаписан" ИЛИ ИмяСобытия = "РасчетСебестоимостиЗаписан" ИЛИ ИмяСобытия = "ПоступлениеТоваровЗаписан" Тогда
		Если Параметр Тогда
			ВыполнитьТекущуюЗадачу();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

