
Процедура ПередЗаписью(Отказ)
	
	// Заполним даты и ответвенных
	
	текДата = ТекущаяДата();
	Для Каждого Строка Из Товары Цикл Если Строка.Ответственный.Пустая() Тогда Строка.Ответственный = ПараметрыСеанса.ТекущийПользователь; КонецЕсли; Если Строка.ДатаДобавления = '00010101' Тогда Строка.ДатаДобавления = текДата; КонецЕсли; КонецЦикла;
	
	// Проверим чтобы товары были уникальны
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	НовинкиТовары.Ссылка,
	                      |	НовинкиТовары.Номенклатура,
	                      |	НовинкиТовары.Номенклатура.Артикул КАК Артикул
	                      |ИЗ
	                      |	Справочник.Новинки.Товары КАК НовинкиТовары
	                      |ГДЕ
	                      |	НовинкиТовары.Ссылка <> &Ссылка
	                      |	И НовинкиТовары.Номенклатура В(&Товары)
	                      |	И НовинкиТовары.Ссылка.ПометкаУдаления = ЛОЖЬ");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Товары", Товары.ВыгрузитьКолонку("Номенклатура"));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Отказ = Истина;
		ОбщиеФункции.СообщитьТекст(Выборка.Артикул + " " + Строка(Выборка.Номенклатура) + " - такой товар уже есть в новинке " + Строка(Выборка.Ссылка), "Товары[" + Формат(Товары.Найти(Выборка.Номенклатура, "Номенклатура").НомерСтроки - 1, "ЧГ=") + "]", ЭтотОбъект); КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	КодПолученияМассиваОбъектов = "
	|массивОбъектов = пОбъект;
	|";
	ПараметрыФункции = "(Новый Структура(""массивСсылок, Области"", массивОбъектов, Новый Структура(""Поля"")))";
	
	Если 	Товары.Количество() И
			Константы.ИнтеграцияССайтом.Получить() И
			Не API2.ЗаписатьНаборВБуферОбновленияНаСайте(Товары.ВыгрузитьКолонку("Номенклатура"), 
				Новый Структура("Поле, АдресРесурсаСервера, Очередь, ФункцияПолученияОбъекта, КодПолученияМассиваОбъектов, ПараметрыФункцииПолученияОбъекта", 
				"", "/api/products", 25, "ПолучитьТовары", КодПолученияМассиваОбъектов, ПараметрыФункции)) Тогда
			
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
