
&НаСервере
Функция ПолучитьТекстJSON(Ссылка, стрОшибки)
	
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Номенклатура") Тогда
		
		Рез = ?(Ссылка.ЭтоГруппа,
				API2.ПолучитьКатегории(Новый Структура("Ссылка", Ссылка), стрОшибки),
				API2.ПолучитьТовары(Новый Структура("Ссылка", Ссылка), стрОшибки));
				
		Возврат ?(Рез = Неопределено, стрОшибки, w1_Json.JSON(Рез, Истина));
				
	Иначе
		
		Ошибка = "Нет обработчика JSON для типа " + ТипЗнч(Ссылка);
		Возврат ""; КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	стрОшибки = "";
	Текст = Новый ТекстовыйДокумент;
	Текст.УстановитьТекст(ПолучитьТекстJSON(ПараметрКоманды, стрОшибки));
	Текст.Показать(ПараметрКоманды);
	
КонецПроцедуры
