&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
	ЗначенияВозврата = ВыбратьФайл();
	Если Не ЗначениеЗаполнено(ЗначенияВозврата) Тогда
		Возврат;
	КонецЕсли;
	Состояние("Подождите, идет загрузка файла...",,,);
	НачатьПомещениеФайла(Новый ОписаниеОповещения("ОбработкаПослеПомещенияФайла", ЭтаФорма, Новый Структура), ,ЗначенияВозврата.ПолноеИмяФайла, Ложь, УникальныйИдентификатор);
	Объект.Наименование = ЗначенияВозврата.ИмяФайла;
	ПоместитьФайлВХранилищеЗначений(АдресВременногоХранилища);
	Объект.ПолноеИмяФайла = ЗначенияВозврата.ИмяФайла;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаПослеПомещенияФайла(Результат, Адрес, ВыбранныеФайлы, Параметры) Экспорт
	 АдресВременногоХранилища = Адрес;	
КонецПроцедуры

&НаКлиенте
Функция ВыбратьФайл()
	ДиалогФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогФайла.МножественныйВыбор = Ложь;
	Если ДиалогФайла.Выбрать() Тогда
		ПолноеИмяФайла = ДиалогФайла.ПолноеИмяФайла;
		Файл = Новый Файл(ДиалогФайла.ПолноеИмяФайла);
		СтруктураВозврата = Новый Структура("ПолноеИмяФайла, ИмяФайла", ПолноеИмяФайла, Файл.Имя);
		Возврат СтруктураВозврата;
	Иначе
		ПустаяСтруктура = Новый Структура;
		Возврат ПустаяСтруктура;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура ПоместитьФайлВХранилищеЗначений(Адрес)
	Темп = ПолучитьИзВременногоХранилища(Адрес); // это уже двоичные данные
	//ДВ = Новый ДвоичныеДанные("123123123");
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ТекущийОбъект.ХранилищеБинарныхДанных = Новый ХранилищеЗначения(Темп);
	//ХранилищеБинарныхДанных = Новый ХранилищеЗначения(Темп);
	ТекущийОбъект.Записать();
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
	//Записать(); 		
КонецПроцедуры

///////////////////Выгрузить файл/////////////////////////////////////////////////////////////
&НаКлиенте
Процедура ВыгрузитьФайл(Команда)
	ДиалогФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогФайла.МножественныйВыбор = Ложь;
	Если ДиалогФайла.Выбрать() Тогда
		КаталогФайла = ДиалогФайла.Каталог;
		ПолучитьФайлИзХранилищаЗначений(КаталогФайла);
		Если АдресВременногоХранилища = "" Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "В хранилище нет файла!";
			Сообщение.Сообщить();
		КонецЕсли;
		Состояние("Подождите, идет выгрузка файла...",,,);
		тмп = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
		тмп.Записать(КаталогФайла+"\"+Объект.Наименование);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПолучитьФайлИзХранилищаЗначений(Каталог);
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	Темп = ТекущийОбъект.ХранилищеБинарныхДанных.Получить();
	Если Темп = Неопределено Тогда		
		АдресВременногоХранилища = "";
		Возврат;
	КонецЕсли;
	АдресВременногоХранилища = ПоместитьВоВременноеХранилище(Темп, УникальныйИдентификатор);
КонецПроцедуры	

&НаКлиенте
Процедура УдалитьФайл(Команда)
	УдалитьФайлНаСервере();
КонецПроцедуры

&НаСервере
Процедура УдалитьФайлНаСервере()
	ТекущийОбъект = РеквизитФормыВЗначение("Объект");
	ТекущийОбъект.ХранилищеБинарныхДанных = Неопределено;
	ТекущийОбъект.Наименование = "";
	ЗначениеВРеквизитФормы(ТекущийОбъект, "Объект");
Конецпроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	УдалитьИзВременногоХранилища(АдресВременногоХранилища);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьАватар();
КонецПроцедуры

&НаСервере
Процедура ОбновитьАватар()
  	ОбъектЭлемента = РеквизитФормыВЗначение("Объект");	
	
	АдресВременногоХранилища = ПоместитьВоВременноеХранилище(ОбъектЭлемента.ХранилищеБинарныхДанных.Получить(),  УникальныйИдентификатор);
	КонецПроцедуры
