
&НаКлиенте
Процедура УправлениеВидимостьюДоступностью()
	
	Если Объект.ЭтоКаталог Тогда		Вид = 0; Заголовок = "Папка";
	ИначеЕсли Объект.ЭтоФайл Тогда		Вид = 1; Заголовок = "Файл";
	Иначе								Вид = 2; Заголовок = "Текст"; КонецЕсли;
	
	Элементы.СтраницаПапка.Видимость = 	Вид = 0;
	Элементы.СтраницаФайл.Видимость = 	Вид = 1;
	Элементы.СтраницаБлок.Видимость = 	Вид = 2;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ЗаписанаСтраница", Объект.Ссылка, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидПриИзменении(Элемент)
	
	Если Вид = 0 Тогда
		Объект.ЭтоКаталог 	= Истина;
		Объект.ЭтоФайл 		= Ложь;
	ИначеЕсли Вид = 1 Тогда
		Объект.ЭтоКаталог 	= Ложь;
		Объект.ЭтоФайл 		= Истина;
	Иначе
		Объект.ЭтоКаталог 	= Ложь;
		Объект.ЭтоФайл 		= Ложь; КонецЕсли;
	
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры
