Процедура   ОтправитьВЧатGaragetools(Сообщение)  Экспорт
	
    Сервер = "api.telegram.org"; 
	Порт   = 443;
			
	СтруктураДанных 	= Новый Структура;
		
	СтруктураДанных.Вставить("chat_id", "112042752"); 
	СтруктураДанных.Вставить("text",Сообщение); 
				
   	ЗапросHTTP = Новый HTTPЗапрос("bot160554578:AAEZy0fxs3xxWlhSviqM_QeJVxHy8sEI1qk/sendMessage"+"?"+"chat_id=" + СтруктураДанных.chat_id +"&text=" +СтруктураДанных.text);
	//ЗапросHTTP.УстановитьТелоИзСтроки("chat_id=" + СтруктураДанных.chat_id +"&reply_to_message_id="+"160554578"+ "&text=" +СтруктураДанных.text);
	
	Соединение 	= Новый HTTPСоединение(Сервер, Порт,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	
	Ответ = Соединение.ОтправитьДляОбработки(ЗапросHTTP);	
		
КонецПроцедуры