
&НаСервере
Процедура ОбновитьКартинкиНаСервере(ТекКартинка)
	
	КартинкаМаленькая 	= Картинки.ПолучитьНавигационнуюСсылкуКартинки(ТекКартинка, Истина);
	КартинкаБольшая 	= Картинки.ПолучитьНавигационнуюСсылкуКартинки(ТекКартинка, Ложь);
	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьКартинки()
	
	ТекКартинка = Элементы.СписокКартинок.ТекущаяСтрока;
	Если текКартинка = Неопределено Тогда 
		
		КартинкаМаленькая 	= "";
		КартинкаБольшая 	= "";
	
	Иначе ОбновитьКартинкиНаСервере(ТекКартинка) КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Владелец") Тогда
		Элементы.СписокНоменклатуры.ТекущаяСтрока = Параметры.Отбор.Владелец; КонецЕсли;
	
КонецПроцедуры

#Область Интерактивные // действия

&НаСервере
Функция ПолучитьПервуюКарттинкуТовара(текТовар)
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Справочник.КартинкиНоменклатуры ГДЕ Владелец = &Владелец");
	Запрос.УстановитьПараметр("Владелец", текТовар);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда Возврат Выборка.Ссылка КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СписокНоменклатурыПриАктивизацииСтроки(Элемент)
	
	ОтборыСписковКлиентСервер.ИзменитьЭлементОтбораСписка(СписокКартинок, "Владелец", Элемент.ТекущаяСтрока, Истина);
	Элементы.СписокКартинок.ТекущаяСтрока = ПолучитьПервуюКарттинкуТовара(Элемент.ТекущаяСтрока);
	
	ОбновитьКартинки();
	
КонецПроцедуры
&НаКлиенте
Процедура СписокКартинокПриАктивизацииСтроки(Элемент)
	
	ОбновитьКартинки();
	
КонецПроцедуры

#КонецОбласти

#Область Обработка // и запись картинок

&НаСервере
Функция ЗаписатьНовыйСправочник(Имя, Владелец, УжеЕстьНовСправочник = Неопределено)
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Справочник.КартинкиНоменклатуры ГДЕ Владелец = &Владелец И ЭтоПредставлениеОбъекта");
	Запрос.УстановитьПараметр("Владелец", Владелец);
	
	НовСпрКартинка = ?(УжеЕстьНовСправочник = Неопределено, Справочники.КартинкиНоменклатуры.СоздатьЭлемент(), УжеЕстьНовСправочник);
	НовСпрКартинка.Владелец 				= Владелец;
	НовСпрКартинка.Наименование 			= Имя;
	НовСпрКартинка.ВыгружатьНаСайт 			= Истина;
	НовСпрКартинка.ЭтоПредставлениеОбъекта 	= Запрос.Выполнить().Пустой();
	
	Если ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(НовСпрКартинка) Тогда
		Возврат НовСпрКартинка.Ссылка КонецЕсли;
	
КонецФункции
&НаКлиенте
Процедура ЗагрузитьКартинку(ЭтоАватар, СтандартнаяОбработка = Ложь, ЭтоНоваяКартинка = Ложь)
	
	СтандартнаяОбработка = Ложь;
	
	// Проверим
	
	ТекНоменклатура = Элементы.СписокНоменклатуры.ТекущаяСтрока;
	Если ТекНоменклатура = Неопределено Тогда
		ПоказатьПредупреждение(,"Не выбран товар",,"Предупреждение"); Возврат; КонецЕсли;
	
	ТекКартинка = ?(ЭтоНоваяКартинка, Неопределено, Элементы.СписокКартинок.ТекущаяСтрока);
	
	// Выберем картинку
	
	ДВ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	Если ДВ.Выбрать() Тогда
		
		стрОшибки 	= "";
		ИмяФайла 	= Сред(ДВ.ПолноеИмяФайла, СтрДлина(ДВ.Каталог) + 1);
		
		// Создадим новую картинку
	
		Если ТекКартинка = Неопределено Тогда ТекКартинка = ЗаписатьНовыйСправочник(Прав(ДВ.ПолноеИмяФайла, СтрДлина(ДВ.ПолноеИмяФайла) - СтрДлина(ДВ.Каталог)), ТекНоменклатура);
			
			Если ТекКартинка = Неопределено Тогда
				Возврат КонецЕсли; КонецЕсли;
		
			//Элементы.СписокКартинок.ТекущаяСтрока = ТекКартинка;
			
		
		// Обновим
		
		Если Картинки.Обновить(Новый Картинка(ДВ.ПолноеИмяФайла), ТекКартинка, ЭтоАватар) Тогда
			
			Элементы.СписокНоменклатуры.Обновить();
			Элементы.СписокКартинок.Обновить();
			
			Элементы.СписокКартинок.ТекущаяСтрока = ТекКартинка;
			
			ОбновитьКартинки();
			
			//ПодключитьОбработчикОжидания("ОбновитьКартинки", 0.1, Истина);
		КонецЕсли; КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура КартинкаМаленькаяНажатие(Элемент, СтандартнаяОбработка)
	
	ЗагрузитьКартинку(Истина, СтандартнаяОбработка)
	
КонецПроцедуры
&НаКлиенте
Процедура КартинкаБольшаяНажатие(Элемент, СтандартнаяОбработка)
	
	ЗагрузитьКартинку(Ложь, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиПоГуиду(Команда)
	
	Перем СсылкаНоменклатура, СсылкаКартинка;
	
	стрГуид = "";
	Если 	ВвестиСтроку(стрГуид, "Гуид картинки:", 36) И
			стрГуид <> "" И
			НайтиПоГуидуНаСервере(стрГуид, СсылкаНоменклатура, СсылкаКартинка) Тогда
			
		Элементы.СписокНоменклатуры.ТекущаяСтрока = СсылкаНоменклатура;
		Элементы.СписокКартинок.ТекущаяСтрока = СсылкаКартинка;
		
		ОбновитьКартинки(); КонецЕсли;
		
КонецПроцедуры
&НаСервереБезКонтекста
Функция НайтиПоГуидуНаСервере(стрГуид, СсылкаНоменклатура, СсылкаКартинка)
	
	Попытка
		СсылкаКартинка = Справочники.КартинкиНоменклатуры.ПолучитьСсылку(Новый УникальныйИдентификатор(стрГуид));
	Исключение
		ОбщиеФункции.СообщитьТекст("Задан не верный формат гуида"); Возврат Ложь; КонецПопытки;
	
	Если СсылкаКартинка.Пустая() Тогда
		ОбщиеФункции.СообщитьТекст("Картинка по указаному гуиду не найдена"); Возврат Ложь; КонецЕсли;
	
	СсылкаНоменклатура = СсылкаКартинка.Владелец;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура НоваяКартинка(Команда)
	
	ЗагрузитьКартинку(Истина,, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область Корзина

#Если Не ВебКлиент Тогда
	
&НаСервере
Функция ПоложитьВКорзинуНаСервере(СсылкиТовара, ИмяКомпа, КолВКорзине)
	
	Инексы 	= Новый Массив;
	Таблица = Новый ТаблицаЗначений;
	Инд		= -1;
	
	Таблица.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	Таблица.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	
	Для Каждого Ссылка Из СсылкиТовара Цикл Инд = Инд + 1;Инексы.Добавить(Инд); НовСтрока = Таблица.Добавить(); НовСтрока.Номенклатура 	= Ссылка; НовСтрока.Количество 	= 1; КонецЦикла;
	
	Возврат МодульКорзины.ПоложитьТоварВКорзину(Таблица, Инексы, ИмяКомпа, КолВКорзине);
	
КонецФункции
&НаКлиенте
Процедура ПоложитьВКорзину(Команда)
	
	СсылкиТовара	 	= Элементы.СписокНоменклатуры.ВыделенныеСтроки;
	КолВКорзине 		= 0;
	КолТовара			= СсылкиТовара.Количество();
	
	Если КолТовара Тогда
		Если ПоложитьВКорзинуНаСервере(СсылкиТовара, ИмяКомпьютера(), КолВКорзине) Тогда
			МодульКорзины.ОповеститьОПомещенииТовара(КолТовара, КолВКорзине); КонецЕсли;
	Иначе
		МодульКорзины.ОповеститьЧтоНечегоДобавлять(); КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура РедактироватьТоварВКорзине(Команда)
	
	ОткрытьФорму("РегистрСведений.Корзина.Форма.Форма");
	
КонецПроцедуры
&НаСервере
Функция ОчиститьНаСервере(ИмяКомпа)
	
	Возврат МодульКорзины.ОчиститьКорзину(ИмяКомпа);
	
КонецФункции
&НаКлиенте
Процедура ОчиститьКорзину(Команда)
	
	Если ОчиститьНаСервере(ИмяКомпьютера()) Тогда МодульКорзины.ОповеститьЧтоКорзинаОчищена() КонецЕсли;
	
КонецПроцедуры

#КонецЕсли

#КонецОбласти

&НаСервере
Функция УстановитьКопииКартинокКорзины(ТекКартинка, ИмяКомпа, КолСтрок)
	
	Перем КартинкаОбъект;
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	
	МодульКорзины.ПолучитьТоварИзКорзиныКакЕсть(Таблица, ИмяКомпа, КолСтрок);
	
	Для Каждого Строка Из Таблица Цикл
		
		// Найдем точно такуюже картинку
		
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Справочник.КартинкиНоменклатуры ГДЕ Владелец = &Владелец И КопияКартинки = &КопияКартинки");
		Запрос.УстановитьПараметр("Владелец", 		Строка.Номенклатура);
		Запрос.УстановитьПараметр("КопияКартинки", 	ТекКартинка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда 
			КартинкаОбъект = Выборка.Ссылка.ПолучитьОбъект() 
		Иначе
			КартинкаОбъект = Справочники.КартинкиНоменклатуры.СоздатьЭлемент(); КонецЕсли;
		
		// Заполним реквизиты
		
		КартинкаОбъект.КопияКартинки = ТекКартинка;
		
		// Запишем
		
		Если ЗаписатьНовыйСправочник(ТекКартинка.Наименование, Строка.Номенклатура, КартинкаОбъект) = Неопределено Тогда Возврат Ложь; КонецЕсли; КонецЦикла;
		
	Возврат Истина;	
	
КонецФункции
&НаКлиенте
Процедура Размножить(Команда)
	
	#Если ВебКлиент Тогда
		ПоказатьПредупреждение(,"Эта штука на веб клиенте не работает (",,"Предупреждение"); Возврат;		
	#Иначе
		
		ТекКартинка = Элементы.СписокКартинок.ТекущаяСтрока;
		Если ТекКартинка = Неопределено Тогда ПоказатьПредупреждение(,"Не выбрана картинка",,"Предупреждение"); Возврат; КонецЕсли;
		
		КолСтрок = 0;
		Если УстановитьКопииКартинокКорзины(ТекКартинка, ИмяКомпьютера(), КолСтрок) Тогда
			Если КолСтрок Тогда
				ПоказатьОповещениеПользователя("Картинки установлены",,"На все позиции в корзине (" + КолСтрок + ")", БиблиотекаКартинок.Скрепка);
				Элементы.СписокНоменклатуры.Обновить();
		Иначе
			ПоказатьПредупреждение(,"я бы и рад наплодить картинку, да только корзина пустая",,"Предупреждение"); КонецЕсли; КонецЕсли;
	
	#КонецЕсли
	
КонецПроцедуры
