
Процедура СформироватьОтчет(ТабДок, мИдентификаторФормы, мДанныеРасшифровки) Экспорт
	
	СписокТиповЦен = Новый СписокЗначений;
	СписокТиповЦен.Добавить(Справочники.ТипыЦен.НайтиПоКоду("000000016"));  // СЦ (У.е.)
	СписокТиповЦен.Добавить(Справочники.ТипыЦен.НайтиПоКоду("000000017"));  // Опт 3 (от 8000 у.е.)
	СписокТиповЦен.Добавить(Справочники.ТипыЦен.НайтиПоКоду("000000018"));  // Опт 2 (от 5000 у.е)
	СписокТиповЦен.Добавить(Справочники.ТипыЦен.НайтиПоКоду("000000019"));  // Опт 1 (от 2000 у.е)
	
	ОсновнаяСхема = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	ДанныеРасшифровкиКомпоновки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	ПараметрыОтчета = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	ПараметрыОтчета.УстановитьЗначениеПараметра("НачалоПериода", ПериодДат.ДатаНачала);
	ПараметрыОтчета.УстановитьЗначениеПараметра("КонецПериода", ПериодДат.ДатаОкончания);
	ПараметрыОтчета.УстановитьЗначениеПараметра("СписокТиповЦен", СписокТиповЦен);
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(ОсновнаяСхема, КомпоновщикНастроек.Настройки, ДанныеРасшифровкиКомпоновки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровкиКомпоновки, Истина); 
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабДок);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Адрес = ПоместитьВоВременноеХранилище(ДанныеРасшифровкиКомпоновки, мИдентификаторФормы);
	мДанныеРасшифровки = Адрес;
	
КонецПроцедуры
