
&НаСервере
Функция СкопироватьНастройкиПечати(ОткудаСсылка, КудаСсылка)
	
	новСпр = КудаСсылка.ПолучитьОбъект();
	ЗаполнитьЗначенияСвойств(новСпр, ОткудаСсылка, "Макет, ОбластьШапки, ОбластьСтроки, ОбластьПодвала, ОбластьСтрокиПоказателя, ОбластьШапкиТаблицы, ОбластьШапкиТаблицыПоказателя",);
				
	Возврат ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(новСпр);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыборка(УправлОтчеты, текСсылка) Экспорт
	
	Если УправлОтчеты <> Неопределено Тогда
		
		Ном = 0; Кол = УправлОтчеты.Количество();
		Для Каждого УпрОтчет Из УправлОтчеты Цикл Ном = Ном + 1;
			ОбработкаПрерыванияПользователя();
			Если Не СкопироватьНастройкиПечати(текСсылка, УпрОтчет) Тогда Возврат КонецЕсли;
			Состояние("Копируем настройки печати", ном / Кол * 100, УпрОтчет); КонецЦикла; КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОткрытьФорму(
			"Справочник.УправленческаяОтчетность.Форма.ФормаВыбораДляКопирования", 
			Новый Структура("МножественныйВыбор", Истина), 
			ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка, 
			Новый ОписаниеОповещения("ОбработкаВыборка", ЭтотОбъект, ПараметрКоманды));
	
КонецПроцедуры
