
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Отчет.ПериодДат.ДатаНачала = НачалоМесяца(ТекущаяДата());
	Отчет.ПериодДат.ДатаОкончания = КонецМесяца(ТекущаяДата());
	
	УстановитьВидимостьЭлементовОтбора();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОтбор(Команда)
	
	УстановитьВидимостьЭлементовОтбора();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьЭлементовОтбора()
	
	Если НЕ Элементы.ФормаПоказатьОтбор.Пометка Тогда
		Элементы.КомпоновщикНастроекНастройкиОтбор.Видимость = Истина;
		Элементы.ФормаПоказатьОтбор.Пометка = Истина;
	Иначе
		Элементы.КомпоновщикНастроекНастройкиОтбор.Видимость = Ложь;
		Элементы.ФормаПоказатьОтбор.Пометка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьРезультатОтчета(Команда)
	
	СформироватьРезультатОтчетаНаСервере();
	
	УстановитьВидимостьЭлементовОтбора();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьРезультатОтчетаНаСервере()
		
	Результат.Очистить();
	
	ОтчетОбъект = РеквизитФормыВЗначение("Отчет");
	ОтчетОбъект.СформироватьОтчет(Результат, УникальныйИдентификатор, ДанныеРасшифровки);
	
КонецПроцедуры
