
Функция ПолучитьТаблДокИнфПоПрофилям(ПользовательСсылка) Экспорт
	
	
	
КонецФункции

#Область API_стандарт

//// Обязательные функции для API

//Функция API_URLОбновленияНаСайте() Экспорт 		Возврат "/api/managers/update" КонецФункции
//Функция API_СайтОбъекта(Ссылка) Экспорт Возврат Неопределено КонецФункции
//Функция API_ПолучитьОбъект(Ссылка, ДополнительныеПараметры = Неопределено) Экспорт
//	
//	//  _______________________________
//	// |                               |
//	// |¸.•*´¨`*•.[̲̲̅̅A̲̅P̅I̲̲̅̅]¸.•*´¨`*•.|	Возвращает (тип структура) объект для апи
//	// |_______________________________|
//	
//	
//	Ссылки = Новый Массив;
//	Ссылки.Добавить(Ссылка);
//	
//	Возврат КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(API_ПолучитьТаблицу(Ссылки, ДополнительныеПараметры));
//	
//КонецФункции
//Функция API_ПолучитьТаблицу(Ссылки = Неопределено, ДополнительныеПараметры = Неопределено) Экспорт
//	
//	//  _______________________________
//	// |                               |
//	// |¸.•*´¨`*•.[̲̲̅̅A̲̅P̅I̲̲̅̅]¸.•*´¨`*•.|	Возвращает таблицу значений с объектами для апи
//	// |_______________________________|
//	
//	Перем Сайт;
//	
//	Если ДополнительныеПараметры <> Неопределено Тогда
//		ДополнительныеПараметры.Свойство("Сайт", 			Сайт);
// КонецЕсли;
//	//
//	//Запрос = Новый Запрос(СтрШаблон("
//	//|ВЫБРАТЬ 	Ссылка guid
//	//|ИЗ 		Справочник.Пользователи
//	//|ГДЕ 		Не ПометкаУдаления и ВыгружатьНаСайт",
//	//
//	//?(Ссылки 		= Неопределено, "", " И Ссылка В(&Ссылки)")));
//	
//		Запрос = Новый Запрос(СтрШаблон("ВЫБРАТЬ
//		                                |	Пользователи.Ссылка КАК guid
//		                                |ИЗ
//		                                |	Справочник.Пользователи КАК Пользователи
//		                                |ГДЕ
//		                                |	НЕ Пользователи.ПометкаУдаления
//		                                |	И Пользователи.ВыгружатьНаСайт
//										|"+?(Ссылки 		= Неопределено, "", " И Ссылка В(&Ссылки)")));

//	
//	Запрос.УстановитьПараметр("Ссылки",			Ссылки);
//	Запрос.УстановитьПараметр("Сайт", 			Сайт);
//		
//	Возврат Запрос.Выполнить().Выгрузить();
//	
//КонецФункции

#КонецОбласти
