
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Для Каждого Номенклатура Из ПараметрКоманды Цикл
		
		Ошибка 		= "";
		Выгружено 	= 0;
		
		Если Картинки.ВыгрузитьКартинуНоменклатурыНаСайт(Номенклатура, Выгружено, ошибка) Тогда
			
			Если Выгружено Тогда
				ОбщиеФункции.СообщитьТекст("Выгружены картинки номенклатуры " + Номенклатура + " " + Выгружено + "шт.");
			Иначе
				ОбщиеФункции.СообщитьТекст("Нет картинок для выгрузки номенклатуры " + Номенклатура);
			КонецЕсли;
			
		Иначе 
			
			ОбщиеФункции.СообщитьТекст("Ошибка при выгрузке картинок номенклатуры " + Номенклатура + "
												|" + Ошибка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
