
&НаСервере
Процедура ОбновитьНадписьПартнеры()
	
	// Нарисуем вложения красиво
	
	ФормСтроки = Новый Массив;
	
	Инд = -1;
	Для Каждого Строка Из ДополнительныеПараметры Цикл
		
		Если ЗначениеЗаполнено(Строка.Контрагент) Тогда
			ФормСтроки.Добавить(Новый ФорматированнаяСтрока(Строка(Строка.Контрагент),,,,ПолучитьНавигационнуюСсылку(Строка.Контрагент))); КонецЕсли; КонецЦикла;
	
	ПартнерыНадпись = Новый ФорматированнаяСтрока(ФормСтроки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяФайла 			= Параметры.ИмяФайла;
	ТабличныйДокумент 	= Параметры.ТабличныйДокумент;
	
	Если ТипЗнч(Параметры.ДополнительныеПараметры) = Тип("Массив") Тогда
		
		Для Каждого Элемент Из Параметры.ДополнительныеПараметры Цикл ЗаполнитьЗначенияСвойств(ДополнительныеПараметры.Добавить(), Элемент) КонецЦикла;
		ОбновитьНадписьПартнеры(); КонецЕсли;
	
	Если ФорматФайла = "" Тогда ФорматФайла = "PDF" КонецЕсли;
	
	Заголовок = ИмяФайла;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьРасширениеДляФайлаПоТипу(ФорматФайла)
	
	Если ФорматФайла = "XLS97" Тогда
		Возврат "xls";
	Иначе
		Возврат НРег(ФорматФайла); КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция СохранитьВоВременныйФайл()
	
	ТипФайлаВложения = ТипФайлаТабличногоДокумента[ФорматФайла];
	РасширениеФайлаВложения = ПолучитьРасширениеДляФайлаПоТипу(ФорматФайла);
	
	Если ТипФайлаВложения = Неопределено Тогда ТипФайлаВложения = ТипФайлаТабличногоДокумента.PDF КонецЕсли;
	Если ПустаяСтрока(РасширениеФайлаВложения) Тогда РасширениеФайлаВложения = "pdf" КонецЕсли;
	
	ИмяФайлаСохр 	= ИмяФайла + "." + РасширениеФайлаВложения;
	ФулИмяФайла 	= КаталогВременныхФайлов() + ИмяФайлаСохр;
	
	// Сохраним
	
	Попытка
		ТабличныйДокумент.Записать(ФулИмяФайла, ТипФайлаВложения);
		Возврат ФулИмяФайла;
	Исключение
		стрОшибки = ОписаниеОшибки();
		ОбщиеФункции.СообщитьТекст("Ошибка при записи макета в файл
											|" + стрОшибки);КонецПопытки;
КонецФункции
&НаКлиенте
Процедура ОтправитьНаЭлектроннуюПочту(Команда)
	
	ФулИмяФайла = СохранитьВоВременныйФайл();
	
	Если ФулИмяФайла <> Неопределено Тогда
		
		// Добавим получателей
		
		Кому = Новый Массив;
		Для Каждого Строка Из ДополнительныеПараметры Цикл 
			
			Структура = Новый Структура("Контрагент", Строка.Контрагент);
			Если Найти(Строка.Почта, "@") Тогда Структура.Вставить("Почта", Строка.Почта); КонецЕсли; 
			
			Кому.Добавить(Структура); КонецЦикла;
		
		// Добавим вложения
		
		Вложения = Новый Массив;
		Вложения.Добавить(Новый Структура("ИмяФайла, ПолноеИмяФайла", ИмяФайла + "." + ПолучитьРасширениеДляФайлаПоТипу(ФорматФайла), ФулИмяФайла));
		
		// Открем письо для отправки
		
		ОткрытьФорму("Документ.Письмо.Форма.Письмо2", 
				Новый Структура("Кому, Вложения, УдалитьФайлыПослеОтправкия", Кому, Вложения),,,,,Новый ОписаниеОповещения("ОповеститьОбОтправкеПисьма", ЭтаФорма)); КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ОповеститьОбОтправкеПисьма(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда
		СобытияСистемы.ОповеститьОбОтправкеПисьма(Результат, ВладелецФормы) КонецЕсли;
	
КонецПроцедуры
