
&НаСервереБезКонтекста
Функция ПолучитьСписокЗаказов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "Выбрать Заказ,КоличествоОстаток из РегистрНакопления.ПотериТоваровВПути.Остатки";
	массивЗаказов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Заказ");
	Возврат массивЗаказов;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПоЗаказуНаСервере(Заказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "Выбрать Заказ,СкладОтправитель,СкладПолучатель,Номенклатура,КоличествоОстаток Количество из РегистрНакопления.ПотериТоваровВПути.Остатки(,Заказ = &Заказ)";
	Запрос.УстановитьПараметр("Заказ",Заказ);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Нов = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(Нов,Выборка);
	КонецЦикла;	
		
КонецПроцедуры

&НаКлиенте
Процедура ПриВыбореЗаказа(ВыбранныйЗаказ,ДопПараметры) Экспорт
	ЗаполнитьПоЗаказуНаСервере(ВыбранныйЗаказ.Значение);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоЗаказу(Команда)
	массивЗаказов = ПолучитьСписокЗаказов();
	СписокЗаказов = Новый СписокЗначений;
	СписокЗаказов.ЗагрузитьЗначения(массивЗаказов);
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ПриВыбореЗаказа",ЭтаФорма),СписокЗаказов, Элементы.Товары);
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоСкладуОтправителюНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоСкладуОтправителю(Команда)
	ЗаполнитьПоСкладуОтправителюНаСервере();
КонецПроцедуры
