
&НаСервере
Процедура СохранитьИзмененияНаСервере()
	Константы.ДедлайнНаОтправкуЗаказаВСборкуНачало.Установить(ВремяНачала);
	Константы.ДедлайнНаОтправкуЗаказаВСборкуОкончание.Установить(ВремяОкончания);
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзменения(Команда)
	СохранитьИзмененияНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВремяНачала = Константы.ДедлайнНаОтправкуЗаказаВСборкуНачало.Получить();
	ВремяОкончания = Константы.ДедлайнНаОтправкуЗаказаВСборкуОкончание.Получить();

КонецПроцедуры
