
Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос(
	
	КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() + "
	|;
	
	// ШАПКА
	
	|ВЫБРАТЬ
	|	Склад
	|ИЗ
	|	Документ.Комплектация
	|ГДЕ
	|	Ссылка = &Ссылка
	|;
	
	// ТОВАРЫ НА СКЛАДАХ
	
	|ВЫБРАТЬ
	|	&Период				КАК Период,
	|	ВЫБОР КОГДА Ссылка.Операция = &ОперацияКомплектация ТОГДА &ВидДвиженияРасход ИНАЧЕ &ВидДвиженияПриход КОНЕЦ КАК ВидДвижения,
	|	Ссылка.Склад		КАК Склад,
	|	Номенклатура,
	|	ВЫБОР КОГДА Упаковка = &ПустаяУпаковка ТОГДА
	|		СУММА(Количество)
	|	ИНАЧЕ
	|		СУММА(Количество*Упаковка.Коэффициент)
	|	КОНЕЦ				КАК Количество
    |ИЗ
	|	Документ.Комплектация.Товары
	|
	|ГДЕ
	|	Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Ссылка.Склад,
	|	Номенклатура,
	|	Упаковка,
	|	ВЫБОР КОГДА Ссылка.Операция = &ОперацияКомплектация ТОГДА &ВидДвиженияРасход ИНАЧЕ &ВидДвиженияПриход КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период				КАК Период,
	|	ВЫБОР КОГДА Ссылка.Операция = &ОперацияКомплектация ТОГДА &ВидДвиженияПриход ИНАЧЕ &ВидДвиженияРасход КОНЕЦ КАК ВидДвижения,
	|	Ссылка.Склад		КАК Склад,
	|	Номенклатура,
	|	ВЫБОР КОГДА Упаковка = &ПустаяУпаковка ТОГДА
	|		Количество
	|	ИНАЧЕ
	|		Количество*Упаковка.Коэффициент
	|	КОНЕЦ				КАК Количество
    |ИЗ
	|	Документ.Комплектация
	|
	|ГДЕ
	|	Ссылка = &Ссылка
	|;
	
	// ЯЧЕЙКИ
	
	|ВЫБРАТЬ
	|	&Период				КАК Период,
	|	ВЫБОР КОГДА Ссылка.Операция = &ОперацияКомплектация ТОГДА &ВидДвиженияРасход ИНАЧЕ &ВидДвиженияПриход КОНЕЦ КАК ВидДвижения,
	|	Ячейка				КАК Ячейка,
	|	Номенклатура,
	|	ВЫБОР КОГДА Упаковка = &ПустаяУпаковка ТОГДА
	|		СУММА(Количество)
	|	ИНАЧЕ
	|		СУММА(Количество*Упаковка.Коэффициент)
	|	КОНЕЦ				КАК Количество
    |ИЗ
	|	Документ.Комплектация.Товары
	|
	|ГДЕ
	|	Ссылка = &Ссылка И
	|	Ячейка <> &ПустаяЯчейка
	|
	|СГРУППИРОВАТЬ ПО
	|	Ячейка,
	|	Номенклатура,
	|	Упаковка,
	|	ВЫБОР КОГДА Ссылка.Операция = &ОперацияКомплектация ТОГДА &ВидДвиженияРасход ИНАЧЕ &ВидДвиженияПриход КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период				КАК Период,
	|	ВЫБОР КОГДА Ссылка.Операция = &ОперацияКомплектация ТОГДА &ВидДвиженияПриход ИНАЧЕ &ВидДвиженияРасход КОНЕЦ КАК ВидДвижения,
	|	Ячейка			КАК Ячейка,
	|	Номенклатура,
	|	ВЫБОР КОГДА Упаковка = &ПустаяУпаковка ТОГДА
	|		Количество
	|	ИНАЧЕ
	|		Количество*Упаковка.Коэффициент
	|	КОНЕЦ				КАК Количество
    |ИЗ
	|	Документ.Комплектация
	|
	|ГДЕ
	|	Ссылка = &Ссылка И
	|	Ячейка <> &ПустаяЯчейка
	|;
	
	//// ПАРТИИ ТОВАРОВ
	
	|ВЫБРАТЬ неопределено ГДЕ Истина=Ложь
	//|ВЫБРАТЬ
	//|	&Период				КАК Период,
	//|	ВЫБОР КОГДА Ссылка.Операция = &ОперацияКомплектация ТОГДА &ВидДвиженияРасход ИНАЧЕ &ВидДвиженияПриход КОНЕЦ КАК ВидДвижения,
	//|	ВЫБОР КОГДА Ссылка.Операция = &ОперацияКомплектация ТОГДА Партия ИНАЧЕ Ссылка КОНЕЦ КАК Партия,
	//|	Ссылка.Склад, Номенклатура,
	//|	СУММА(СуммаПартии) 	Сумма,
	//|	ВЫБОР КОГДА Упаковка = &ПустаяУпаковка ТОГДА
	//|		СУММА(Количество)
	//|	ИНАЧЕ
	//|		СУММА(Количество*Упаковка.Коэффициент)
	//|	КОНЕЦ				КАК Количество
	//|ИЗ
	//|	Документ.Комплектация.Товары
	//|ГДЕ
	//|	Ссылка = &Ссылка И СуммаПартии <> 0
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Ссылка, Номенклатура, Упаковка,
	//|	ВЫБОР КОГДА Ссылка.Операция = &ОперацияКомплектация ТОГДА &ВидДвиженияРасход ИНАЧЕ &ВидДвиженияПриход КОНЕЦ,
	//|	ВЫБОР КОГДА Ссылка.Операция = &ОперацияКомплектация ТОГДА Партия ИНАЧЕ Ссылка КОНЕЦ
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	&Период				КАК Период,
	//|	ВЫБОР КОГДА Операция = &ОперацияКомплектация ТОГДА &ВидДвиженияПриход ИНАЧЕ &ВидДвиженияРасход КОНЕЦ КАК ВидДвижения,
	//|	ВЫБОР КОГДА Операция = &ОперацияКомплектация ТОГДА Ссылка ИНАЧЕ Партия КОНЕЦ КАК Партия,
	//|	Ссылка.Склад, Номенклатура,
	//|	СУММА(СуммаПартии) 	Сумма,
	//|	ВЫБОР КОГДА Упаковка = &ПустаяУпаковка ТОГДА
	//|		СУММА(Количество)
	//|	ИНАЧЕ
	//|		СУММА(Количество*Упаковка.Коэффициент)
	//|	КОНЕЦ				КАК Количество
	//|ИЗ
	//|	Документ.Комплектация
	//|ГДЕ
	//|	Ссылка = &Ссылка И СуммаПартии <> 0
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Ссылка, Номенклатура, Упаковка, 
	//|	ВЫБОР КОГДА Операция = &ОперацияКомплектация ТОГДА &ВидДвиженияПриход ИНАЧЕ &ВидДвиженияРасход КОНЕЦ,
	//|	ВЫБОР КОГДА Операция = &ОперацияКомплектация ТОГДА Ссылка ИНАЧЕ Партия КОНЕЦ
	|");
	
	//Запрос.УстановитьПараметр("Область", 			ПараметрыСеанса.ТекущаяОбласть);
	Запрос.УстановитьПараметр("Ссылка", 				Ссылка);
	Запрос.УстановитьПараметр("Период", 				Ссылка.Дата);
	Запрос.УстановитьПараметр("ОперацияКомплектация",	Перечисления.ВидыОперацийКомплектацияНоменклатуры.Комплектация);
	Запрос.УстановитьПараметр("ВидДвиженияРасход", 		ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("ВидДвиженияПриход", 		ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("ПустаяЯчейка", 			Справочники.Ячейки.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяУпаковка", 		Справочники.УпаковкиНоменклатуры.ПустаяСсылка());

	Пакет = Запрос.ВыполнитьПакет();
	
	ДополнительныеСвойства.Вставить("ПараметрыСистемы", КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[0].Выгрузить()));
	ДополнительныеСвойства.Вставить("Шапка", 			КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[1].Выгрузить()));
	ДополнительныеСвойства.Вставить("ТоварыНаСкладах", 	Пакет[2].Выгрузить());
	ДополнительныеСвойства.Вставить("ТоварыВЯчейках", 	Пакет[3].Выгрузить());
	//ДополнительныеСвойства.Вставить("ПартииТоваров", 	Пакет[4].Выгрузить());
	
КонецПроцедуры

