
Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос(
	         
	КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() + "
	|;
	
	// ШАПКА
	
	|ВЫБРАТЬ
	|	Автор, Ответственный
	|ИЗ
	|	Документ.НазначениеКартСотрудникам
	|ГДЕ
	|	Ссылка = &Ссылка
	|;
	
	// ДЕЙСТВИЯ КАРТ
	
	|ВЫБРАТЬ	Ссылка.ДатаНачала Период, Карта, ФизЛицо
	|ИЗ			Документ.НазначениеКартСотрудникам.Карты
	|ГДЕ		Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ	Ссылка.ДатаОкончания Период, Карта, &ПустойФизик ФизЛицо
	|ИЗ			Документ.НазначениеКартСотрудникам.Карты
	|ГДЕ		Ссылка = &Ссылка И Ссылка.ДатаОкончания <> &ПустаяДата
	|;
	|");
	

	//Запрос.УстановитьПараметр("Область", 			ПараметрыСеанса.ТекущаяОбласть);
	Запрос.УстановитьПараметр("Ссылка", 		Ссылка);
	Запрос.УстановитьПараметр("ПустойФизик", 	Справочники.ФизическиеЛица.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяДата",		'00010101');
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ДополнительныеСвойства.Вставить("ПараметрыСистемы", 		КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[0].Выгрузить()));
	ДополнительныеСвойства.Вставить("Шапка", 					КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[1].Выгрузить()));
	ДополнительныеСвойства.Вставить("НазначенияКартФизЛицам", 	Пакет[2].Выгрузить());
	                       
КонецПроцедуры
