
Процедура ОбновитьТип(Объект) Экспорт
	
	// Обозначим представление типа
	
	стрМ = Новый Массив;
	Для Каждого Строка Из ОбрабатываемыеТипы Цикл стрМ.Добавить(ТипЗнч(Строка.ПустаяСсылка)); КонецЦикла;
	стр = СтрСоединить(стрМ, ",");
	
	Если стр <> стрТипы Тогда стрТипы = стр КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	ОбновитьТип(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.обм_ОбменДанными") Тогда
		
		Владелец = ДанныеЗаполнения; КонецЕсли;
	
КонецПроцедуры
