
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ГрафикСборокИОтгрузок.Записывать = Истина;
	Для Каждого ТекСтрокаСборка Из Сборка Цикл
		
		Движение				 = Движения.ГрафикСборокИОтгрузок.Добавить();
		Движение.Период			 = Дата;
		Движение.СборкаОтгрузка	 = Перечисления.СборкаОтгрузка.Сборка;		
		Движение.Отдел			 = ТекСтрокаСборка.Отдел;
		Движение.Подразделение	 = ТекСтрокаСборка.Подразделение;
		Движение.Город			 = ТекСтрокаСборка.Город;
		Движение.Доставка		 = ТекСтрокаСборка.Доставка;
		Движение.Понедельник	 = ТекСтрокаСборка.Понедельник;
		Движение.Вторник		 = ТекСтрокаСборка.Вторник;
		Движение.Среда			 = ТекСтрокаСборка.Среда;
		Движение.Четверг		 = ТекСтрокаСборка.Четверг;
		Движение.Пятница		 = ТекСтрокаСборка.Пятница;
		Движение.Суббота		 = ТекСтрокаСборка.Суббота;
		Движение.Воскресение	 = ТекСтрокаСборка.Воскресение;
		
	КонецЦикла;
	
	Для Каждого ТекСтрокаОтгрузка Из Отгрузка Цикл
		
		Движение				 = Движения.ГрафикСборокИОтгрузок.Добавить();
		Движение.Период			 = Дата;
		Движение.СборкаОтгрузка	 = Перечисления.СборкаОтгрузка.Отгрузка;		
		Движение.Отдел			 = ТекСтрокаОтгрузка.Отдел;
		Движение.Подразделение	 = ТекСтрокаОтгрузка.Подразделение;
		Движение.Город			 = ТекСтрокаОтгрузка.Город;
		Движение.Доставка		 = ТекСтрокаОтгрузка.Доставка;
		Движение.Понедельник	 = ТекСтрокаОтгрузка.Понедельник;
		Движение.Вторник		 = ТекСтрокаОтгрузка.Вторник;
		Движение.Среда			 = ТекСтрокаОтгрузка.Среда;
		Движение.Четверг		 = ТекСтрокаОтгрузка.Четверг;
		Движение.Пятница		 = ТекСтрокаОтгрузка.Пятница;
		Движение.Суббота		 = ТекСтрокаОтгрузка.Суббота;
		Движение.Воскресение	 = ТекСтрокаОтгрузка.Воскресение;
		
	КонецЦикла;
	
КонецПроцедуры
