
&НаКлиенте
перем ИдетОбновление;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЦенПриИзменении(Элемент)
	
	ОбновитьТаблицуСписок(Элементы.Дерево.ТекущаяСтрока)
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьТаблицуСписок(РодительНоменклатуры)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Ссылка 								КАК Номенклатура,
	|	Цены.Цена 							КАК Цена,
	|	ОстСкл.КоличествоОстаток			КАК ОстатокСклад,
	|	ОстСоф.КоличествоОстаток			КАК ОстатокСофийская,
	|	ОстПис.КоличествоОстаток			КАК ОстатокПискаревский,
	|	ВЫБОР КОГДА ЕСТЬNULL(Картинка, &ПустаяКартинка) = &ПустаяКартинка ТОГДА ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ КАК ЕстьКартинка,
	|	ЕСТЬNULL(Картинка, &ПустаяКартинка) КАК КартинкаСсылка
	|ИЗ
	|	Справочник.Номенклатура КАК Спр
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(,ТипЦен = &ТипЦен И Номенклатура.Родитель = &Родитель) КАК Цены
	|ПО
	|	Цены.Номенклатура = Спр.Ссылка
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	регистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &СкладСклад И Номенклатура.Родитель = &Родитель) КАК ОстСкл
	|ПО
	|	ОстСкл.Номенклатура = Спр.Ссылка
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	регистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &СкладСофийская И Номенклатура.Родитель = &Родитель) КАК ОстСоф
	|ПО
	|	ОстСоф.Номенклатура = Спр.Ссылка
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	регистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &СкладПискаревский И Номенклатура.Родитель = &Родитель) КАК ОстПис
	|ПО
	|	ОстПис.Номенклатура = Спр.Ссылка
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	(
	|		ВЫБРАТЬ 
	|			МАКСИМУМ(Ссылка) 	КАК Картинка,
	|			Владелец 			КАК Номенклатура
	|		ИЗ 		
	|			Справочник.КартинкиНоменклатуры
	|		ГДЕ 	
	|			ЭтоПредставлениеОбъекта = ИСТИНА И
	|			Владелец.Родитель 		= &Родитель
	|
	|		СГРУППИРОВАТЬ ПО
	|			Владелец
	|			
	|	) КАК Картинки
	|ПО
	|	Картинки.Номенклатура = Спр.Ссылка
	|
	|ГДЕ
	|	Родитель = &Родитель
	|");
	
	Запрос.УстановитьПараметр("Родитель", 			РодительНоменклатуры);
	Запрос.УстановитьПараметр("ПустаяКартинка",		Справочники.КартинкиНоменклатуры.ПустаяСсылка());
	Запрос.УстановитьПараметр("ТипЦен", 			ТипЦен);
	Запрос.УстановитьПараметр("СкладСклад", 		Справочники.Склады.НайтиПоНаименованию("Основной склад"));
	Запрос.УстановитьПараметр("СкладСофийская", 	Справочники.Склады.НайтиПоНаименованию("Магазин (Софийская)"));
	Запрос.УстановитьПараметр("СкладПискаревский", 	Справочники.Склады.НайтиПоНаименованию("Магазин (Пискаревский)"));
	
	ТаблицаСписок.Загрузить(Запрос.Выполнить().Выгрузить());
	
	СтрокиКартинок = ТаблицаСписок.НайтиСтроки(Новый Структура("ЕстьКартинка", Истина));
	Для Каждого Строка Из СтрокиКартинок Цикл
		Строка.Картинка = ПолучитьНавигационнуюСсылку(Строка.КартинкаСсылка, "Аватар");
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПриАктивизацииСтроки(Элемент)
	
	ТекСтрока = Элемент.ТекущаяСтрока;
	
	Если 	ТекСтрока <> Неопределено И
			ИдетОбновление <> Истина Тогда
				
		ИдетОбновление = Истина;
				
		ОбновитьТаблицуСписок(ТекСтрока);
			
		ИдетОбновление = Ложь;
			
	КонецЕсли;
	
КонецПроцедуры
