
// СТАНДАРТНЫЙ ИНТЕРФЕЙС

Процедура ЗаполнитьФормуПоБП(Форма, СсылкаПроцесс, СсылкаЗадача = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(СсылкаПроцесс) Тогда
		
		Запрос = Новый Запрос("
		
		// Условия
		
		|ВЫБРАТЬ 	
		|	Заказ, Заказ.Партнер Партнер
		|ПОМЕСТИТЬ
		|	Шапка
		|ИЗ
		|	БизнесПроцесс.ОтменаСборки КАК Процесс
		|ГДЕ
		|	Ссылка = &СсылкаБП
		|;
		
		// Шапка
		
		|ВЫБРАТЬ 	
		|	Заказ, Партнер
		|ИЗ
		|	Шапка;
		
		|");
		
		Запрос.УстановитьПараметр("СсылкаБП", 	СсылкаПроцесс);
		Запрос.УстановитьПараметр("Заказ", 		СсылкаПроцесс.Заказ);
		
		Результаты = Запрос.ВыполнитьПакет();
		
		// Заполним шапку
		
		ВыборкаШапки = Результаты[1].Выбрать();
		ВыборкаШапки.Следующий();
		
		ЗаполнитьЗначенияСвойств(Форма, ВыборкаШапки);	

		// Заполним таблицу
		
		ТаблТоваров = Заказы.ПолучитьСостояниеТоваровПоСтатусу(?(СсылкаПроцесс.Сборка = Неопределено, Заказы.ПолучитьПроцесс(СсылкаПроцесс.Заказ), СсылкаПроцесс.Сборка),,Перечисления.СостояниеСборкиЗаказа.Собрано);
		//ТаблТоваров = Заказы.ПолучитьСостояниеТоваровПоСтатусу(?(СсылкаПроцесс.Сборка = Неопределено, Заказы.ПолучитьПроцесс(СсылкаПроцесс.Заказ), СсылкаПроцесс.Сборка),,Перечисления.СостояниеСборкиЗаказа.ОтменаСборки);
		ТаблТоваров.Колонки.Количество.Имя = "Собрано";
		Форма.Товары.Загрузить(ТаблТоваров);КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьЗаголовокБП(СсылкаПроцесс) Экспорт
	
	Возврат Строка(СсылкаПроцесс);
	
КонецФункции

Функция ПолучитьМассивКомментариев(СсылкаПроцесс) Экспорт
	
	Массив = Новый Массив;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Комментарий, Заголовок, ДатаВыполнения, Исполнитель
	|ИЗ
	|(
	|	ВЫБРАТЬ
	|		Комментарий, Наименование Заголовок, ДатаВыполнения, Исполнитель
	|	ИЗ
	|		Задача.ЗадачаПользователю
	|	ГДЕ
	|		БизнесПроцесс = &Ссылка ИЛИ
	|		БизнесПроцесс В(ВЫБРАТЬ Ссылка ИЗ   БизнесПроцесс.ЗаявкаПокупателя   ГДЕ Заказ = &Заказ) ИЛИ
	|		БизнесПроцесс В(ВЫБРАТЬ Ссылка ИЗ   БизнесПроцесс.ИнтернетЗаявка     ГДЕ Заказ = &Заказ) ИЛИ
	|		БизнесПроцесс В(ВЫБРАТЬ Ссылка ИЗ	БизнесПроцесс.ПеремещениеТоваров ГДЕ Заказчик = &Ссылка)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Комментарий, ""Заказ покупателя"", Дата, Ответственный
	|	ИЗ
	|		Документ.ЗаказПокупателя
	|	ГДЕ
	|		Ссылка = &Заказ
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Комментарий, ""Внутренний заказ"", Дата, Ответственный
	|	ИЗ
	|		Документ.ВнутреннийЗаказ
	|	ГДЕ
	|		Ссылка = &Заказ
    |
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Комментарий, ""Реализация товаров"", Дата, Ответственный
	|	ИЗ
	|		Документ.РеализацияТоваров
	|	ГДЕ
	|		Заказ = &Заказ
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Комментарий, ""Сборка заказа"", Дата, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|	ИЗ
	|		БизнесПроцесс.СборкаЗаказа
	|	ГДЕ
	|		Заказ = &Заказ
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Комментарий, ""Заявка покупателя"", Дата, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|	ИЗ
	|		БизнесПроцесс.ЗаявкаПокупателя
	|	ГДЕ
	|		Заказ = &Заказ
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Комментарий, ""Отмена сборки"", Дата, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|	ИЗ
	|		БизнесПроцесс.ОтменаСборки
	|	ГДЕ
	|		Заказ = &Заказ
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Комментарий, ""Интернет заявка"", Дата, ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|	ИЗ
	|		БизнесПроцесс.ИнтернетЗаявка
	|	ГДЕ
	|		Заказ = &Заказ
	|) Запрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаВыполнения
	|");
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаПроцесс);
	Запрос.УстановитьПараметр("Заказ", 	СсылкаПроцесс.Заказ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Не ПустаяСтрока(Выборка.Комментарий) Тогда
		
			Массив.Добавить(Новый Структура("Комментарий, Заголовок, ДатаВыполнения, Исполнитель",
									Выборка.Комментарий, Выборка.Заголовок, Выборка.ДатаВыполнения, Выборка.Исполнитель));
			
		КонецЕсли;
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

