
Процедура ОтменитьСборкуПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	//Запрос = Новый Запрос("
	//|ВЫБРАТЬ 	РАЗЛИЧНЫЕ ВЫБОР КОГДА СкладЯчейка ССЫЛКА Справочник.Ячейки ТОГДА СкладЯчейка.Владелец ИНАЧЕ СкладЯчейка КОНЕЦ Склад
	//|ИЗ РегистрНакопления.ОтменаСборкиЗаказа.Остатки(,Заказ = &Заказ)");
	//
	//Запрос.УстановитьПараметр("Заказ", Заказ);
	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	
	//	Задача = Задачи.ЗадачаПользователю.СоздатьЗадачу();
	//	Задача.ТочкаМаршрута	= ТочкаМаршрутаБизнесПроцесса;
	//	Задача.БизнесПроцесс 	= Ссылка;
	//	Задача.Склад 			= Выборка.Склад;
	//	Задача.Заказ 			= Заказ;
	//	Задача.Роль				= Справочники.Роли.Кладовщик;
	//	Задача.Наименование 	= "Вернуть товар по заказу " + Заказ.Номер;
	//	Задача.Дата				= ТекущаяДата();
	//	
	//	ФормируемыеЗадачи.Добавить(Задача);	
	//КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "Выбрать Склад, КоличествоОстаток  из РегистрНакопления.ТоварыСобранные.Остатки(, Заказ = &Заказ)";
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Рез = Запрос.Выполнить();
	
	Выборка = Рез.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Задача = Задачи.ЗадачаПользователю.СоздатьЗадачу();
		Задача.ТочкаМаршрута	= ТочкаМаршрутаБизнесПроцесса;
		Задача.БизнесПроцесс 	= Ссылка;
		Задача.Склад 			= Выборка.Склад;
		Задача.Заказ 			= Заказ;
		Задача.Роль				= Справочники.Роли.Кладовщик;
		Задача.Наименование 	= "Вернуть товар по заказу " + Заказ.Номер;
		Задача.Дата				= ТекущаяДата();
		
		ФормируемыеЗадачи.Добавить(Задача);	
	КонецЦикла;
	
	
КонецПроцедуры
