
Процедура ОтменитьСборкуПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	
	Задача = Задачи.ЗадачаПользователю.СоздатьЗадачу();
	Задача.ТочкаМаршрута	= ТочкаМаршрутаБизнесПроцесса;
	Задача.БизнесПроцесс 	= Ссылка;
	Задача.Склад 			= Склад;
	Задача.Заказ 			= Заказ;
	Задача.Роль				= Справочники.Роли.Кладовщик;
	Задача.Наименование 	= "Разобрать товар " + Заказ.Номер;
	Задача.Дата				= ТекущаяДата();
	
	ФормируемыеЗадачи.Добавить(Задача);	
	
	
КонецПроцедуры

Процедура СоздатьЗаданиеНаРазборкуПередСозданиемЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	
	Задача = Задачи.ЗадачаПользователю.СоздатьЗадачу();
	Задача.ТочкаМаршрута	= ТочкаМаршрутаБизнесПроцесса;
	Задача.БизнесПроцесс 	= Ссылка;
	Задача.Склад 			= Склад;
	Задача.Заказ 			= Заказ;
	Задача.Роль				= Справочники.Роли.Логист;
	Задача.Наименование 	= "Создать заказ на разборку " + Заказ.Номер;
	Задача.Дата				= ТекущаяДата();
	
	ФормируемыеЗадачи.Добавить(Задача);	
	
КонецПроцедуры
