
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Схема 		= Параметры.Схема;
	Заголовок 	= Параметры.Заголовок;
	
КонецПроцедуры

//&НаКлиенте
//Процедура СхемаВыбор(Элемент)
//	
//	Если ТипЗнч(Элемент.ТекущийЭлемент) = Тип("ЭлементГрафическойСхемыДействие") Тогда
//	
//		ПараметрыФормы = ПолучитьПараметрыФормыЗадачи(Элемент.ТекущийЭлемент.Значение);
//		
//		Если ПараметрыФормы <> Неопределено Тогда
//		
//			ОткрытьФорму(
//				"БизнесПроцесс.РемонтИнструмента.Форма.Задача_" + Элемент.ТекущийЭлемент.Имя, 
//				ПараметрыФормы);
//				
//		КонецЕсли;
//	КонецЕсли;
//			
//КонецПроцедуры

//&НаСервере
//Функция ПолучитьПараметрыФормыЗадачи(ТочкаМаршрута)
//	
//	Запрос = Новый Запрос("
//	|ВЫБРАТЬ ПЕРВЫЕ 1 	Ссылка 
//	|ИЗ 				Задача.ЗадачаПользователю 
//	|ГДЕ 				БизнесПроцесс = &Ссылка И
//	|					ТочкаМаршрута = &ТочкаМаршрута
//	|УПОРЯДОЧИТЬ ПО		Дата Убыв
//	|");
//	
//	Запрос.УстановитьПараметр("Ссылка", 		Объект.Ссылка);
//	Запрос.УстановитьПараметр("ТочкаМаршрута", 	ТочкаМаршрута);
//	
//	Выполнение = Запрос.Выполнить();
//	
//	Если Не Выполнение.Пустой() Тогда
//		
//		Выборка = Выполнение.Выбрать();
//		
//		Если Выборка.Следующий() Тогда
//			
//			Возврат Новый Структура("Ключ", Выборка.Ссылка);
//			
//		КонецЕсли;
//	КонецЕсли;
//	
//	Возврат Неопределено
//	
//КонецФункции
