

&НаСервере
Процедура ЗапретитьКОтгрузкеНаСервере(ТекДог)
	
	Отбор = Новый Структура();
	Отбор.Вставить("Договор",ТекДог);
	ЗаписьОСостоянииДок = РегистрыСведений.СтадииПодписанияДоговоров.ПолучитьПоследнее(ТекущаяДата(),Отбор);
	
Если ЗаписьОСостоянииДок.ОтгрузкаПоДоговоруРазрешена = Истина Тогда	
		
	МенеджерЗаписи = РегистрыСведений.СтадииПодписанияДоговоров.СоздатьМенеджерЗаписи(); 
	
	МенеджерЗаписи.Период    = ТекущаяДата();
	МенеджерЗаписи.Договор   = ТекДог; 
	МенеджерЗаписи.ОтгрузкаПоДоговоруРазрешена = Ложь; 
	МенеджерЗаписи.СтадияПодписанияДоговора    = ЗаписьОСостоянииДок.СтадияПодписанияДоговора; 
	
	МенеджерЗаписи.Записать(); 
	
КонецЕсли;

   
КонецПроцедуры

&НаКлиенте
Процедура ЗапретитьКОтгрузке(Команда)
	
	СсылкаНаТекущийЭлементСправочника = Элементы.Список.ТекущаяСтрока;//.ТекущиеДанные.Ссылка;
    ЗапретитьКОтгрузкеНаСервере(СсылкаНаТекущийЭлементСправочника);
    Элементы.Список.Обновить();
	КонецПроцедуры

&НаСервере
Процедура РазрешитьКОтгрузкеНаСервере(ТекДог)
	
	Отбор = Новый Структура();
	Отбор.Вставить("Договор",ТекДог);
	ЗаписьОСостоянииДок = РегистрыСведений.СтадииПодписанияДоговоров.ПолучитьПоследнее(ТекущаяДата(),Отбор);
	
Если ЗаписьОСостоянииДок.ОтгрузкаПоДоговоруРазрешена = Ложь Тогда	
		
	МенеджерЗаписи = РегистрыСведений.СтадииПодписанияДоговоров.СоздатьМенеджерЗаписи(); 
	
	МенеджерЗаписи.Период    = ТекущаяДата();
	МенеджерЗаписи.Договор   = ТекДог; 
	МенеджерЗаписи.ОтгрузкаПоДоговоруРазрешена = Истина; 
	МенеджерЗаписи.СтадияПодписанияДоговора    = ЗаписьОСостоянииДок.СтадияПодписанияДоговора; 
	
	МенеджерЗаписи.Записать(); 
	
КонецЕсли;
    


КонецПроцедуры

&НаКлиенте
Процедура РазрешитьКОтгрузке(Команда)
	
	СсылкаНаТекущийЭлементСправочника = Элементы.Список.ТекущаяСтрока;
	РазрешитьКОтгрузкеНаСервере(СсылкаНаТекущийЭлементСправочника);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры
