
&НаСервере
Функция ПолучитьВыборкуЗаказов(ДатаНачала, ДатаОкончания)
	
	Запрос = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ ЖурналДокументов.ЖурналЗаказов ГДЕ ИСТИНА" + 
		?(ДатаНачала = '00010101', "", " И Дата >= &ДатаНачала") +
		?(ДатаОкончания = '00010101', "", " И Дата <= &ДатаОкончания"));
		
	Запрос.УстановитьПараметр("ДатаНачала", 	ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", 	ДатаОкончания);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции
&НаСервере
Функция ОбновитьСтатусЗаказа(Заказ)
	
	Возврат Заказы.ОбновитьРеквизитыЖурнала(Заказ);
	
КонецФункции

&НаКлиенте
Процедура Запуск(Команда)
	
	датаНач = ТекущаяДата();
	
	массЗаказов = ПолучитьВыборкуЗаказов(Период.ДатаНачала, Период.ДатаОкончания);
	колЗаказов 	= массЗаказов.Количество();
	
	Ном = 0;
	Для Каждого Заказ Из массЗаказов Цикл Ном = Ном + 1;
		Состояние("Установка статусов", ном / колЗаказов * 100, Заказ);
		
		Если ОбновитьСтатусЗаказа(Заказ) Тогда ОбработкаПрерыванияПользователя();
		Иначе Прервать КонецЕсли; КонецЦикла;
	
	ПоказатьПредупреждение(,"Обновление завершено, 
				|обработано " + Ном + " объектов, за " + (ТекущаяДата() - датаНач) + " сек.",,"Сообщение");
	
КонецПроцедуры
