
&НаСервере
Процедура ОбновитьПараметрыВремени()
	
	ТекДата = ТекущаяДата();
	
	//Список.Параметры.УстановитьЗначениеПараметра("ЗаЧас", 			ТекДата - 3600);
	//Список.Параметры.УстановитьЗначениеПараметра("За3Часа", 		ТекДата - 3600 * 3);
	//Список.Параметры.УстановитьЗначениеПараметра("Сегодня", 		НачалоДня(ТекДата));
	//Список.Параметры.УстановитьЗначениеПараметра("Вчера", 			НачалоДня(НачалоДня(ТекДата) - 1));
	//Список.Параметры.УстановитьЗначениеПараметра("Неделя", 			НачалоНедели(ТекДата));
	//Список.Параметры.УстановитьЗначениеПараметра("ПрошлаяНеделя", 	НачалоНедели(НачалоНедели(ТекДата) - 1));
	//Список.Параметры.УстановитьЗначениеПараметра("ЭтотМесяц", 		НачалоМесяца(ТекДата));
	//Список.Параметры.УстановитьЗначениеПараметра("ВПрошломМесяце", 	НачалоМесяца(НачалоМесяца(ТекДата) - 1));
	//Список.Параметры.УстановитьЗначениеПараметра("ВЭтотГод", 		НачалоГода(ТекДата));
	
	//Список.Параметры.УстановитьЗначениеПараметра("ПустаяДата", 	'00010101');
	//Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекДата);
	//Список.Параметры.УстановитьЗначениеПараметра("НачалоИсчесления", '20120401');

	ТекстИнфо = "Сформировано в " + Формат(ТекДата,"ДЛФ=T");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьПараметрыВремени();
		
КонецПроцедуры

&НаСервере
Функция ПолучитьПроцесс(ИмяПроцесса, СсылкаЗаказ)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка
	|ИЗ БизнесПроцесс." + ИмяПроцесса + "
	|ГДЕ Заказ = &Заказ
	|");
	
	Запрос.УстановитьПараметр("Заказ", СсылкаЗаказ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Ссылка;
		
	КонецЕсли;
	
КонецФункции
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ИмяПроцесса = Элементы.Список.ТекущиеДанные.ИмяПроцесса;
	
	Если Не ПустаяСтрока(ИмяПроцесса) Тогда
		
		Процесс = ПолучитьПроцесс(ИмяПроцесса, ВыбраннаяСтрока);
		Если Процесс <> Неопределено Тогда
			
			СтандартнаяОбработка = Ложь;
			ОткрытьФорму("БизнесПроцесс." + ИмяПроцесса + ".ФормаОбъекта", Новый Структура("Ключ", Процесс), ВладелецФормы);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьПараметрыВремени();
	Элементы.Список.Обновить();
	
КонецПроцедуры


&НаКлиенте
Процедура ВвестиПлатежноеПоручениеВходящее(Команда)
	
	текДок = Элементы.Список.ТекущаяСтрока;
	Если текДок <> Неопределено Тогда
		
		ОткрытьФорму("Документ.ПлатежноеПоручениеВходящее.ФормаОбъекта", Новый Структура("Основание", текДок));
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВвестиПриходныйКассовыйОрдер(Команда)
	
	текДок = Элементы.Список.ТекущаяСтрока;
	Если текДок <> Неопределено Тогда
		
		ОткрытьФорму("Документ.ПриходныйКассовыйОрдер.ФормаОбъекта", Новый Структура("Основание", текДок));
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Слежение.Записать("Открытие. Рабочие заказы", "ЖурналыДокументов.ЖурналЗаказов");
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если 	ИмяСобытия = СобытияСистемы.Событие_ЗаписанаЗадача() ИЛИ
			ИмяСобытия = СобытияСистемы.Событие_ИзмениласьЗагрузкаАвтомобиля() Тогда
			
		//ОбновитьОтображениеДанных();  КонецЕсли;
		Элементы.Список.Обновить(); КонецЕсли;
	
КонецПроцедуры

