
&НаСервере
Процедура АктивироватьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПодарочныеКарты.Ссылка,
	               |	ПодарочныеКарты.СтатусКарты,
	               |	ПодарочныеКарты.Наименование
	               |ИЗ
	               |	Справочник.ПодарочныеКарты КАК ПодарочныеКарты
	               |ГДЕ
	               |	ПодарочныеКарты.Номинал = &Номинал
	               |	И ПодарочныеКарты.ПорядковыйНомер МЕЖДУ &НомерНачала И &НомерКонца";
	Запрос.УстановитьПараметр("Номинал",Перечисления.ПодарочныеКарты_Номинал.н500);
	Запрос.УстановитьПараметр("НомерНачала",от);
	Запрос.УстановитьПараметр("НомерКонца",до);
	Результат = Запрос.Выполнить().Выбрать();
	Пока Результат.Следующий() Цикл
		Если Результат.СтатусКарты <> Перечисления.ПодарочныеКарты_Статус.Создана Тогда
			Сообщить("Карту "+Результат.Наименование+" нельзя активировать, т.к. её статус: "+Результат.СтатусКарты);
		КонецЕсли;
		ТекОбъект = Результат.Ссылка.ПолучитьОбъект();
		ТекОбъект.СтатусКарты = Перечисления.ПодарочныеКарты_Статус.Активирована;
		ТекОбъект.ДатаАктивации = ТекущаяДата();
		ТекОбъект.МестоАктивации = МестоАктивации;
		ТекОбъект.Записать();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Активировать(Команда)
	Если от=0 или до=0 или МестоАктивации.Пустая() Тогда
		ПоказатьПредупреждение(,"Все поля обязательны для заполнения");
		Возврат;
	КонецЕсли;
	АктивироватьНаСервере();
КонецПроцедуры
