
&НаСервере
Функция ПолучитьСуммуСтроку(ВыделенныеСтроки)
	
	Возврат ДиалогиСПользователем.ПолучитьСуммуВыделеныхСтрок(ВыделенныеСтроки, "Документ.РеализацияПереданныхТоваров");
	
КонецФункции
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// Выведем информационную надпись
	
	ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	
	Если ВыделенныеСтроки.Количество() Тогда
		
		Сумма = ПолучитьСуммуСтроку(ВыделенныеСтроки);
		ИнформационнаяСтрока = ?(Сумма, 
				"Выделено на сумму " + Сумма, 
				"нет суммы");
		
	Иначе
		
		ИнформационнаяСтрока = "не выбраны документы";
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Параметры.Заказ) Тогда
	
		ЭлОтбора = Список.Отбор.Элементы[0];
		ЭлОтбора.ПравоеЗначение = Параметры.Заказ;
		ЭлОтбора.Использование 	= Истина;
		
	КонецЕсли;
	
КонецПроцедуры
