
&НаСервере
Функция ПолучитьТекст(Ссылка)
	
	//Если Метаданные.БизнесПроцессы.Содержит(Ссылка) Тогда
	
	Таблица = Заказы.ПолучитьСостояниеТоваров(Ссылка);
	Текст 	= "";
	
	Для Каждого Строка Из Таблица Цикл
		
		стр = "";
		Для Каждого Колонка Из Таблица.Колонки Цикл стр = стр + Символы.Таб + Колонка.Имя + ":" + Строка[Колонка.Имя]; КонецЦикла;
		
		Текст = Текст + Символы.ПС + стр; КонецЦикла;
	
	Возврат Текст;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
	Текст = Новый ТекстовыйДокумент;
	Текст.УстановитьТекст(ПолучитьТекст(ПараметрКоманды));
	Текст.Показать();
	
КонецПроцедуры
