
&НаСервере
Процедура ЗаполнитьГрафик(Дата)
	
	текДата = НачалоМесяца(Дата);
	Пока НачалоМесяца(текДата) = НачалоМесяца(Дата) Цикл Запись = РегистрыСведений.РабочиеДни.СоздатьМенеджерЗаписи(); Запись.Дата = текДата; Запись.Выходной = ДеньНедели(текДата) > 5; ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(Запись);текДата = текДата + 86400; КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Дата = ТекущаяДата();
	Если ВвестиДату(Дата, "День месяца", ЧастиДаты.Дата) Тогда
		
		ЗаполнитьГрафик(Дата);
		
	КонецЕсли;
	
КонецПроцедуры
