
&НаСервере
Функция ПолучитьПараметрыДляТабличногоДокумента(Ссылки, СтрНомер)
	
	Возврат Заказы.ПолучитьПараметрыДляТабличногоДокумента(Ссылки, СтрНомер);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДок = Новый ТабличныйДокумент;
	Печать(ТабДок, ПараметрКоманды);

	ФункцииФормДокументов.УстановитьНастройкиТабличногоДокумента(ТабДок);
	
	ТабДок.ДвусторонняяПечать = ТипДвустороннейПечати.ПереворотВлево;
	//ТабДок.АвтоМасштаб = Истина;
	
	СтрНомера = "";
	ДополнительныеПараметры = ПолучитьПараметрыДляТабличногоДокумента(ПараметрКоманды, СтрНомера);
	ОткрытьФорму("ОбщаяФорма.ТабличныйДокумент", Новый Структура("ТабличныйДокумент, ИмяФайла, ДополнительныеПараметры", ТабДок, СтрНомера, ДополнительныеПараметры),ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

&НаСервере
Процедура Печать(ТабДок, ПараметрКоманды)
	
	Макет 		= Документы.ЗаказПокупателя.ПолучитьМакет("НовыйЗаказНем");
	Структура 	= Новый Структура("Шапка, ШапкаТаблицы, Строка_1, Строка_2, Подвалстроки, ПодвалТаблицы, НадписьВПодвале",
							Макет.ПолучитьОбласть("Шапка_Auftragsbestätigung"),
							Макет.ПолучитьОбласть("ШапкаТаблицы"),
							Макет.ПолучитьОбласть("Строка_1"),
							Макет.ПолучитьОбласть("Строка_2"),
							Макет.ПолучитьОбласть("ПодвалСтроки"),
							Макет.ПолучитьОбласть("ПодвалТаблицы"),
							Макет.ПолучитьОбласть("НадписьВПодвале_Auftragsbestätigung"));
	Инд = -1;
	Для Каждого Ссылка Из ПараметрКоманды Цикл Инд = Инд + 1; Если Инд Тогда ТабДок.ВывестиГоризонтальныйРазделительСтраниц(); КонецЕсли;
		
		Если ТипЗнч(Ссылка) = Тип("БизнесПроцессСсылка.ЗаявкаПокупателя") Тогда
			///Антон
			ДанныеДляПечати = ПечатьНаСервере.ПолучитьДанныеДляНемецкогоЗаказаВЗаказе(Ссылка.Заказ);
			ПечатьНаСервере.Печатать_СчетЗаказНаНемецком(ТабДок, ДанныеДляПечати, Структура, "AB");
		ИначеЕсли
			ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			////Антон
			ДанныеДляПечати = ПечатьНаСервере.ПолучитьДанныеДляНемецкогоЗаказаВЗаказе(Ссылка);
			ПечатьНаСервере.Печатать_СчетЗаказНаНемецком(ТабДок, ДанныеДляПечати, Структура, "AB");КонецЕсли; КонецЦикла;
		
КонецПроцедуры