
Процедура ПередЗаписью(Отказ)
	Наименование =  ?(НЕ ПустаяСтрока(ПочтовыйИндекс), ПочтовыйИндекс + " ", "") + ?(НЕ ПустаяСтрока(Регион), Регион + ", ", "") +
					?(НЕ ПустаяСтрока(Город), "г. " + Город + ", ", "" ) +
					//?(НЕ ПустаяСтрока(НаселенныйПункт), "н.п. " + НаселенныйПункт + ", ", "" ) +
					//?(НЕ ПустаяСтрока(Адрес), Адрес + ",", "");
					?(НЕ ПустаяСтрока(Улица), Улица + ",", "");
					
	Если НЕ ПустаяСтрока(Наименование) Тогда
		Наменование = СокрЛП(Наименование);
		Наименование = Лев(Наименование, СтрДлина(Наименование)-1);
	КонецЕсли;
КонецПроцедуры
