
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если Не ОбменДанными.Загрузка тогда
		Если Отбор.Найти("Контрагент")=Неопределено Тогда
			Возврат;
		Иначе
			текКонтрагент = Отбор.Контрагент.Значение;
		КонецЕсли;
		
		Запрос=Новый Запрос;
		Запрос.УстановитьПараметр("Контрагент",текКонтрагент);
		Запрос.Текст="ВЫБРАТЬ
		|	РегионыПартнера.Регион.Наименование КАК Наименование
		|ИЗ
		|	РегистрСведений.РегионыПартнера КАК РегионыПартнера
		|ГДЕ
		|	РегионыПартнера.Контрагент = &Контрагент";
		
		Выборка=Запрос.Выполнить().Выбрать();
		Стр="";
		Пока выборка.Следующий() Цикл
			Стр= Стр +?(Стр = "","",", ")+ Выборка.Наименование;
		КонецЦикла;	
		
		Запись = РегистрыСведений.РегионыПартнераПредставление.СоздатьМенеджерЗаписи();
		Запись.Партнер 	= текКонтрагент.Партнер;
		Запись.Контрагент 	= текКонтрагент;
		Запись.Регионы 	= Стр;
		
		Попытка
			
			Если ПустаяСтрока(Стр) Тогда 
				Запись.Удалить();
			Иначе
				Запись.Записать();
			КонецЕсли;
			
		Исключение
			стрОшибки = ОписаниеОшибки();
			ОбщиеФункции.СообщитьТекст("Ошибка при записи представления регионов контрагентаа
			|" + стрОшибки);
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры
