
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если ЗначениеЗаполнено(ПараметрКоманды) Тогда
		Если НЕ СоздатьБП(ПараметрКоманды) Тогда
			ПоказатьПредупреждение(,"Бизнес-процесс доставки уже запущен. Незачем запускать ещё один.");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СоздатьБП(ДокументОтгрузки)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ДоставкаЗаказа.Ссылка
	                      |ИЗ
	                      |	БизнесПроцесс.ДоставкаЗаказа КАК ДоставкаЗаказа
	                      |ГДЕ
	                      |	ДоставкаЗаказа.Стартован
	                      |	И НЕ ДоставкаЗаказа.Завершен
	                      |	И ДоставкаЗаказа.Заказ = &Заказ
	                      |	И ДоставкаЗаказа.ДокументОтгрузки = &ДокументОтгрузки");
	Запрос.УстановитьПараметр("Заказ",ДокументОтгрузки.Заказ);
	Запрос.УстановитьПараметр("ДокументОтгрузки",ДокументОтгрузки);
	Если Запрос.Выполнить().Пустой() Тогда
		БизнесПроцессы.ДоставкаЗаказа.СоздатьНовыйБП(ДокументОтгрузки.Заказ,ДокументОтгрузки);
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;
КонецФункции