
Процедура ПередЗаписью(Отказ)
	
	// уникальные должны быть диск карты
	
	Если 	Не ПометкаУдаления И
			Не ОбменДанными.Загрузка И
			ТипКарты = Перечисления.ТипыИнформационныхКарт.ДисконтнаяКарта И 
			ЗначениеЗаполнено(ВладелецКарты) Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 ИСТИНА ИЗ Справочник.ИнформационныеКарты ГДЕ ВладелецКарты = &Владелец И Ссылка <> &Ссылка И НЕ ПометкаУдаления");
		Запрос.УстановитьПараметр("Владелец", ВладелецКарты);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Если Не Запрос.Выполнить().Пустой() Тогда
			
			Отказ = Истина;
			ОбщиеФункции.СообщитьТекст(Строка(ВладелецКарты) + " уже имеет дисконтную карту"); КонецЕсли; КонецЕсли;
	
КонецПроцедуры
