
&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для каждого элемент Из Параметры.списокКонкурентов Цикл
		новСтрока = Конкуренты.Добавить();
		новСтрока.Конкурент = элемент.Значение;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	списокКонкурентов = Новый СписокЗначений;
	Для каждого лСтрока Из Конкуренты Цикл
		списокКонкурентов.Добавить(лСтрока.Конкурент);
	КонецЦикла;
	Закрыть(списокКонкурентов);
КонецПроцедуры
