&НаСервере
Процедура ОбновитьНоменклатуру()
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Номенклатура1.Артикул КАК Артикул,
	|	Номенклатура1 КАК Номенклатура,
	|	Номенклатура1.Производитель Производитель
	|ИЗ
	|	РегистрСведений.АналогиНоменклатуры
	|ГДЕ
	|	Номенклатура2 = &Ссылка
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Номенклатура2.Артикул,
	|	Номенклатура2,
	|	Номенклатура2.Производитель
	|ИЗ
	|	РегистрСведений.АналогиНоменклатуры
	|ГДЕ
	|	Номенклатура1 = &Ссылка
	|;
	
	|ВЫБРАТЬ
	|	Номенклатура1.Артикул КАК Артикул,
	|	Номенклатура1 КАК Номенклатура,
	|	Номенклатура1.Производитель Производитель
	|ИЗ
	|	РегистрСведений.СопутствующиеТовары
	|ГДЕ
	|	Номенклатура2 = &Ссылка
	|	
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ
	|	Номенклатура2.Артикул,
	|	Номенклатура2,
	|	Номенклатура2.Производитель
	|ИЗ
	|	РегистрСведений.СопутствующиеТовары
	|ГДЕ
	|	Номенклатура1 = &Ссылка
	|");
	
	Запрос.УстановитьПараметр("Ссылка", Номенклатура);
	Пакет = Запрос.ВыполнитьПакет();
	
	Аналоги.Загрузить(Пакет[0].Выгрузить());
	Сопутствующие.Загрузить(Пакет[1].Выгрузить());
	
КонецПроцедуры
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// информация о товаре
	РаботаСНоменклатурой.ДобавитьОперативнуюИнформациюОТоваре(ЭтаФорма);
	
	Если Не Параметры.Номенклатура.Пустая() Тогда
		
		Номенклатура = Параметры.Номенклатура;
		ОбновитьНоменклатуру();
		
	КонецЕсли;
	
КонецПроцедуры

// ИНФ О Товаре

&НаСервере
Процедура ОбработатьОтображениеИнформацииОТоваре() Экспорт
	
	Если имяТекСписка <> "" Тогда
		РаботаСНоменклатурой.ОбработатьОтображениеИнформацииОТоваре(ЭтаФорма, имяТекСписка, имяТекСписка);
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура АналогиПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Аналоги.ТекущиеДанные <> Неопределено Тогда
		имяТекСписка = Элемент.Имя;
		ОбработатьОтображениеИнформацииОТоваре();
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура СопутствующиеПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Аналоги.ТекущиеДанные <> Неопределено Тогда
		имяТекСписка = Элемент.Имя;
		ОбработатьОтображениеИнформацииОТоваре();
	КонецЕсли;
	
КонецПроцедуры
 &НаКлиенте
Процедура ПоказатьСкрытьИнфОТоваре(Команда)
	
	Если имяТекСписка <> "" Тогда
		РаботаСНоменклатуройКлиент.ПоказатьСкрытьИнфОТоваре(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура НастройкаИнфОТоваре(Команда) 
	
	Если имяТекСписка <> "" Тогда
		РаботаСНоменклатуройКлиент.НастройкаИнфОТоваре(ЭтаФорма, имяТекСписка, имяТекСписка);
	КонецЕсли;
	
КонецПроцедуры



// СОБЫТИЯ

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьНоменклатуру();
	
КонецПроцедуры
&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	ОбновитьНоменклатуру();
	
КонецПроцедуры
