
//&НаСервере
//Функция ПолучитьПараметрыДляТабличногоДокумента(Ссылки, СтрНомер)
//	
//	Возврат Заказы.ПолучитьПараметрыДляТабличногоДокумента(Ссылки, СтрНомер);
//	
//КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДок = Новый ТабличныйДокумент;
	Печать(ТабДок, ПараметрКоманды);

	ФункцииФормДокументов.УстановитьНастройкиТабличногоДокумента(ТабДок);
	
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	//ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;

	СтрНомера = "М11";
	//ДополнительныеПараметры = ПолучитьПараметрыДляТабличногоДокумента(ПараметрКоманды, СтрНомера);
	ОткрытьФорму("ОбщаяФорма.ТабличныйДокумент", Новый Структура("ТабличныйДокумент, ИмяФайла, ДополнительныеПараметры", ТабДок, СтрНомера, Неопределено),ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

&НаСервере
Процедура Печать(ТабДок, ПараметрКоманды)
	
	Инд = -1;
	Для Каждого Ссылка Из ПараметрКоманды Цикл
		Инд = Инд + 1; 
		Если Инд Тогда ТабДок.ВывестиГоризонтальныйРазделительСтраниц(); 
		КонецЕсли;
		
		Если	ТипЗнч(Ссылка) = Тип("ДокументСсылка.ВыдачаНаМОЛ") Тогда
			Документы.ВыдачаНаМОЛ.Печать_М11(ТабДок, Ссылка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры