
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Цены.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ДобавитьЦенуНаСервере(НоваяЦена)
	//				
	//Запись = РегистрыСведений.ТаможенныеЦены.СоздатьМенеджерЗаписи();
	//Запись.Период = ТекущаяДата();
	//Запись.НоменклатураДляТаможни = Объект.Ссылка;
	//Запись.ЦенаПоРиску = НоваяЦена;
	//	
	//Попытка
	//	Запись.Записать();
	//Исключение
	//	стрОшибки = ОписаниеОшибки();
	//	ОбщиеФункции.СообщитьТекст("Ошибка при записи новой цены номенклатуры для таможни
	//										|" + стрОшибки);
	//КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЦену(Команда)
	
	//НоваяЦена = 0;
	//
	//Если ВвестиЧисло(НоваяЦена, "Введите новую цену за кг", 10, 2) Тогда
	//
	//	ДобавитьЦенуНаСервере(НоваяЦена);
	//	
	//	Элементы.Цены.Обновить();
	//	
	//КонецЕсли;

КонецПроцедуры
