//+Андриянов 06.06.2017 - меняем условия контроля, так как работают неправильно

//Функция РедактированиеДокументаЗапрещеноФорма(ДокументОбъект) 
//	
//	Возврат 	Не ПараметрыСеанса.КонтрольОстатковВСеансеОтключен И
//				Не РольДоступна("РедактированиеДокументовЗапрещенныхПоДате") И
//				ДокументОбъект.Дата < КонецДня(Константы.ДатаЗапретаРедактированияДокументов.Получить());
//КонецФункции

//Функция РедактированиеДокументаЗапрещено(ДокументОбъект) 
//	
//	Возврат 	Не ПараметрыСеанса.КонтрольОстатковВСеансеОтключен И
//				Не РольДоступна("РедактированиеДокументовЗапрещенныхПоДате") И
//				Не ДокументОбъект.ОбменДанными.Загрузка И
//				ДокументОбъект.Дата < КонецДня(Константы.ДатаЗапретаРедактированияДокументов.Получить());
//КонецФункции


Функция РедактированиеДокументаРазрешеноФорма(ДокументОбъект) 
	
	Возврат 	ПараметрыСеанса.КонтрольОстатковВСеансеОтключен Или
				РольДоступна("РедактированиеДокументовЗапрещенныхПоДате") Или
				ДокументОбъект.Дата >= КонецДня(Константы.ДатаЗапретаРедактированияДокументов.Получить());
КонецФункции

Функция РедактированиеДокументаРазрешено(ДокументОбъект) 
	
	Возврат 	ПараметрыСеанса.КонтрольОстатковВСеансеОтключен Или
				РольДоступна("РедактированиеДокументовЗапрещенныхПоДате") Или
				ДокументОбъект.ОбменДанными.Загрузка Или
				ДокументОбъект.Дата >= КонецДня(Константы.ДатаЗапретаРедактированияДокументов.Получить());
КонецФункции

Процедура ЗапретРедактированияПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	//+Андриянов 06.06.2017 - меняем условия контроля, так как работают неправильно
	//Если РедактированиеДокументаЗапрещено(Источник) Тогда
	Если НЕ РедактированиеДокументаРазрешено(Источник) Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Период документа закрыт для редактирования. Запись документа невозможна.");
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьРежимТолькоПросмотрПоДатеЗапрета(Форма) Экспорт
	
	//+Андриянов 06.06.2017 - меняем условия контроля, так как работают неправильно
	//Если РедактированиеДокументаЗапрещеноФорма(Форма.Объект) Тогда
	Если НЕ РедактированиеДокументаРазрешеноФорма(Форма.Объект) Тогда
		Форма.ТолькоПросмотр = Истина;
		
		МассивДоступныхГруппИКнопок = Новый Массив;
		МассивСкрываемыхГруппИКнопок = Новый Массив;
		
		Для Каждого ЭлементФормы из Форма.Элементы  Цикл
			Если ТипЗнч(ЭлементФормы) = Тип("ДекорацияФормы") Тогда
				Продолжить;
			Иначе	
				ЭлементФормы.Доступность = Ложь;
				
				Если ЭлементФормы.Имя = "ФормаКоманднаяПанель" Тогда
					МассивДоступныхГруппИКнопок.Добавить(ЭлементФормы); 
				ИначеЕсли ЭлементФормы.Имя = "ФормаПечать" Тогда
					МассивДоступныхГруппИКнопок.Добавить(ЭлементФормы);
					Для Каждого КнопкаПечать из ЭлементФормы.ПодчиненныеЭлементы Цикл
						МассивДоступныхГруппИКнопок.Добавить(КнопкаПечать);
					КонецЦикла;
				ИначеЕсли ЭлементФормы.Имя = "ГруппаГлобальныхКнопок" Тогда
					МассивДоступныхГруппИКнопок.Добавить(ЭлементФормы);
				ИначеЕсли ЭлементФормы.Имя = "ИзменитьРеквизиты" Тогда
					МассивСкрываемыхГруппИКнопок.Добавить(ЭлементФормы);
				ИначеЕсли ЭлементФормы.Имя = "ПерейтиНаБизнесПроцесс" Тогда
					МассивСкрываемыхГруппИКнопок.Добавить(ЭлементФормы);
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ЭлементМассива из МассивДоступныхГруппИКнопок Цикл
			ЭлементМассива.Доступность = Истина;	
		КонецЦикла;
		
		Для Каждого ЭлементМассива из МассивСкрываемыхГруппИКнопок Цикл
			ЭлементМассива.Видимость = Ложь;	
		КонецЦикла;
		
		//Форма.Доступность = Ложь;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Период документа закрыт для редактирования. Документ открыт только для просмотра.");
	КонецЕсли;
	
КонецПроцедуры
