
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Струк = ПолучитьРасшифровкуНаСервере(Расшифровка);
	
	Если Струк = Неопределено Тогда Возврат; КонецЕсли;
	
    СтандартнаяОбработка = Ложь;
	
	ПользовательскиеНастройки = ПолучитьПользовательскиеНастройкиОтчета("АнализЗадолженностиПоОтгрузкам");
    УстановитьЗначениеПользовательскойНастройки(ПользовательскиеНастройки,	"Заказ" , Струк.Заказ, Струк.ЗаказИспользование);
    УстановитьЗначениеПользовательскойНастройки(ПользовательскиеНастройки,	"Контрагент" , Струк.Контрагент, Струк.КонтрагентИспользование);
	
    ПараметрыФормыХ = Новый Структура("СформироватьПриОткрытии, Отбор, ПользовательскиеНастройки, КлючВарианта", Истина, , ПользовательскиеНастройки, "ДляРасшифровки");

    ОткрытьФорму("Отчет.АнализЗадолженностиПоОтгрузкам.Форма", ПараметрыФормыХ, ЭтаФорма);	

КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьЗначениеПользовательскойНастройки(Настройки, Имя, Значение, Использование = Истина)
    Для Каждого Элемент Из Настройки.Элементы Цикл
        Если ТипЗнч(Элемент) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
            Если Строка(Элемент.Параметр) = Имя Тогда
                Элемент.Значение = Значение;
                Элемент.Использование = Использование;
            КонецЕсли;
        КонецЕсли;
    КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПользовательскиеНастройкиОтчета(ИмяОтчета)
    Возврат Отчеты[ИмяОтчета].Создать().КомпоновщикНастроек.ПользовательскиеНастройки;
КонецФункции

&НаСервере
Функция ПолучитьРасшифровкуНаСервере(Расшифровка)

   Данные = ПолучитьИзВременногоХранилища(ДанныеРасшифровки); 

   Поля = Данные.Элементы.Получить(Расшифровка).ПолучитьПоля(); 
   ПолеЗаказ = Поля.Найти("Заказ");
   ПолеКонтрагент = Поля.Найти("Контрагент");
   
   Струк=Новый Структура();
   Если НЕ ПолеЗаказ = Неопределено  Тогда
	   Струк.Вставить("Заказ",ПолеЗаказ.Значение);
	   Струк.Вставить("Контрагент",ПолеЗаказ.Значение.Контрагент);
	   Струк.Вставить("ЗаказИспользование",Истина);
	   Струк.Вставить("КонтрагентИспользование",Истина);
   ИначеЕсли НЕ ПолеКонтрагент = Неопределено  Тогда
	   Струк.Вставить("Заказ",Неопределено);
	   Струк.Вставить("Контрагент",ПолеКонтрагент.Значение);
	   Струк.Вставить("ЗаказИспользование",Ложь);
	   Струк.Вставить("КонтрагентИспользование",Истина);
   Иначе
	   Возврат Неопределено;
   КонецЕсли;
   
   Возврат Струк;
   
КонецФункции



