
&НаСервере
Процедура ОтправитьНаСервере()
	
	КодОтвета = 0; ПояснениеОтвета = "";
	
	ПараметрыURL = Новый Соответствие;
	Если Не ПустаяСтрока(guid) Тогда ПараметрыURL.Вставить("guid", guid) КонецЕсли;
	ПараметрыURL.Вставить("site", 				Сайт);
	ПараметрыURL.Вставить("order", 				XMLСтрока(Заказ));
	ПараметрыURL.Вставить("user", 				XMLСтрока(Пользователь));
	ПараметрыURL.Вставить("address", 			XMLСтрока(АдресДоставки));
	ПараметрыURL.Вставить("id_begin", 			НомНачала);
	ПараметрыURL.Вставить("id_end", 			НомОкончания);
	ПараметрыURL.Вставить("product", 			XMLСтрока(Товар));
	ПараметрыURL.Вставить("category", 			XMLСтрока(Категория));
	ПараметрыURL.Вставить("document",		 	XMLСтрока(Инструкция));
	ПараметрыURL.Вставить("article", 			XMLСтрока(Статья));
	ПараметрыURL.Вставить("article_category", 	XMLСтрока(КатегорияСтатьи));
	ПараметрыURL.Вставить("warehouse", 			XMLСтрока(Склад));
	ПараметрыURL.Вставить("page_property", 		XMLСтрока(СтраницаСвойств));
	
	Запрос = Новый Структура("ПараметрыURL", ПараметрыURL);
								
	Попытка		Ответ = Вычислить("Rest." + Метод + "(Запрос, ТелоЗапроса)");
	Исключение	ТелоОтвета 		= ОписаниеОшибки(); 
				КодОтвета 		=  700;
				ПояснениеОтвета =  "Ошибка в попытке"; 
				Возврат; КонецПопытки;
	
	КодОтвета 		=  Ответ.КодСостояния;
	ПояснениеОтвета =  Ответ.Причина;
	
	ТелоОтвета = Ответ.ПолучитьТелоКакСтроку();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Заполним сайты
	
	Элементы.Сайт.СписокВыбора.ЗагрузитьЗначения(КэшируемыеФункции.ПолучитьМассивСайтовНоменклатуры());
	
	// Заполним методы
	
	Мета = Метаданные.HTTPСервисы.API_сайт;
	Для Каждого МетаШаблон ИЗ Мета.ШаблоныURL Цикл
		Для Каждого МетаМетод Из МетаШаблон.Методы Цикл
		
			Элементы.Метод.СписокВыбора.Добавить(МетаМетод.Обработчик, МетаШаблон.Имя + " -> " + МетаМетод.HTTPМетод + " (" + МетаМетод.Имя + ")"); КонецЦикла; КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКартинкуНаСервере()
	
	Ответ = Rest.ПолучитьКартинку(нОВЫЙ Структура("ПараметрыURL", Новый Структура("site, image", Сайт, XMLСтрока(КартинкаНоменклатуры))), ТелоЗапроса);
	КодОтвета 		=  Ответ.КодСостояния;
	ПояснениеОтвета =  Ответ.Причина;
	
	Если КодОтвета = 200 Тогда
		Возврат ПоместитьВоВременноеХранилище(ПоместитьВоВременноеХранилище(Ответ.ПолучитьТелоКакДвоичныеДанные(), УникальныйИдентификатор)) КонецЕсли;
	
КонецФункции
&НаКлиенте
Процедура Отправить(Команда)
	
	Элементы.КартинкаТела.Видимость = Ложь;
	Элементы.ТелоОтвета.Видимость 	= Истина;
	
	Если ПустаяСтрока(Метод) Тогда
		
		ПоказатьПредупреждение(,"Не выбран метод");
		
	ИначеЕсли Метод	= "ПолучитьКартинку" Тогда
		
		текВр 		= ТекущаяУниверсальнаяДатаВМиллисекундах();
		Адрес 		= ПолучитьКартинкуНаСервере();
		ВремяРаботы = ТекущаяУниверсальнаяДатаВМиллисекундах() - текВр;
			
		Если Адрес <> Неопределено Тогда
			КартинкаТела = Адрес;
			Элементы.КартинкаТела.Видимость = Истина;
			Элементы.ТелоОтвета.Видимость 	= Ложь; КонецЕсли;
	Иначе
		
		текВр = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ОтправитьНаСервере(); 
		ВремяРаботы = ТекущаяУниверсальнаяДатаВМиллисекундах() - текВр; КонецЕсли;
	
КонецПроцедуры

