
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПоказатьПредупреждение(,"Эээ... Возможно это не работает (",10,"Филосов");
	Возврат;
	
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
		Колво = ПараметрКоманды.Количество();
		Шаг = 100/Колво;
		Ид = 0;
		Для Каждого Ссылка Из ПараметрКоманды Цикл Ид = Ид+Шаг;
			ЗаполнитьТЧРезервы(Ссылка);	
			Состояние("Идет перезаполнение резервов", Ид, Строка(Ссылка));
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗаполнитьТЧРезервы(Знач Ссылка)
	
	Запрос = Новый Запрос("ВЫБРАТЬ Размещение, Номенклатура, ЦенаЗаказа Цена,
	|Количество, СуммаЗаказа Сумма, Упаковка, СтавкаНДСЗаказа СтавкаНДС, 
	|Очередь, ПроцентАвтоматическойСкидки, ПроцентРучнойСкидки
	|ИЗ Документ.ПоступлениеТоваров.Товары ГДЕ Ссылка = &Ссылка И Размещение <> Неопределено И Очередь <> 0
	|;
	|ВЫБРАТЬ
	|	Ячейка,
	|	Номенклатура,
	|	Упаковка,
	|	Цена,
	|	Заказ,
	|	Инвойс,
	|	СтавкаНДС,
	|	СтранаПроисхождения,
	|	НомерГТД,
	|" + Заказы.ПолучитьСуммуНДСВЗапросе("","","Ссылка",Истина) + " СуммаНДС,	
	|	СУММА(Количество)	КАК Количество,
    |	СУММА(Сумма)		КАК Сумма
	|ИЗ
	|	Документ.ПоступлениеТоваров.Товары
	|ГДЕ
	|	Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Ссылка,
	|	Ячейка,
	|	Заказ,
	|	Инвойс,
	|	Номенклатура,
	|	Упаковка,
	|	Цена,
	|	СтавкаНДС,
	|	СтранаПроисхождения,
	|	НомерГТД");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Док = Ссылка.ПолучитьОбъект();
	Рез = Запрос.ВыполнитьПакет();
	Док.Резервы.Загрузить(Рез[0].Выгрузить());
	Док.Товары.Загрузить(Рез[1].Выгрузить());
	Попытка
		Док.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
КонецФункции
