
// Обработчик регламентного задания по загрузке курса валют
//
Процедура ЗагрузитьАктуальныйКурс() Экспорт
	
	ЗаписьЖурналаРегистрации("Загрузка курсов валют",
	                         УровеньЖурналаРегистрации.Информация, , ,
	                         НСтр("ru = 'Начата регламентная загрузка курсов валют'"));
	
	СообщениеОбОшибке = "";
	
	ОбработкаЗагрузкиКурсовВалют = Обработки.КурсыВалютРБК.Создать();
	ОбработкаЗагрузкиКурсовВалют.НачалоПериодаЗагрузки = ТекущаяДата();
	ОбработкаЗагрузкиКурсовВалют.ОкончаниеПериодаЗагрузки = ТекущаяДата();
	ОбработкаЗагрузкиКурсовВалют.ЗаполнитьСписокВалют();
	СтатусОперации = ОбработкаЗагрузкиКурсовВалют.ЗагрузитьКурсыВалют(СообщениеОбОшибке);
	Если СтатусОперации Тогда
		ЗаписьЖурналаРегистрации("Загрузка курсов валют",
		                         УровеньЖурналаРегистрации.Информация, , ,
		                         НСтр("ru = 'Закончена регламентная загрузка курсов валют'"));
	Иначе
		ЗаписьЖурналаРегистрации("Загрузка курсов валют",
		                         УровеньЖурналаРегистрации.Ошибка, , ,
		                         НСтр("ru = 'Во время регламентного задания загрузки курсов валют произошла ошибка.'")
		                         + Символы.ПС + СообщениеОбОшибке);
	КонецЕсли;
	
КонецПроцедуры
