
&НаСервере
Функция ПолучитьСсылкиНаФайлыВБазе(Ссылки)
	
	//Запрос = Новый Запрос("ВЫБРАТЬ ВЫБОР КОГДА КопияКартинки = &ПустаяКартинка ТОГДА Ссылка ИНАЧЕ КопияКартинки КОНЕЦ КАК Ссылка, Наименование, Картинка ИЗ Справочник.КартинкиНоменклатуры ГДЕ Владелец В(&Ссылки) И КопияКартинки = &ПустаяКартинка И Не ПометкаУдаления");
	//
	//Запрос.УстановитьПараметр("Ссылки", 		Ссылки);
	//Запрос.УстановитьПараметр("ПустаяКартинка", Справочники.КартинкиНоменклатуры.ПустаяСсылка());
	//
	//Массив 	= Новый Массив;
	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	Если Выборка.Картинка.Получить() <> Неопределено Тогда
	//		Массив.Добавить(Новый Структура("Ссылка, Наименование", Выборка.Ссылка, Выборка.Наименование)); КонецЕсли; КонецЦикла;
	//
	//Возврат Массив;
	
КонецФункции
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ДиалогиСПользователем.ВыгрузитьКартинкиНоменклатурыНаДиск(ПараметрКоманды);
	
	//// Получим ссылки на картинки
	//
	//МассивФайлов 	= Новый Массив;
	//текКартинки 	= ПолучитьСсылкиНаФайлыВБазе(ПараметрКоманды);
	//Для КАждого Картинка Из текКартинки Цикл МассивФайлов.Добавить(Новый ОписаниеПередаваемогоФайла(Картинка.Наименование, ПолучитьНавигационнуюСсылку(Картинка.Ссылка, "Картинка"))); КонецЦикла;
	//
	//Если МассивФайлов.Количество() Тогда
	//
	//	// Выгрузим
	//	
	//	Если ПолучитьФайлы(МассивФайлов,,, Истина) Тогда ПоказатьПредупреждение(,"ru = 'Выбранные картинки выгруженны!'; de='Bilder gespeichert!';"); КонецЕсли;
	//	
	//Иначе ПоказатьПредупреждение(,НСтр("ru = 'Картинок не обнаружено'; de='Bilder nicht gefunden';") КонецЕсли;
	
КонецПроцедуры
