Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос(
	
	КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() + "
														
	|;
	|ВЫБРАТЬ 	СкладОтправитель, СкладПолучатель, Контрагент
	|ИЗ 		Документ.СписаниеСТаможенногоСклада
	|ГДЕ		Ссылка = &Ссылка
	|;
	
	// Товары на складах
	
	|ВЫБРАТЬ
	|	&Период					Период,
	|	&ВидДвиженияПриход		ВидДвижения,
	|	Ссылка.СкладПолучатель	Склад,
	|	Номенклатура,
	|	СУММА(ВЫБОР КОГДА Упаковка = &ПустаяУпаковка 
	|		ТОГДА Количество
	|		ИНАЧЕ Количество * Упаковка.Коэффициент КОНЕЦ) Количество
    |ИЗ
	|	Документ.СписаниеСТаможенногоСклада.Товары
	|
	|ГДЕ Ссылка = &Ссылка И Номенклатура.ТипНоменклатуры <> &Услуга
	|СГРУППИРОВАТЬ ПО Ссылка, Номенклатура, Упаковка, Цена
	|;
	
	// Взвиморасчеты
	
	|ВЫБРАТЬ
	|	&Период				AS Период,
	|	&ВидДвиженияПриход	ВидДвижения,
	|	Партнер				Партнер,
	|	Контрагент			Контрагент,
	|	Организация			Организация,
	|	ЗНАЧЕНИЕ(Перечисление.ФормаОтношений.Клиент) 	ФормаОтношений,
	|	Сумма				Сумма,
	|   Сумма * (ЕСТЬNULL(ВалЦен.Курс, 1) * ЕСТЬNULL(ВалУпр.Кратность, 1)) / (ЕСТЬNULL(ВалУпр.Курс, 1) * ЕСТЬNULL(ВалЦен.Кратность, 1)) СуммаУпр
	|ИЗ
	|	Документ.СписаниеСТаможенногоСклада Док
	|
	|	ЛЕВОЕ СОЕДИНЕНИЕ 	РегистрСведений.КурсыВалют.СрезПоследних(, ) ВалЦен
	|	ПО 					Док.Ссылка.Валюта = ВалЦен.Валюта
	|	ЛЕВОЕ СОЕДИНЕНИЕ 	РегистрСведений.КурсыВалют.СрезПоследних(, Валюта В (ВЫБРАТЬ Значение ИЗ Константа.ВалютаУправленческогоУчета)) ВалУпр ПО ИСТИНА
	|
	|ГДЕ Ссылка = &Ссылка И Ссылка.Операция = &ОперацияПродажа;
		
	// Продажи
	
	|ВЫБРАТЬ
	|	&Период					КАК Период,
	|	Ссылка.СкладОтправитель	КАК Склад,
	|	Ссылка.Партнер			КАК Партнер,
	|	Ссылка.Контрагент		КАК Контрагент,
	|	Номенклатура,
	|	Упаковка,
	|	Ссылка				ДокументПродажи,
	|	СУММА(Количество) 	Количество,
	|	СУММА(СуммаПартии) 	Себестоимость,
	|	ВЫБОР 
	|		КОГДА Ссылка.СуммаВключаетНДС 
	|		ТОГДА СУММА(Сумма)		
	|		ИНАЧЕ СУММА(Сумма) + СУММА(СуммаНДС)  КОНЕЦ	Сумма
	|ИЗ
	|	Документ.СписаниеСТаможенногоСклада.Товары
	|
	|ГДЕ Ссылка = &Ссылка И Ссылка.Операция = &ОперацияПродажа
	|СГРУППИРОВАТЬ ПО Ссылка, Номенклатура, Упаковка
	|;
	
	  	
	// Ячейки
	
	|ВЫБРАТЬ
	|	&Период				Период,
	|	&ВидДвиженияРасход	ВидДвижения,
	|	ЯчейкаОтправитель 	Ячейка,
	|	Номенклатура,
	|	СУММА(ВЫБОР КОГДА Упаковка = &ПустаяУпаковка 
	|		ТОГДА Количество
	|		ИНАЧЕ Количество*Упаковка.Коэффициент КОНЕЦ) Количество
    |ИЗ
	|	Документ.СписаниеСТаможенногоСклада.Товары
	|
	|ГДЕ Ссылка = &Ссылка И ЯчейкаОтправитель.Владелец = Ссылка.СкладОтправитель
	|СГРУППИРОВАТЬ ПО ЯчейкаОтправитель, Номенклатура, Упаковка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период				Период,
	|	&ВидДвиженияПриход	ВидДвижения,
	|	ЯчейкаПолучатель 	Ячейка,
	|	Номенклатура,
	|	СУММА(ВЫБОР КОГДА Упаковка = &ПустаяУпаковка 
	|		ТОГДА Количество
	|		ИНАЧЕ Количество*Упаковка.Коэффициент КОНЕЦ) Количество
    |ИЗ
	|	Документ.СписаниеСТаможенногоСклада.Товары
	|
	|ГДЕ Ссылка = &Ссылка И ЯчейкаПолучатель.Владелец = Ссылка.СкладПолучатель
	|
	|СГРУППИРОВАТЬ ПО ЯчейкаПолучатель, Номенклатура, Упаковка;

	
	// Продажи по дисконтным картам
	
	|ВЫБРАТЬ
	|	&Период									 Период,
	|	Ссылка.ДисконтнаяКарта 					 ИнформационнаяКарта,
	|	Ссылка.ДисконтнаяКарта.ВладелецКарты  	 ВладелецКарты,
	|	ВЫБОР 
	|		КОГДА Ссылка.СуммаВключаетНДС 
	|		ТОГДА СУММА(Сумма)		
	|		ИНАЧЕ СУММА(Сумма) + СУММА(СуммаНДС) КОНЕЦ Сумма
	|ИЗ
	|	Документ.СписаниеСТаможенногоСклада.Товары
	|
	|ГДЕ
	|	Ссылка = &Ссылка И Ссылка.Операция = &ОперацияПродажа И Ссылка.ДисконтнаяКарта <> &ПустаяДисконтнаяКарта
	|
	|СГРУППИРОВАТЬ ПО
	|	Ссылка
	|;
	
	// Движение товара
	
	|ВЫБРАТЬ
	|	&Период							Период,
	|	&ВидДвиженияПриход				ВидДвижения,
	|	&СкладПолучатель 				Склад,
	|	Номенклатура,
	|	Упаковка,
	|	СУММА(ВЫБОР КОГДА Упаковка = &ПустаяУпаковка 
	|		ТОГДА Количество
	|		ИНАЧЕ Количество*Упаковка.Коэффициент КОНЕЦ) Количество
	|ИЗ
	|	Документ.СписаниеСТаможенногоСклада.Товары
	|ГДЕ
	|	Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура,
	|	Упаковка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период							Период,
	|	&ВидДвиженияПриход				ВидДвижения,
	|	&СкладОтправитель 				Склад,
	|	Номенклатура,
	|	Упаковка,
	|	-СУММА(ВЫБОР КОГДА Упаковка = &ПустаяУпаковка 
	|		ТОГДА Количество
	|		ИНАЧЕ Количество*Упаковка.Коэффициент КОНЕЦ) Количество
	|ИЗ
	|	Документ.СписаниеСТаможенногоСклада.Товары
	|ГДЕ
	|	Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура,
	|	Упаковка;
	
	// ТОВАРЫ НА ТАМОЖНЕ
	
	|ВЫБРАТЬ
	|	&Период					Период,
	|	&ВидДвиженияРасход		ВидДвижения,
	|	Ссылка.СкладОтправитель	Склад,
	|	Ссылка.Валюта			Валюта,
	|	ПартияТаможни			Партия,
	|	Номенклатура,
	|	Упаковка,
	|	СУММА(ЦенаПартии * Количество) Сумма,
	|	СУММА(Количество) 	Количество,
	|	СУММА(
	|		ВЫБОР КОГДА Упаковка = &ПустаяУпаковка ТОГДА Количество
	|		ИНАЧЕ		Количество * Упаковка.Коэффициент КОНЕЦ) КоличествоУпр
    |ИЗ
	|	Документ.СписаниеСТаможенногоСклада.Товары
	|
	|ГДЕ
	|	Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Ссылка,
	|	ПартияТаможни,
	|	Номенклатура,
	|	Упаковка;
	
	//// Продажи
	//
	//|ВЫБРАТЬ
	//|	&Период					КАК Период,
	//|	Ссылка.СкладОтправитель Склад,
	//|	Ссылка					ДокументПродажи,
	//|	Номенклатура,
	//|	Упаковка,
	//|	СУММА(Количество) 	Количество,
	//|	СУММА(ВЫБОР 
	//|		КОГДА Ссылка.СуммаВключаетНДС 
	//|		ТОГДА Сумма		
	//|		ИНАЧЕ Сумма + СуммаНДС КОНЕЦ) Сумма
	//|ИЗ
	//|	Документ.СписаниеСТаможенногоСклада.Товары
	//|
	//|ГДЕ
	//|	Ссылка = &Ссылка
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Ссылка,
	//|	Номенклатура,	
	//|	Упаковка
	//|;

	// ПАРТИИ ТОВАРОВ
	
	|ВЫБРАТЬ
	|	&Период				КАК Период,
	|	&ВидДвиженияПриход	КАК ВидДвижения,
	|	Ссылка.СкладПолучатель Склад, Партия, Номенклатура,
	|	СУММА(СуммаПартии) Сумма,
	|	ВЫБОР КОГДА Упаковка = &ПустаяУпаковка ТОГДА
	|		СУММА(Количество)
	|	ИНАЧЕ
	|		СУММА(Количество*Упаковка.Коэффициент)
	|	КОНЕЦ				КАК Количество
	|ИЗ
	|	Документ.СписаниеСТаможенногоСклада.Товары
	|ГДЕ
	|	Ссылка = &Ссылка И СуммаПартии <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Ссылка, Партия, Номенклатура, Упаковка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период				КАК Период,
	|	&ВидДвиженияРасход	КАК ВидДвижения,
	|	Ссылка.СкладОтправитель Склад, Партия, Номенклатура,
	|	СУММА(СуммаПартии) Сумма,
	|	ВЫБОР КОГДА Упаковка = &ПустаяУпаковка ТОГДА
	|		СУММА(Количество)
	|	ИНАЧЕ
	|		СУММА(Количество*Упаковка.Коэффициент)
	|	КОНЕЦ				КАК Количество
	|ИЗ
	|	Документ.СписаниеСТаможенногоСклада.Товары
	|ГДЕ
	|	Ссылка = &Ссылка И СуммаПартии <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Ссылка, Партия, Номенклатура, Упаковка
	|;
	|");
	
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("Период", 			Ссылка.Дата);
	Запрос.УстановитьПараметр("СкладПолучатель",	Ссылка.СкладПолучатель);
	Запрос.УстановитьПараметр("СкладОтправитель",	Ссылка.СкладОтправитель);
	Запрос.УстановитьПараметр("ПустойСклад", 		Справочники.Склады.ПустаяСсылка());
	Запрос.УстановитьПараметр("ВидДвиженияРасход", 	ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("ВидДвиженияПриход", 	ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("Услуга", 			Перечисления.ТипыНоменклатуры.Услуга);
	Запрос.УстановитьПараметр("ПустаяЯчейка", 		Справочники.Ячейки.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяДисконтнаяКарта", 	Справочники.ИнформационныеКарты.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяУпаковка", 	Справочники.УпаковкиНоменклатуры.ПустаяСсылка());
	Запрос.УстановитьПараметр("Сумма", 				Ссылка.Сумма);
	Запрос.УстановитьПараметр("Организация", 		Ссылка.Организация);
	Запрос.УстановитьПараметр("Контрагент", 		Ссылка.Контрагент);
	Запрос.УстановитьПараметр("Партнер", 			Ссылка.Партнер);
	Запрос.УстановитьПараметр("Дата", 				Ссылка.Дата);
	Запрос.УстановитьПараметр("ОперацияПродажа", 	Перечисления.ОперацияТаможенногоСписания.ЭтоПродажа);
	
	Запрос.УстановитьПараметр("ВидОперацииОплата", 	Перечисления.ВидыОперацийВзаиморасчетов.Отгрузка);
	Запрос.УстановитьПараметр("ФормаОтношений", 	Перечисления.ФормаОтношений.Клиент);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	// Воткнем в структуру
	
	ДополнительныеСвойства.Вставить("ПараметрыСистемы", КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[0].Выгрузить()));
	ДополнительныеСвойства.Вставить("Шапка", 			КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[2].Выгрузить()));
		
	ДополнительныеСвойства.Вставить("ТоварыНаСкладах", 			Пакет[2].Выгрузить());
	ДополнительныеСвойства.Вставить("Взаиморасчеты", 			Пакет[3].Выгрузить());
	ДополнительныеСвойства.Вставить("Продажи", 					Пакет[4].Выгрузить());
	ДополнительныеСвойства.Вставить("ТоварыВЯчейках",			Пакет[5].Выгрузить());
	ДополнительныеСвойства.Вставить("ПродажиПоДисконтнымКартам",Пакет[6].Выгрузить());
	ДополнительныеСвойства.Вставить("ДвижениеТовара",			Пакет[7].Выгрузить());
	ДополнительныеСвойства.Вставить("ТоварыНаТаможне",			Пакет[8].Выгрузить());
	//ДополнительныеСвойства.Вставить("Продажи",					Пакет[9].Выгрузить());
	ДополнительныеСвойства.Вставить("ПартииТоваров",			Пакет[9].Выгрузить());
		
КонецПроцедуры

Процедура ПроверитьПартииТаможни(Ссылка,Отказ) Экспорт
//Проверяем ПартииТаможни	
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		                      |	СписаниеСТаможенногоСкладаТовары.Номенклатура,
		                      |	МАКСИМУМ(СписаниеСТаможенногоСкладаТовары.ПартияТаможни.Дата) КАК ПартияТаможниДата
		                      |ПОМЕСТИТЬ СписокНоменклатуры
		                      |ИЗ
		                      |	Документ.СписаниеСТаможенногоСклада.Товары КАК СписаниеСТаможенногоСкладаТовары
		                      |ГДЕ
		                      |	СписаниеСТаможенногоСкладаТовары.Ссылка = &Ссылка
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	СписаниеСТаможенногоСкладаТовары.Номенклатура
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ТоварыНаТаможнеОстатки.Партия КАК ПартияТаможни,
		                      |	ТоварыНаТаможнеОстатки.Номенклатура КАК Номенклатура
		                      |ПОМЕСТИТЬ СписокПартий
		                      |ИЗ
		                      |	РегистрНакопления.ТоварыНаТаможне.Остатки(
		                      |			&Дата,
		                      |			Склад = &Склад
		                      |				И Номенклатура В
		                      |					(ВЫБРАТЬ
		                      |						СписокНоменклатуры.Номенклатура
		                      |					ИЗ
		                      |						СписокНоменклатуры КАК СписокНоменклатуры)) КАК ТоварыНаТаможнеОстатки
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокНоменклатуры КАК СписокНоменклатуры
		                      |		ПО ТоварыНаТаможнеОстатки.Номенклатура = СписокНоменклатуры.Номенклатура
		                      |			И ТоварыНаТаможнеОстатки.Партия.Дата <= СписокНоменклатуры.ПартияТаможниДата
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	СписаниеСТаможенногоСкладаТовары.ПартияТаможни КАК ПартияТаможни1,
		                      |	СписокПартий.Номенклатура,
		                      |	СписокПартий.ПартияТаможни
		                      |ИЗ
		                      |	СписокПартий КАК СписокПартий
		                      |		ПОЛНОЕ СОЕДИНЕНИЕ Документ.СписаниеСТаможенногоСклада.Товары КАК СписаниеСТаможенногоСкладаТовары
		                      |		ПО СписокПартий.Номенклатура = СписаниеСТаможенногоСкладаТовары.Номенклатура
		                      |			И (СписаниеСТаможенногоСкладаТовары.Ссылка = &Ссылка)
		                      |			И СписокПартий.ПартияТаможни = СписаниеСТаможенногоСкладаТовары.ПартияТаможни
		                      |ГДЕ
		                      |	СписаниеСТаможенногоСкладаТовары.ПартияТаможни ЕСТЬ NULL ");
		
		Запрос.УстановитьПараметр("Дата", 			Ссылка.МоментВремени());
		Запрос.УстановитьПараметр("Склад", 			Ссылка.СкладОтправитель);
		Запрос.УстановитьПараметр("Ссылка", 		Ссылка);
		
			
	Выполнение = Запрос.Выполнить();
	Если Не Выполнение.Пустой() Тогда
		
		Отказ = Истина;
		
		Выборка = Выполнение.Выбрать();
		Пока Выборка.Следующий() Цикл

		 	ОбщиеФункции.СообщитьТекст(НСтр("ru = 'Партии таможни заполненны не верно! '; de = 'Gefüllt Partie ist nicht wahr! '") + Выборка.Номенклатура);
			
		КонецЦикла;
	КонецЕсли;

	  
КонецПроцедуры