Функция ПолучитьСкладСписания() Экспорт Возврат СкладОтправитель КонецФункции
Функция ПолучитьТекстЗапросаПолученияСпискаТоваров() Экспорт
	
	Возврат "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура
	|ИЗ
	|	Документ.СписаниеСТаможенногоСклада.Товары
	|ГДЕ
	|	Ссылка = &ДокументСсылка
	|";
	
КонецФункции
Функция ПолучитьТекстЗапросаПолученияСпискаТоваровВЯчейках() Экспорт
	
	Возврат "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура
	|ИЗ
	|	Документ.СписаниеСТаможенногоСклада.Товары
	|ГДЕ
	|	Ссылка = &ДокументСсылка И
	|	Ячейка <> &ПустаяЯчейка
	|";
	
КонецФункции

// ПРЕДОПРЕДЕЛЕННЫЕ ФУНКЦИИ

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	 			
	// Подготовка
	
	Заголовок = КонтрольПроведения.ПолучитьСтандарнтыйЗаголовокПриПроведенииДокумента(Ссылка);
	
	Документы[Метаданные().Имя].ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Последовательности
	
	//avdonin {{12.09.2010#
	ПроведенияДокументов.ПоследовательностьОстаткиТоваров(ДополнительныеСвойства, ПринадлежностьПоследовательностям, Отказ);
	//}}avdonin
	
	// Проведение
	Документы.СписаниеСТаможенногоСклада.ПроверитьПартииТаможни(Ссылка,Отказ); 
	ПроведенияДокументов.ПровестиПоВсемРегистрам(Метаданные().Движения, ДополнительныеСвойства, Движения, Отказ);
		                                    
	// Запись
	
	Движения.Записать();
	
	// Контроль
	
	КонтрольПроведения.ПроверитьПоВсемРегистрам(ЭтотОбъект, Отказ, Заголовок);
	
	//КонтрольПроведения.ПроверитьТоварыВЯчейках(ЭтотОбъект, СкладОтправитель, Отказ, Заголовок);
	//КонтрольПроведения.ПроверитьТоварыНаТаможне(ЭтотОбъект, СкладОтправитель, Отказ, Заголовок);
		
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Подготовка

	Заголовок = КонтрольПроведения.ПолучитьСтандарнтыйЗаголовокПриОтменеПроведенияДокумента(Ссылка);
	
	//avdonin {{12.09.2010#
	// надо опять инициализировать доп. свойства для контроля остатка (чтобы тянуть информацию только по тем остаткам, которые изменялись)
	// в контроле по идее имеет смысл указывать, что это отмена проведения или передавать движения
	Документы[Метаданные().Имя].ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства);
	//}}avdonin
	
	// Последовательности
	
	//avdonin {{12.09.2010#
	// последний параметр - признак отмены проведения
	ПроведенияДокументов.ПоследовательностьОстаткиТоваров(ДополнительныеСвойства, ПринадлежностьПоследовательностям, Отказ, Истина);
	//}}avdonin
	
	// Запись
	
	Движения.ТоварыНаСкладах.Очистить();
	Движения.Записать();
	
	// Контроль
	
	КонтрольПроведения.ПроверитьТоварыНаСкладах(ЭтотОбъект, СкладПолучатель, Отказ, Заголовок);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Сумма = Товары.Итог("Сумма") + ?(СуммаВключаетНДС,0,Товары.Итог("СуммаНДС"));
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ТипДанных = ТипЗнч(ДанныеЗаполнения);
	
	//Если ТипДанных = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
		
	//КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если СкладОтправитель.Ячеестый Тогда ПроверяемыеРеквизиты.Добавить("Товары.ЯчейкаОтправитель") КонецЕсли;
	Если СкладПолучатель.Ячеестый Тогда ПроверяемыеРеквизиты.Добавить("Товары.ЯчейкаПолучатель") КонецЕсли;
	
	Если Операция = Перечисления.ОперацияТаможенногоСписания.ЭтоПродажа Тогда
		
		ПроверяемыеРеквизиты.Добавить("Организация");
		ПроверяемыеРеквизиты.Добавить("Партнер");
		
	Иначе
		
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Организация"));
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("ТипЦен"));
		ПроверяемыеРеквизиты.Добавить("СкладПолучатель"); КонецЕсли;
	
	Если Не СкладОтправитель.Таможня Тогда ОбщиеФункции.СообщитьТекст("Склад отправитель должен быть таможенным!") КонецЕсли;
	Если СкладПолучатель.Таможня Тогда ОбщиеФункции.СообщитьТекст("Склад отправитель должен быть таможенным!") КонецЕсли;
	
КонецПроцедуры
