&НаКлиенте
Перем СтруктураКолонокТовары Экспорт;

&НаКлиенте
Процедура ОбщиеРеквизиты(Команда)
	
	ФункцииФормДокументов.ОткрытьОбщиеРеквизиты(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Функция СкладЯчеестый()
	
	Возврат Объект.СкладПолучатель.Ячеестый;
	
КонецФункции

&НаСервере
Процедура УправлениеВидимостьюДоступностью()
	
	//Элементы.ГруппаМахинаций.Доступность = Не Объект.Процесс.Пустая() И Не Объект.Процесс.ЗаказСобран;
	
КонецПроцедуры

// ПРЕДОПРЕДЕЛЕННЫЕ ПРОЦЕДУРЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Рассчитаем динамические колонки
	
	ФункцииФормДокументов.РассчитатьДинамическиеКолонки(
					Объект.Товары,
					ФункцииФормДокументов.ПолучитьСтруктуруКолонокТовары(Элементы.Товары));
					

	УправлениеВидимостьюДоступностью();
					
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Видимость ячеек
	
	Элементы.ТоварыЯчейка.Видимость = СкладЯчеестый();
	
	// Получим структуру колонок
	
	СтруктураКолонокТовары = ФункцииФормДокументов.ПолучитьСтруктуруКолонокТовары(Элементы.Товары);
	
КонецПроцедуры

// ОБРАБОТКИ ТАБЛИЧНОЙ ЧАСТИ

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент, КонкретнаяСтрока = Неопределено)

	ФункцииФормДокументов.НоменклатураПриИзменении(
				Элементы.Товары, 
				СтруктураКолонокТовары,
				КонкретнаяСтрока);

КонецПроцедуры
&НаКлиенте
Процедура КоличествоПриИзменении(Элемент, КонкретнаяСтрока = Неопределено)
	
	ФункцииФормДокументов.КоличествоПриИзменении(
				Элементы.Товары, 
				СтруктураКолонокТовары, 
				КонкретнаяСтрока);
	
КонецПроцедуры
&НаКлиенте
Процедура УпаковкаПриИзменении(Элемент)
	
	ФункцииФормДокументов.УпаковкаПриИзменении(
			Элементы.Товары, 
			СтруктураКолонокТовары);

КонецПроцедуры

// ПОДБОР

&НаСервере
Функция ПоместитьТоварыВХранилищеДляПодбора()
	
	стрОшибки = "";
	Адрес = ВременнаяТаблица.ПоместитьНоменклатуру(Объект.Товары.Выгрузить(,"Номенклатура, Количество"),,стрОшибки);
	
	Если Адрес = Неопределено Тогда
		ОбщиеФункции.СообщитьТекст(стрОшибки);
	КонецЕсли;
		
	Возврат Адрес;
	
КонецФункции
&НаКлиенте
Процедура ПодборВыполнить()
	
	АдресТоваровВХранилище = ПоместитьТоварыВХранилищеДляПодбора();
	
	Если АдресТоваровВХранилище <> Неопределено Тогда
	
		ФормаПодбора = ПолучитьФорму(
				"Справочник.Номенклатура.Форма.ФормаПодбора", 
				Новый Структура("АдресТоваровВХранилище, Склад", 
							АдресТоваровВХранилище, Объект.СкладОтправитель),
				Элементы.Товары);
				
		ФормаПодбора.ЗакрыватьПриВыборе = Ложь;
				
		ФормаПодбора.Открыть();
		
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ТоварыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Номенклатура") Тогда
		
		Номенклатура 	= ВыбранноеЗначение;
		Количество 		= 1;
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		Номенклатура 	= ВыбранноеЗначение.Номенклатура;
		Количество 		= ВыбранноеЗначение.Количество;
		
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	Строки = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", Номенклатура));
	
	Если Строки.Количество() Тогда
		
		Строка = Строки[0];
		
	Иначе
		
		Строка = Объект.Товары.Добавить();
		Строка.Номенклатура = Номенклатура;
		
	КонецЕсли;
	
	Строка.Количество = Строка.Количество + Количество;
	
	НоменклатураПриИзменении(Элемент, Строка);
	КоличествоПриИзменении(Элементы, Строка);
	
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьПоДокументу(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура СкладПолучательПриИзменении(Элемент)
	
	// Видимость ячеек
	
	Элементы.ТоварыЯчейка.Видимость = СкладЯчеестый();
	
КонецПроцедуры

