Функция Событие_ПисьмоОтправлено() Экспорт
	
	Возврат "ПисьмоОтправлено";
	
КонецФункции
Функция Событие_ПробитЧек() Экспорт
	
	Возврат "ПробитЧек";
	
КонецФункции
Функция Событие_ИзмениласьНаличность() Экспорт
	
	Возврат "ИзмениласьНаличность";
	
КонецФункции
Функция Событие_ЗаписанаЗадача() Экспорт
	
	Возврат "ЗаписанаЗадача";
	
КонецФункции
Функция Событие_ЗаписанБизнесПроцесс() Экспорт
	
	Возврат "ЗаписанБизнесПроцесс";
	
КонецФункции
Функция Событие_ЗаписанЗаказНаряд() Экспорт
	
	Возврат "ЗаписанЗаказНаряд";
	
КонецФункции
Функция Событие_ЗаписанаРеализация() Экспорт
	
	Возврат "ЗаписанаРеализация";
	
КонецФункции

Функция Событие_ЗаписанаЗакладакаЗадачи() Экспорт
	
	Возврат "Записана закаладка задачи";
	
КонецФункции
Функция Событие_ИзменилисьФильтрыЗакладокЗадач() Экспорт
	
	Возврат "Изменились фильтры закаладок задач";
	
КонецФункции

Функция Событие_ИзмениласьЗагрузкаАвтомобиля() Экспорт
	
	Возврат "ИзмениласьЗагрузкаАвтомобиля";
	
КонецФункции

Функция Событие_ИзменениеРасшифровкиНоменклатуры() Экспорт
	
	Возврат "ИзменениеРасшифровкиНоменклатуры";
	
КонецФункции

Функция Событие_ЗаписанКонтрагент() Экспорт
	
	Возврат "ЗаписанКонтрагент";
	
КонецФункции
Процедура ОповеститьОЗаписиКонтрагента(Контрагент) Экспорт
	
	Оповестить(
			Событие_ЗаписанКонтрагент(), 
			Новый Структура("Контрагент", Контрагент)
			);
	
КонецПроцедуры


Процедура ОповеститьОбОтправкеПисьма(Письмо, Источник = Неопределено) Экспорт
	
	Оповестить(
			Событие_ПисьмоОтправлено(), 
			Новый Структура("Ссылка",Письмо), Источник);
	
КонецПроцедуры

Процедура ОповеститьОПробитииЧека(ЧекСсылка) Экспорт
	
	Оповестить(
			Событие_ПробитЧек(), 
			Новый Структура("Ссылка",ЧекСсылка));
	
КонецПроцедуры
Процедура ОповеститьОЗаписиЗадачи(ЗадачаОбъект, ФормаЗадачи) Экспорт
	
	Оповестить(
			Событие_ЗаписанаЗадача(), 
			Новый Структура("Ссылка, БизнесПроцесс", 
				ЗадачаОбъект.Ссылка, 
				ЗадачаОбъект.БизнесПроцесс), 
			ФормаЗадачи);
	
		КонецПроцедуры
Процедура ОповеститьОЗаписиБизнесПроцесса(БизнесПроцессСсылка, ФормаПроцесса = Неопределено) Экспорт
	
	Оповестить(
			Событие_ЗаписанБизнесПроцесс(), 
			Новый Структура("Ссылка", 
				БизнесПроцессСсылка), 
			ФормаПроцесса);
	
		КонецПроцедуры
Процедура ОповеститьОЗаписиЗаказНаряда(ЗаказНарядОбъект, ФормаДокумента) Экспорт
	
	Оповестить(
			Событие_ЗаписанЗаказНаряд(), 
			Новый Структура("Ссылка", 
				ЗаказНарядОбъект.Ссылка), 
			ФормаДокумента);
	
КонецПроцедуры

Процедура ОповеститьОИзмененииЗагрузкиАвтомобиля(Автомобиль) Экспорт
	
	Оповестить(
			Событие_ИзмениласьЗагрузкаАвтомобиля(), 
			Новый Структура("Автомобиль", 
				Автомобиль));
	
КонецПроцедуры
			
			
Функция СобытиеИзмениласьОчередьСборкиЗаказа() Экспорт
	
	Возврат "Изменилась очередь сборки заказа";
				
КонецФункции	
Процедура ОповеститьОбИзмененииОчередиСборкиЗаказа(Заказ) Экспорт
	
	Оповестить(
			СобытиеИзмениласьОчередьСборкиЗаказа(), 
			Новый Структура("Заказ", 
				Заказ));
	
КонецПроцедуры