
Процедура ПриЗаписи(Отказ, Замещение)
	//Хозяин = ЭтотОбъект.Отбор.Ссылка.Значение;
	//Если ТипЗнч(Хозяин) = Тип("СправочникСсылка.Документация") Тогда
	//	
	//	Если ЭтотОбъект.Количество()>0 Тогда 
	//		Стр=ЭтотОбъект[0];
	//		ОписаниеСобытия = "загружен файл : "+Стр.Имя;
	//	Иначе	
	//		ОписаниеСобытия = "файл удален";
	//	КонецЕсли;	
	//	
	//	ДокументацияОбъект=Хозяин.ПолучитьОбъект();
	//	НовЗапись=ДокументацияОбъект.События.Добавить();
	//	НовЗапись.Дата = ТекущаяДата();
	//	НовЗапись.Событие = ОписаниеСобытия;
	//	
	//	ДокументацияОбъект.Записать();
	//	 
	//КонецЕсли;	 
	
КонецПроцедуры
