&НаСервере
Функция ПолучитьГуидНаСервере(ТекЭлементСсылка)
	
	Возврат XMLСтрока(ТекЭлементСсылка);
	
КонецФункции

Процедура ОбновитьКартинку()

	ТекЭлемент = Элементы.Список.ТекущаяСтрока;
	Если ТекЭлемент = Неопределено Тогда
	
		АдресКартинки 	= "";
		АдресАватара 	= "";
		guid			= "";
		
	Иначе
		
		АдресКартинки 	= ПолучитьНавигационнуюСсылку(ТекЭлемент.Ссылка, "Картинка");
		АдресАватара 	= ПолучитьНавигационнуюСсылку(ТекЭлемент.Ссылка, "Аватар");
		guid			= ПолучитьГуидНаСервере(ТекЭлемент.Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КартинкаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекЭлемент = Элементы.Список.ТекущаяСтрока;
	
	Если ТекЭлемент = Неопределено Тогда
		ПоказатьПредупреждение(,"Необходжимо выбрать элемент в списке!",,"Предупреждение");
		Возврат;
	КонецЕсли;
	
	// Выберем картинку
	
	ДВ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	Если ДВ.Выбрать() Тогда
		
		стрОшибки 	= "";
		ИмяФайла 	= Сред(ДВ.ПолноеИмяФайла, СтрДлина(ДВ.Каталог) + 1);
		
		Если Картинки.Обновить(Новый Картинка(ДВ.ПолноеИмяФайла), ТекЭлемент, Ложь, стрОшибки) Тогда
			
			ОбновитьКартинку();
			
		Иначе
			
			ОбщиеФункции.СообщитьТекст(стрОшибки);
			
		КонецЕсли;
	КонецЕсли;

	
КонецПроцедуры
&НаКлиенте
Процедура АватарНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекЭлемент = Элементы.Список.ТекущаяСтрока;
	
	Если ТекЭлемент = Неопределено Тогда
		ПоказатьПредупреждение(,"Необходжимо выбрать элемент в списке!",,"Предупреждение");
		Возврат;
	КонецЕсли;
	
	// Выберем картинку
	
	ДВ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	Если ДВ.Выбрать() Тогда
		
		стрОшибки 	= "";
		ИмяФайла 	= Сред(ДВ.ПолноеИмяФайла, СтрДлина(ДВ.Каталог) + 1);
		
		Если Картинки.Обновить(Новый Картинка(ДВ.ПолноеИмяФайла), ТекЭлемент, ,стрОшибки) Тогда
			
			ОбновитьКартинку();
			
		Иначе
			
			ОбщиеФункции.СообщитьТекст(стрОшибки);
			
		КонецЕсли;
	КонецЕсли;

	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Владелец");
	//ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Больше;
	//ЭлементОтбора.Использование 	= Истина;
	//ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	//ЭлементОтбора.ПравоеЗначение 	= Параметры.Владелец;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ОбновитьКартинку();
	
КонецПроцедуры

