
Функция ПолучитьТекстЗапросаПолученияСпискаТоваров() Экспорт
	
	Возврат "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура
	|ИЗ
	|	Документ.УстановкаЦенНоменклатурыКонкурентов.Товары
	|ГДЕ
	|	Ссылка = &ДокументСсылка
	|";
	
КонецФункции

Функция ПолучитьСтруктуруШапки()
	
	Возврат Новый Структура;
	
КонецФункции
Функция ПолучитьТаблицуТоваров()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	НомерСтроки,
	|	Док.Ссылка.Конкурент Конкурент,
	|	Док.Ссылка.Контрагент Контрагент,
	|	Номенклатура,
	|	Упаковка,
	|	Цена,
	|	ТипЦен,
	|	Валюта,
	|	Ссылка.Дата	КАК Период,
	|	Ссылка.Дата КАК ДатаПрайса
	|ИЗ
	|	Документ.УстановкаЦенНоменклатурыКонкурентов.Товары КАК Док
	|ГДЕ
	|	Док.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ДвиженияПоРегистрам(СтруктураШапки, ТаблицаТоваров, РежимПроведения, Отказ, Заголовок)
	
	// ТОВАРЫ НА СКЛАДАХ
	
	Таблица = Движения.ЦеныНоменклатурыКонкурентов.Выгрузить();
	Таблица.Очистить();
	
	Для КАждого СтрокаТоваров Из ТаблицаТоваров Цикл
		
		НовСтрока = Таблица.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаТоваров);
		Если НЕ ЗначениеЗаполнено(СтрокаТоваров.Валюта) Тогда
			НовСтрока.Валюта = СтрокаТоваров.ТипЦен.Валюта;
		КонецЕсли;
		НовСтрока.Активность = Истина;
		
	КонецЦИкла;
	
	Движения.ЦеныНоменклатурыКонкурентов.Загрузить(Таблица);
	Движения.ЦеныНоменклатурыКонкурентов.Записывать=Истина;
	//Движения.Записать();
	
КонецПроцедуры
 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Заголовок = "Проведение документа " + Ссылка;
	
	СтруктураШапки	= ПолучитьСтруктуруШапки();
	ТаблицаТоваров 	= ПолучитьТаблицуТоваров();
	
	Если НЕ Отказ Тогда
		ДвиженияПоРегистрам(СтруктураШапки, ТаблицаТоваров, РежимПроведения, Отказ, Заголовок);
	КонецЕсли;
	
КонецПроцедуры

