
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	// Вставить содержимое обработчика.
	
	//ОткрытьФорму(
	//	"КритерийОтбора.СвязанныеДокументы.ФормаСписка", 
	//	Новый Структура("ОбъектОтбора", ПараметрКоманды), 
	//	ПараметрыВыполненияКоманды.Источник, 
	//	ПараметрыВыполненияКоманды.Уникальность, 
	//	ПараметрыВыполненияКоманды.Окно);
	
	Если ЗначениеЗаполнено(ПараметрКоманды) Тогда

		ОткрытьФорму("ОбщаяФорма.ФормаСтруктурыПодчиненности",Новый Структура("ОбъектОтбора", ПараметрКоманды),
				ПараметрыВыполненияКоманды.Источник,
				ПараметрыВыполненияКоманды.Источник.КлючУникальности,
				ПараметрыВыполненияКоманды.Окно);

	КонецЕсли;
	
КонецПроцедуры
