
&НаСервере
Процедура ЗагрузитьHTML(ТекТовар)
	
	Структура = Новый Соответствие;
	
	Если ТекТовар.ЭтоГруппа Тогда
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ ПЕРВЫЕ 255 ВЫБОР КОГДА ЭтоГруппа ТОГДА ""[ "" + Наименование + "" ]"" ИНАЧЕ Артикул + "" "" + Наименование КОНЕЦ Наименование
		|ИЗ Справочник.Номенклатура
		|ГДЕ Родитель = &Родитель
		|");
		
		Запрос.УстановитьПараметр("Родитель", ТекТовар);
		
		Структура.Вставить(
			"[ " + ТекТовар.Наименование + " ]", 
			Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Наименование"));
		
	Иначе
	
		Запрос = Новый Запрос("
		|ВЫБРАТЬ *
		|ИЗ Справочник.Номенклатура
		|ГДЕ Ссылка = &Номенклатура
		|");
		
		Запрос.УстановитьПараметр("Номенклатура", ТекТовар);
	
		Выгрузка = Запрос.Выполнить().Выгрузить();
		
		Структура.Вставить(
			ТекТовар.Артикул + " " + ТекТовар.Наименование, 
			КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Выгрузка));
			
	КонецЕсли;
		
	ПолеHTML = JS.ПолучитьДеревоеHTMLПоСтруктуре(Структура);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	ТекТовар = Элементы.Список.ТекущаяСтрока;
	
	Если ТекТовар <> Неопределено Тогда
		
		ЗагрузитьHTML(ТекТовар);
		
	КонецЕсли;
	
КонецПроцедуры
