
&НаКлиенте
Процедура ДополнительныеРеквизиты(Команда)
		ФункцииФормДокументов.ОткрытьОбщиеРеквизиты(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРасшифровкуСуммы(Команда)
	ЗаполнитьРасшифровкуСуммыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасшифровкуСуммыНаСервере()
	
	Объект.РасшифровкаСуммы.Загрузить(Документы.ОплатаИмпорт.ЗаполнитьРасшифровкуСуммы(Объект.Дата, Объект.Сумма, Объект.СуммаУпр));		
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОплатыВручнуюНаСервере(стрВозврТабл)
	
	Объект.РасшифровкаСуммы.Очистить();
	Объект.РасшифровкаСуммы.Загрузить(ЗначениеИзСтрокиВнутр(стрВозврТабл));
	Коэффициент = Объект.СуммаУпр/Объект.Сумма;
	Для Каждого Строка Из Объект.РасшифровкаСуммы Цикл
		Строка.СуммаУпр = Коэффициент*Строка.Сумма; КонецЦикла;
		
КонецПроцедуры
&НаКлиенте
Процедура ЗаполнитьВручную(Команда)
	

	стрВозврТабл = ОткрытьФорму("Документ.ОплатаИмпорт.Форма.ФормаЗаполненияРасшифровки", 
			Новый Структура("ДокументОплаты, Сумма", 
					Объект.Ссылка, 
					Объект.Сумма),,,,,Новый ОписаниеОповещения("ОбработкаЗаполненияВручную",ЭтаФОрма,));

КонецПроцедуры
&НаКлиенте
Процедура ОбработкаЗаполненияВручную(Результат, Параметры) Экспорт
	Если Результат <> Неопределено Тогда
		ЗаполнитьОплатыВручнуюНаСервере(Результат);
		ПересчетатьДопрасходы();

	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаСуммыСуммаПриИзменении(Элемент)
	ТекДанные = Элементы.РасшифровкаСуммы.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		текДанные.СуммаУпр = текДанные.Сумма*Объект.СуммаУпр/Объект.Сумма; КонецЕсли; 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВручнуюНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Функция ПоместитьРасшифровкуВХранилище()
	Возврат ПоместитьВоВременноеХранилище(Объект.РасшифровкаСуммы.Выгрузить(), УникальныйИдентификатор);
КонецФункции

&НаКлиенте
Процедура ЗаполнитьВручную1(Команда)

	стрВозврТабл = ОткрытьФорму("Документ.ОплатаИмпорт.Форма.ФормаЗаполненияРасшифровки_нов", 
			Новый Структура("ДокументОплаты, Сумма, Контрагент, АдресТаблицы", 
					Объект.Ссылка, 
					Объект.Сумма, Объект.Контрагент, ПоместитьРасшифровкуВХранилище()),,,,,Новый ОписаниеОповещения("ОбработкаЗаполненияВручную",ЭтаФОрма,));

КонецПроцедуры

&НаКлиенте
Процедура РаспределитьДопрасходы(Команда)

	ПересчетатьДопрасходы();
	
КонецПроцедуры
&НаКлиенте
Процедура ПересчетатьДопрасходы(Коэфф = Неопределено, ТекСтрока = Неопределено)
	
	Если Коэфф = Неопределено Тогда               
		Коэфф = Объект.СуммаДопрасходов/Объект.Сумма; КонецЕсли;
	
	Для Каждого Строка Из Объект.РасшифровкаСуммы Цикл
		//Если ТекСтрока <> Неопределено И Объект.РасшифровкаСуммы.Индекс(Строка) = Объект.РасшифровкаСуммы.Индекс(Объект.РасшифровкаСуммы.НайтиПоИдентификатору(ТекСтрока)) Тогда Продолжить; КонецЕсли;
		Строка.СуммаДопрасхода = Строка.Сумма*Коэфф; КонецЦикла;
	
	Если Объект.РасшифровкаСуммы.Количество() Тогда
		Строка = Объект.РасшифровкаСуммы[0];
		Строка.СуммаДопрасхода = Строка.СуммаДопрасхода + Объект.СуммаДопрасходов - Объект.РасшифровкаСуммы.Итог("СуммаДопрасхода");
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СуммаДопрасходовПриИзменении(Элемент)
	
	ПересчетатьДопрасходы();
	
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаСуммыСуммаДопрасходаПриИзменении(Элемент)
	
	//ТекДанные = Элементы.РасшифровкаСуммы.ТекущиеДанные;
	//Если ТекДанные <> Неопределено Тогда
	//	ПересчетатьДопрасходы((Объект.СуммаДопрасходов - ТекДанные.СуммаДопрасхода)/(Объект.Сумма - ТекДанные.Сумма), Элементы.РасшифровкаСуммы.ТекущаяСтрока); 
	//КонецЕсли;
	
КонецПроцедуры
