
&НаСервере
Функция ПолучитьЗаказ(Реализация)
	
	Возврат Реализация.Заказ;
	
КонецФункции
&НаКлиенте
Процедура ВыборПакета(ВыбПакет, Реализации) Экспорт
	
	Если ВыбПакет <> Неопределено Тогда
		
		//Параметры = ПечатьНаСервере.ПолучитьПараметрыПакетаПоУмолчанию(ВыбПакет);
		
		Параметры = Новый Структура("Пакет, СпособПечати", ВыбПакет, "ПредПросмотр");
		
		Для Каждого Реализация Из Реализации Цикл
			Параметры.Вставить("ДанныеДляПечати", Новый Структура("Заказ, Реализация", ПолучитьЗаказ(Реализация), Реализация));
			ПечатьНаКлиенте.ВыполнитьПакетнуюПечать(Параметры); КонецЦикла; КонецЕсли;
		
КонецПроцедуры
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Документ.РеализацияТоваров.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
	ОткрытьФорму("Справочник.ПакетыПечатныхДокументов.ФормаВыбора",,ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно,,Новый ОписаниеОповещения("ВыборПакета", ЭтотОбъект, ПараметрКоманды));
	
КонецПроцедуры
