
&НаСервере
Функция ПолучитьТаблицу(Ссылка)
	
	Возврат Справочники.УправленческаяОтчетность.ПолучитьТабличныйДокумент(Ссылка);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Справочник.УправленческаяОтчетность.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
	Таблица = ПолучитьТаблицу(ПараметрКоманды);
	Если Таблица <> Неопределено Тогда
		ОткрытьФорму("ОбщаяФорма.ТабличныйДокумент", Новый Структура("ТабличныйДокумент, ИмяФайла, ДополнительныеПараметры", Таблица, Строка(ПараметрКоманды), Неопределено), ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно); КонецЕсли;
	
КонецПроцедуры
