
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	GUID = Строка(Объект.Ссылка.УникальныйИдентификатор());
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТекстHTML()
	
	ТекстHTML = ДиалогиСПользователем.СформироватьТекстHTML(Объект.ТекстСтатьи);
	
КонецПроцедуры
&НаКлиенте
Процедура ОбновитьТекстМелкогоHTML()
	
	ТекстПредвhtml = ДиалогиСПользователем.СформироватьТекстHTML(Объект.КраткоеСодержание);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьКартинку();
	ОбновитьТекстHTML();
	ОбновитьТекстМелкогоHTML();
	
КонецПроцедуры

&НаКлиенте
Процедура КраткоеСодержаниеПриИзменении(Элемент)
	
	ОбновитьТекстМелкогоHTML();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстСтатьиПриИзменении(Элемент)
	
	ОбновитьТекстHTML();
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьКартинку(текКартинка)
	
	СпрОбъект = РеквизитФормыВЗначение("Объект");
	СпрОбъект.Картинка = Новый ХранилищеЗначения(текКартинка);
	
	Попытка
		СпрОбъект.Записать();
	Исключение
		ОбщиеФункции.СообщитьТекст("Ошибка записи картинки - " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции
&НаКлиенте
Процедура КартинкаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Выберем картинку
	
	ДВ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	Если ДВ.Выбрать() Тогда
		
		стрОшибки 	= "";
		ИмяФайла 	= Сред(ДВ.ПолноеИмяФайла, СтрДлина(ДВ.Каталог) + 1);
		
		Если ЗагрузитьКартинку(Новый Картинка(ДВ.ПолноеИмяФайла)) Тогда
			
			ОбновитьКартинку();
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКартинку()
	
	АдресКартинки = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Картинка");
	
КонецПроцедуры