
//&НаКлиенте
//Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
//	
//	СписокМашин = ЗагрузкаВАвтомобильЗаказов.ПолучитьСписокАвтомобилейДляЗагрузки();
//	ВыбрЭлемент = СписокМашин.ВыбратьЭлемент("В какой кузов заглянуть?");
//	
//	Если ВыбрЭлемент <> Неопределено Тогда
//		
//		ДокСсылка = ЗагрузкаВАвтомобильЗаказов.ПолучитьТекНарядНаЗагрузку(ВыбрЭлемент.Значение);
//		Если ДокСсылка = Неопределено Тогда
//			ПоказатьПредупреждение(,"Кузов пустой, внути нет заказ нарядов",,"Предупреждение");
//		Иначе
//			ОткрытьФорму("Документ.НарядНаЗагрузку.ФормаОбъекта", Новый Структура("Ключ", ДокСсылка));КонецЕсли;КонецЕсли;

//	
//КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	СписокМашин = ЗагрузкаВАвтомобильЗаказов.ПолучитьСписокАвтомобилейДляЗагрузки();
	СписокМашин.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ПослеВыбораЭлемента", ЭтотОбъект, ПараметрКоманды),"В какой кузов заглянуть?");
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЭлемента(ВыбранныйЭлемент, СписокПараметров) Экспорт
	Перем ДокСсылка;
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ДокСсылка = ЗагрузкаВАвтомобильЗаказов.ПолучитьТекНарядНаЗагрузку(ВыбранныйЭлемент.Значение);
	Если ДокСсылка = Неопределено Тогда
		ПоказатьПредупреждение(,"Кузов пустой, внути нет заказ нарядов",,"Предупреждение");
	Иначе
		ОткрытьФорму("Документ.НарядНаЗагрузку.ФормаОбъекта", Новый Структура("Ключ", ДокСсылка));
	КонецЕсли;

КонецПроцедуры
