
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Текст 						= Параметры.Текст;
	НеПоказыватьЗаголовокHTML 	= Параметры.НеПоказыватьЗаголовокHTML;
	
	Заголовок = Заголовок + " " + Параметры.ДополнительныйЗаголовокФормы;
	
	// Вырежим заголовок
	
	Если НеПоказыватьЗаголовокHTML Тогда
		
		НачалоБоди 		= Найти(ВРЕГ(Текст), "<BODY>");
		ЗаголовокHTML 	= Лев(Текст, НачалоБоди - 1);
		ТекстБез 		= Сред(Текст, НачалоБоди + 6);
		Текст 			= Лев(ТекстБез, Найти(ВРЕГ(ТекстБез), "</BODY>") - 1); КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Принять(Команда)
	
	Если НеПоказыватьЗаголовокHTML Тогда
		ОповеститьОВыборе(ЗаголовокHTML + "<body>" + Текст + "</body></html>");
		
	Иначе
		ОповеститьОВыборе(Текст); КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Заголовок = Заголовок + " (" + ВладелецФормы.Объект.Ссылка + ")";
	
КонецПроцедуры
