
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	АдресНастроек = Параметры.АдресНастроек;
	ТекНастройки = ПолучитьИзВременногоХранилища(АдресНастроек).Получить();
	Инициализировать(Параметры.Отчет, ТекНастройки);
КонецПроцедуры

&НаСервере
Процедура Инициализировать(Отчет, ТекНастройки)
	//Отчет = ОтчетPostman.Отчет;
	Схема = Справочники.ОтчетыПользователей.ПолучитьСхему(Отчет);
	//Настройки = Схема.НастройкиПоУмолчанию;
	ТекКомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	
	АдресСхемы = ПоместитьВоВременноеХранилище(Схема, УникальныйИдентификатор); 
	
	Попытка
		ТекКомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы));
	Исключение
		ОбщиеФункции.СообщитьТекст(ОписаниеОшибки()); Возврат;
	КонецПопытки;
	
	ТекКомпоновщикНастроек.ЗагрузитьНастройки(ТекНастройки);
	//ТекКомпоновщикНастроек.ЗагрузитьФиксированныеНастройки(Настройки);
	КомпоновщикНастроек = ТекКомпоновщикНастроек;
	
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Отказ = Модифицированность;
КонецПроцедуры


&НаСервере
Процедура СохранитьНастройки()
	ПоместитьВоВременноеХранилище(Новый ХранилищеЗначения(КомпоновщикНастроек.ПолучитьНастройки()), АдресНастроек);		
КонецПроцедуры


&НаКлиенте
Процедура ПрименитьИЗакрыть(Команда)
	СохранитьНастройки();
	Модифицированность = Ложь;
	Закрыть(Истина);
КонецПроцедуры


&НаКлиенте
Процедура Отмена(Команда)
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ОтменаПослеЗакрытияВопроса", ЭтаФорма, Параметры);
	ПоказатьВопрос(Оповещение, "Данные формы изменены. Продолжить?", Режим, 0);
КонецПроцедуры

&НаКлиенте
Процедура ОтменаПослеЗакрытияВопроса(Результат, Параметры) Экспорт
    Если Не Результат = КодВозвратаДиалога.Да Тогда
        Возврат;
	КонецЕсли;
	Модифицированность = Ложь;
	Закрыть();
КонецПроцедуры

