
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ТипЦенОснование.СписокВыбора.ЗагрузитьЗначения(Параметры.ТипыЦен.ВыгрузитьЗначения());
	
	Для Каждого Строка из Параметры.ТипыЦен Цикл
		НоваяСтрока = Таблица.Добавить();
		НоваяСтрока.ТипЦен 				= Строка.Значение;
		НоваяСтрока.ТипЦенОснование 	= НоваяСтрока.ТипЦен;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыделитьВсе(Команда)
	
	Для Каждого Строка Из Таблица Цикл
		Строка.Пометка = Истина;
	КонецЦикла;

КонецПроцедуры
&НаКлиенте
Процедура СнятьВсе(Команда)
	
	Для Каждого Строка Из Таблица Цикл
		Строка.Пометка = Ложь;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)
	
	//Адрес = ПоместитьВоВременноеХранилище(ВладелецФормы.ТаблицаТоваров, ВладелецФормы.УникальныйИдентификатор);
	//ВладелецФормы.ДействиеОтменено = Ложь;
	
	ВладелецФормы.УстановитьВозможностьОтменыДействия();

	СоответствиеИмен = ВладелецФормы.ПолучитьСоответствияТиповЦен();

	// какая-то пошаговая фигня
	
	Для Каждого СтрокаПроцент Из Таблица Цикл
		Если СтрокаПроцент.Пометка И СтрокаПроцент.Процент <> 0 Тогда
			
			//частный случай для увеличения цены на процент по отношению к себестоимости
				ИмяКолонки = СоответствиеИмен[СтрокаПроцент.ТипЦен];
				ИмяКолонкиОснование = СоответствиеИмен[СтрокаПроцент.ТипЦенОснование];
				ИмяКолонкиЦеныОснование = "Цена" + ИмяКолонкиОснование;
				
			   	Для Каждого Строка Из ВладелецФормы.ТаблицаТоваров Цикл
					Если ЗначениеЗаполнено(Строка[ИмяКолонкиЦеныОснование]) Тогда
						
							// величину колонки основания приводим к типу изменяемой колонки
							ВеличинаОснования =	 Число(ВладелецФормы.ЦенаВВыбраннойВалюте(Строка["Цена" + ИмяКолонкиОснование], Строка["Валюта" + ИмяКолонкиОснование], Строка["Валюта" + ИмяКолонки]));					
							Слагаемое = ВеличинаОснования*(СтрокаПроцент.Процент/100);
							
							Строка["СтараяЦен" + ИмяКолонки] = Строка["Цена" + ИмяКолонки];
							Строка["Цена" + ИмяКолонки] = Формат(ВеличинаОснования + Слагаемое, "ЧЦ=10; ЧДЦ=2");
							
							//ВладелецФормы.ЦеныПересчеты(Строка.ПолучитьИдентификатор(), ИмяКолонки);
						
					КонецЕсли;		
				КонецЦикла;
				
		КонецЕсли;
	КонецЦикла;
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцентПриИзменении(Элемент)
	Если Элементы.Таблица.ТекущиеДанные <> Неопределено Тогда
		Элементы.Таблица.ТекущиеДанные.Пометка = Истина;
	КонецЕсли;
КонецПроцедуры
