
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("ОформитьЗаявку", Перечисления.СостоянияЗаказа.ОформитьЗаявку);
	Список.Параметры.УстановитьЗначениеПараметра("ПринятьИнструмент", Перечисления.СостоянияЗаказа.ПринятьИнструмент);
	Список.Параметры.УстановитьЗначениеПараметра("СогласоватьГарантию", Перечисления.СостоянияЗаказа.СогласоватьГарантию);
	Список.Параметры.УстановитьЗначениеПараметра("ПроизвестиДефектовку", Перечисления.СостоянияЗаказа.ПроизвестиДефектовку);
	Список.Параметры.УстановитьЗначениеПараметра("СогласоватьСКлиентом", Перечисления.СостоянияЗаказа.СогласоватьСКлиентом);
	Список.Параметры.УстановитьЗначениеПараметра("ОжиданиеОплаты", Перечисления.СостоянияЗаказа.ОжиданиеОплаты);
	Список.Параметры.УстановитьЗначениеПараметра("ПередатьКлиенту", Перечисления.СостоянияЗаказа.ПередатьКлиенту);
	Список.Параметры.УстановитьЗначениеПараметра("ПредупредитьКлиента", Перечисления.СостоянияЗаказа.ПредупредитьКлиента);
	
КонецПроцедуры
