
&НаСервере
Процедура ЗагрузитьСправочникнаСервере(СправочникСсылка)

	стрОшибки = "";
	
	Если Не COMServer.ЗагрузитьОбъекты(СправочникСсылка,, стрОшибки) Тогда
		
		ОбщиеФункции.СообщитьТекст(стрОшибки);
		
	Иначе
		
		ОбщиеФункции.СообщитьТекст("Справочник загружен");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСправочник(Команда)
	
	ТекСтрока = Элементы.Список.ТекущаяСтрока;
	                                   
	Если ТекСтрока <> Неопределено Тогда
		
		ЗагрузитьСправочникнаСервере(ТекСтрока);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СинхронизироватьКИ(Команда)
	
	стрОшибки = "";
	COMServer.ВыполнитьСинхронизациюКонтактнойИнформации_общая(стрОшибки);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьШтрихкоды(Команда)
	COMServer.ВыгрузитьШтрихКоды();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьПаспортныеДанные(Команда)
	COMServer.ВыгрузитьПаспортныеДанные();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОрганизацииПоКонтру(Команда)
	COMServer.ВыгрузитьОрганизацииИзДоговораСКонтрагентом();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьТипЦенПартнера(Команда)
	COMServer.ВыгрузитьТипЦенПарнера();
КонецПроцедуры
