
// Процедура заполняет табличную часть списком валют. В список попадают только 
// валюты, курс которых не зависит от курса других валют.
//
Процедура ЗаполнитьСписокВалют() Экспорт
	
	СписокВалют.Очистить();
	
	ЗагружаемыеВалюты = РаботаСКурсамиВалют.ПолучитьМассивЗагружаемыхВалют();
	
	Для Каждого ЭлементВалюта Из ЗагружаемыеВалюты Цикл
		НоваяСтрока = СписокВалют.Добавить();
		НоваяСтрока.КодВалюты = ЭлементВалюта.Код;
		НоваяСтрока.Валюта    = ЭлементВалюта;
	КонецЦикла;
	
КонецПроцедуры

Функция ИзвлечСтроку(Строка)
	
	// Забирает значение строки и возвращает результат
	
	Поз 		= Найти(Строка, ",");
	Значение	= ЛеВ(Строка, Поз - 1);
	Строка 		= Сред(Строка, Поз + 1);
	
	Возврат Значение;
	
КонецФункции

// Загрузка круса долара по отношению к евро
//
Функция ЗагрузитьКурсыДолараКЕвро(стрОшибки = "") Экспорт
	
	// Получим файл с сервера
	
	НачалоУчета = '20130101';
	Результат 	= ПолучениеФайловИзИнтернет.СкачатьФайлНаСервере("http://www.ecb.europa.eu/stats/eurofxref/eurofxref-hist.zip");
	
	Если Результат.Статус Тогда
		
		// Разархивируем
		
		ПутьККаталогуНаСервере = КаталогВременныхФайлов();
		
		ЧтениеZIP = Новый ЧтениеZipФайла(Результат.Путь);
		ЧтениеZIP.ИзвлечьВсе(ПутьККаталогуНаСервере, РежимВосстановленияПутейФайловZIP.НеВосстанавливать);
		ЧтениеZIP.Закрыть();
		
		УдалитьФайлы(Результат.Путь);
		
		// Считаем файл
		            
		Текст = Новый ЧтениеТекста(ПутьККаталогуНаСервере + "eurofxref-hist.csv", КодировкаТекста.ANSI);
		
		Долар = Справочники.Валюты.НайтиПоКоду("840");
		Набор = РегистрыСведений.КурсыВалют.СоздатьНаборЗаписей();
		Набор.Отбор.Валюта.Установить(Долар);
		
		Текст.ПрочитатьСтроку(); // первая строка с полями
		Стр = Текст.ПрочитатьСтроку(); 
		Пока Стр <> Неопределено Цикл 
			
			Попытка		Период = Дата(СтрЗаменить(ИзвлечСтроку(Стр) ,"-",""));
			Исключение	Перейти ~КонецЦикла; КонецПопытки;
			
			Если Период >= НачалоУчета Тогда
			
				НовСтрока = Набор.Добавить();
				НовСтрока.Валюта 	= Долар;
				НовСтрока.Период 	= Период;
				НовСтрока.Курс 		= 1 / Число(ИзвлечСтроку(Стр)); 
				НовСтрока.Кратность = 1; КонецЕсли;
				
			~КонецЦикла: Стр = Текст.ПрочитатьСтроку(); КонецЦикла;
		
		УдалитьФайлы(Результат.Путь);
		
		// Загрузим в регистр
		
		Возврат ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(Набор);
		
	Иначе
		
		стрОшибки = "Не удалось загрузить файл с сервера ЕЦБ";
		Возврат Ложь; КонецЕсли;
	
КонецФункции
