
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	GUID = Объект.Ссылка.УникальныйИдентификатор();
	
	ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(Просмотр, "Кто", Объект.Ссылка);
	
	ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(Склады, "Пользователь", Объект.Ссылка);
	ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(Роли, 	"Пользователь", Объект.Ссылка);
	ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(ТипыЦен,"Пользователь", Объект.Ссылка);
	ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(ОтделыОКС,"Пользователь", Объект.Ссылка);
	ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(Менеджеры, "Пользователь", Объект.Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура РолиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,"Необходимо вначале записать пользователя!",,"Предупреждение");
	Иначе
		ОткрытьФорму("РегистрСведений.РолиПользователей.ФормаЗаписи", Новый Структура("Пользователь", Объект.Ссылка)); КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура СкладыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,"Необходимо вначале записать пользователя!",,"Предупреждение");
	Иначе
		ОткрытьФорму("РегистрСведений.СкладыПользователя.ФормаЗаписи", Новый Структура("Пользователь", Объект.Ссылка)); КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ТипыЦенПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,"Необходимо вначале записать пользователя!",,"Предупреждение");
	Иначе
		ОткрытьФорму("РегистрСведений.ПравоПросмотраТиповЦен.ФормаЗаписи", Новый Структура("Пользователь", Объект.Ссылка)); КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ОтделыОКСПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
		
	Отказ = Истина;
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,"Необходимо вначале записать пользователя!",,"Предупреждение");
	Иначе
		ОткрытьФорму("РегистрСведений.ОтделыКлиентскогоСервиса.ФормаЗаписи", Новый Структура("Пользователь", Объект.Ссылка)); КонецЕсли;
	

КонецПроцедуры
&НаКлиенте
Процедура МенеджерыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,"Необходимо вначале записать пользователя!",,"Предупреждение");
	Иначе
		ОткрытьФорму("РегистрСведений.ПравоПросмотраМенеджеров.ФормаЗаписи", Новый Структура("Пользователь", Объект.Ссылка)); КонецЕсли;
	

КонецПроцедуры
&НаКлиенте
Процедура ПросмотрПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,"Необходимо вначале записать пользователя!",,"Предупреждение");
	Иначе
		ОткрытьФорму("РегистрСведений.ПравоПросмотраПосещений.ФормаЗаписи", Новый Структура("Пользователь", Объект.Ссылка)); КонецЕсли;
	

КонецПроцедуры

#Область Управлени_паролем

&НаСервере
Функция ЕстьТакойПользователь()
	
	Возврат ПользователиИнформационнойБазы.НайтиПоИмени(СокрЛП(Объект.Код)) <> Неопределено;
	
КонецФункции
&НаСервере
Процедура УстановитьПарольНаСервере(Пароль)
	
	ПользовательСистемы = ПользователиИнформационнойБазы.НайтиПоИмени(СокрЛП(Объект.Код));
	ПользовательСистемы.Пароль = Пароль;
	ПользовательСистемы.Записать();
	
КонецПроцедуры
	
&НаКлиенте
Процедура УстановитьПароль(Команда)
	
	// Откопаем пользователя
	
	Если ЕстьТакойПользователь() Тогда
		
		ОткрытьФорму("Справочник.Пользователи.Форма.ВводПароля",,ЭтаФорма,,,,Новый ОписаниеОповещения("УстановитьПарольПользователя", ЭтаФорма));
		
	Иначе
		
		ПоказатьПредупреждение(,"Не найден пользователь системы"); КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура УстановитьПарольПользователя(Результат, Параметры) Экспорт
	
	Если Результат <> Неопределено Тогда УстановитьПарольНаСервере(Результат) КонецЕсли;
	
КонецПроцедуры



#КонецОбласти