Функция ПроверитьУсловияКонтроляЗаказа(СсылкаНаЗаказ) Экспорт
	
	//ПроверитьКонтролеромОбъект = Справочники.УсловияКонтроляЗаказа.ПроверитьКонтролером.ПолучитьОбъект();  
	ПроверитьКонтролеромОбъект = Справочники.УсловияКонтроляЗаказа.НайтиПоКоду("000000002").ПолучитьОбъект();
	СКД = ПроверитьКонтролеромОбъект.ПолучитьМакет("Макет");
	
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СКД));
	
	НастройкиКомпоновки = ПроверитьКонтролеромОбъект.НастройкиКомпоновщика.Получить();
	Если НЕ ЗначениеЗаполнено(НастройкиКомпоновки) Тогда
		КомпоновщикНастроек.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
	Иначе
		КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновки);
	КонецЕсли;

	ЭлементНастройки = КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("СсылкаНаЗаказ"));
	ЭлементНастройки.Использование = Истина;
	ЭлементНастройки.Значение = СсылкаНаЗаказ;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, КомпоновщикНастроек.Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ТЗ = Новый ТаблицаЗначений;
	ПроцессорВывода.УстановитьОбъект(ТЗ);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецФункции	