
//&НАсЕРВЕРЕ
//Процедура ПечатьНаСервере(ТабДок, МассивНоменклатуры)
//	
//	КолКолонок 	= 5;	    
//	текКолонка 	= 0;

//	Макет 		= ПолучитьОбщийМакет("ШаблонЭтикетки").ПолучитьОбласть("Этикетка");
//	ТаблСтрока 	= Новый ТабличныйДокумент;
//	Выводить 	= Ложь;
//		  
//	Для Каждого Номенклатура Из МассивНоменклатуры Цикл
//		вШтрихКоды = ШтрихКоды.ПолучитьШтрихКодыОбъекта(Номенклатура); Если вШтрихКоды.Количество() = 1 Тогда ШтрихКод = вШтрихКоды[0];
//		
//		Макет.Параметры.Артикул 		= Номенклатура.Артикул;
//		Макет.Параметры.Наименование 	= Номенклатура.Наименование;
//	 	ШтрихКоды.УстановитьШтрихКодВМакете(Макет, ШтрихКод);
//	
//		// Увеличим счетчик
//		 
//		текКолонка 	= текКолонка + 1;
//		
//		// Добавим в макет
//		
//		Если текКолонка / КолКолонок = Цел(текКолонка / КолКолонок) Тогда // строка заполнена и готова
//			
//			ТаблСтрока.Присоединить(Макет);
//		
//			Если ТабДок.ПроверитьВывод(ТаблСтрока) Тогда ТабДок.Вывести(ТаблСтрока); Иначе ТабДок.ВывестиГоризонтальныйРазделительСтраниц(); ТабДок.Вывести(ТаблСтрока);КонецЕсли;
//			
//			ТаблСтрока	= Новый ТабличныйДокумент;
//			текКолонка 	= 0;
//			Выводить 	= Ложь;

//		Иначе 
//			
//			ТаблСтрока.Присоединить(Макет); 
//			Выводить = Истина; КонецЕсли; КонецЕсли;КонецЦикла;
//		
//	// Выведем еще раз
//		
//	Если Выводить Тогда 
//		Если ТабДок.ПроверитьВывод(ТаблСтрока) Тогда ТабДок.Вывести(ТаблСтрока); Иначе ТабДок.ВывестиГоризонтальныйРазделительСтраниц();ТабДок.Вывести(ТаблСтрока);КонецЕсли; КонецЕсли;
//	
//КонецПроцедуры

//&НаКлиенте
//Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
//	
//	ТабДок = Новый ТабличныйДокумент;
//	
//	Печать(ТабДок, ПараметрКоманды);

//	ФункцииФормДокументов.УстановитьНастройкиТабличногоДокумента(ТабДок);
//	
//	ТабДок.АвтоМасштаб = Истина;
//	
//	ТабДок.Показать();
//	
//КонецПроцедуры

//&НаСервере
//Функция Печать(ТабДок, ПараметрКоманды, ПараметрыПечати = Неопределено)
//	
//	
//	
//	//Инд = -1;
//	//Для Каждого Ссылка Из ПараметрКоманды Цикл Инд = Инд + 1;
//	//	
//	//		Если Инд Тогда
//	//			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
//	//		КонецЕсли;
//	//		
//	//		// как-то совсем тупо
//	//		
//	//		Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Номенклатура") И НЕ Ссылка.ЭтоГруппа Тогда
//	//			
//				ПечатьНаСервере(ТабДок, ПараметрКоманды);

//	//		ИначеЕсли 
//	//			ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
//	//			
//	//			ПараметрыПечати = Новый Структура("Организация", Ссылка.Организация);
//	//			Печать(ТабДок, Ссылка.Товары.ВыгрузитьКолонку("Номенклатура"), ПараметрыПечати)
//	//		КонецЕсли;
//	//			
//	//КонецЦикла;
//	
//КонецФункции


//Начало изменения (Вера)
&НАсЕРВЕРЕ
Процедура ПечатьНаСервереДокумент(ТабДок, Ссылка)
		
	МетаДок = Ссылка.Метаданные();
	ИмяДок 	= МетаДок.Имя;
	
	Запрос = Новый Запрос();
	Запрос.Текст = 	
	"ВЫБРАТЬ
	|	Док.Номенклатура.Артикул Артикул,
	|	Док.Номенклатура
	|ИЗ
	|	Документ." + ИмяДок + ".Товары Док
	|ГДЕ
	|	Док.Ссылка = &Документ";

	Запрос.УстановитьПараметр("Документ", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	
	текСтрока = 0;

	Макет 		= ПолучитьОбщийМакет("ШаблонНовойЭтикетки").ПолучитьОбласть("Этикетка");
	ТаблСтрока 	= Новый ТабличныйДокумент;
	Выводить 	= Ложь;
	
	Пока Выборка.Следующий() Цикл
		
    вШтрихКоды = ШтрихКоды.ПолучитьШтрихКодыОбъекта(Выборка.Номенклатура);
 
	   Если вШтрихКоды.Количество() = 1 Тогда ШтрихКод = вШтрихКоды[0];
		
			Макет.Параметры.Номенклатура = Выборка.Номенклатура;
			Макет.Параметры.Артикул = Выборка.Артикул;
		    ШтрихКоды.УстановитьШтрихКодВМакете(Макет, ШтрихКод);
	
		    текСтрока =  текСтрока + 1;
			
			ТаблСтрока.Присоединить(Макет);
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
			ТабДок.Вывести(ТаблСтрока);
				
			ТаблСтрока	= Новый ТабличныйДокумент;
			текСтрока = 0;
			Выводить 	= Ложь;
			
	   КонецЕсли;
		
	КонецЦикла;
				
	Если Выводить Тогда 
		Если ТабДок.ПроверитьВывод(ТаблСтрока) Тогда ТабДок.Вывести(ТаблСтрока); Иначе ТабДок.ВывестиГоризонтальныйРазделительСтраниц();ТабДок.Вывести(ТаблСтрока);КонецЕсли; КонецЕсли;
	КонецПроцедуры
	
&НАсЕРВЕРЕ
Процедура ПечатьНаСервереСправочник(ТабДок, МассивНоменклатуры)
	
	Макет 		= ПолучитьОбщийМакет("ШаблонНовойЭтикетки").ПолучитьОбласть("Этикетка");
	ТаблСтрока 	= Новый ТабличныйДокумент;
	Выводить 	= Ложь;
		  
	Для Каждого Номенклатура Из МассивНоменклатуры Цикл
		вШтрихКоды = ШтрихКоды.ПолучитьШтрихКодыОбъекта(Номенклатура); Если вШтрихКоды.Количество() = 1 Тогда ШтрихКод = вШтрихКоды[0];
		
		Макет.Параметры.Номенклатура 	= Номенклатура.Наименование;
		Макет.Параметры.Артикул 		= Номенклатура.Артикул;

	 	ШтрихКоды.УстановитьШтрихКодВМакете(Макет, ШтрихКод);
	
			ТаблСтрока.Присоединить(Макет);
			ТабДок.Вывести(ТаблСтрока);
							
	   КонецЕсли;
		
	КонецЦикла;
					
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыДляТабличногоДокумента(Ссылки, СтрНомер)
	
	Возврат Заказы.ПолучитьПараметрыДляТабличногоДокумента(Ссылки, СтрНомер);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДок = Новый ТабличныйДокумент;
	
	Если ТипЗнч(ПараметрКоманды[0]) = Тип("ДокументСсылка.ПоступлениеТоваров") ИЛИ 
	ТипЗнч(ПараметрКоманды[0]) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
	
	ПечатьДокумент(ТабДок, ПараметрКоманды);
	
	ФункцииФормДокументов.УстановитьНастройкиТабличногоДокумента(ТабДок);
	
	ТабДок.АвтоМасштаб = Истина;
	
	СтрНомера = "";
	ДополнительныеПараметры = ПолучитьПараметрыДляТабличногоДокумента(ПараметрКоманды, СтрНомера);
	ОткрытьФорму("ОбщаяФорма.ТабличныйДокумент", Новый Структура("ТабличныйДокумент, ИмяФайла, ДополнительныеПараметры", ТабДок, СтрНомера, ДополнительныеПараметры),ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);

    Иначе
	
	ПечатьСправочник(ТабДок, ПараметрКоманды);
	
	ФункцииФормДокументов.УстановитьНастройкиТабличногоДокумента(ТабДок);
	
	ТабДок.АвтоМасштаб = Истина;
	
	ТабДок.Показать();
	
    КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПечатьДокумент(ТабДок, ПараметрКоманды, ПараметрыПечати = Неопределено)
	
	         Инд = -1;
	Для Каждого Ссылка Из ПараметрКоманды Цикл Инд = Инд + 1;
		
		Если Инд Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
					 
            ПечатьНаСервереДокумент(ТабДок, Ссылка);
						 
	 КонецЦикла;

 КонецФункции

&НаСервере
Функция ПечатьСправочник(ТабДок, ПараметрКоманды, ПараметрыПечати = Неопределено)
					 
           ПечатьНаСервереСправочник(ТабДок, ПараметрКоманды);
						 
 КонецФункции
//Конец изменения (Вера) 

