
&НаСервере
Функция ОбновитьСтатусы(Дата)
	
	Возврат РегистрыСведений.СрезЗадачПоДням.ОбновитьСтатусыВсехЗадач(Дата, Дата);
	
КонецФункции
&НаКлиенте
Процедура ПользовательРешил(Дата, ДополнительныеПараметры) Экспорт
	
	Если Дата <> Неопределено Тогда
		
		текДата = ТекущаяДата();
			Если ОбновитьСтатусы(Дата) Тогда ПоказатьПредупреждение(,"Обновление заверешено",,"Хорошая новость"); КонецЕсли; КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПоказатьВводДаты(Новый ОписаниеОповещения("ПользовательРешил", ЭтотОбъект),,"День когда обновить статусы задач", ЧастиДаты.Дата);
	
КонецПроцедуры
