Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос(
	
	// ПАРАМЕТРЫ СИСТЕМЫ
	
	КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() + "
	|;
	
	// ШАПКА

	|ВЫБРАТЬ
	|	Склад
	|ИЗ
	|	Документ.ЗаказНаСборку
	|ГДЕ
	|	Ссылка = &Ссылка
	|;
	
	// ЗаказНаСборку
	
	|ВЫБРАТЬ
	|	&Период						КАК Период,
	|	&ВидДвиженияПриход			КАК ВидДвижения,
	|	Ссылка.Склад				КАК Склад,
	|	Ссылка.Заказ				Заказ,
	|	Номенклатура	            КАК Номенклатура,
	|   Упаковка					Упаковка,
	|	СУММА(Количество)			Количество
    |ИЗ
	|	Документ.ЗаказНаСборку.Товары
	|
	|ГДЕ
	|	Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Ссылка,
	|	Номенклатура,
	|	Упаковка
	|");
	
	//Запрос.УстановитьПараметр("Область", 			ПараметрыСеанса.ТекущаяОбласть);
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("Период", 			Ссылка.Дата);
	Запрос.УстановитьПараметр("ВидДвиженияПриход", 	ВидДвиженияНакопления.Приход);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ДополнительныеСвойства.Вставить("ПараметрыСистемы", КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[0].Выгрузить()));
	ДополнительныеСвойства.Вставить("Шапка", 			КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[1].Выгрузить()));
	ДополнительныеСвойства.Вставить("ТоварыВСборке", 	Пакет[2].Выгрузить());
	
КонецПроцедуры
