
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Подготовка
	
	Заголовок = КонтрольПроведения.ПолучитьСтандарнтыйЗаголовокПриПроведенииДокумента(Ссылка);
	
	Документы[Метаданные().Имя].ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Проведение
	
	ПроведенияДокументов.ПровестиПоВсемРегистрам(
									Метаданные().Движения, 
									ДополнительныеСвойства, 
									Движения, 
									Отказ);
	// Запись
	
	Движения.Записать();
	
	// Контроль
	

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Заголовок = КонтрольПроведения.ПолучитьСтандарнтыйЗаголовокПриОтменеПроведенияДокумента(Ссылка);
	
	Движения.ТоварыВСборке.Очистить();
	Движения.Записать();

КонецПроцедуры
