
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("ФильтрОрганизация", Не Параметры.Организация.Пустая());
	Список.Параметры.УстановитьЗначениеПараметра("Организация", Параметры.Организация);
	
	Список.Параметры.УстановитьЗначениеПараметра("ФильтрПартнер", Не Параметры.Партнер.Пустая());
	Список.Параметры.УстановитьЗначениеПараметра("Партнер", Параметры.Партнер);
	
	Список.Параметры.УстановитьЗначениеПараметра("ФильтрКонтрагент", Не Параметры.Контрагент.Пустая());
	Список.Параметры.УстановитьЗначениеПараметра("Контрагент", Параметры.Контрагент);
	
КонецПроцедуры
