
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	ОткрытьФорму("РегистрСведений.ОбращенияВТехПоддержку.Форма.МоиОбращения", Новый Структура("Отбор", Новый Структура("Заявитель", НастройкиПользователя.ТекущийПользователь())), ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
