
&НаСервере
Функция ПолучитьПодобныйЗаписьСправочник(Вледелец, Код, Наименование)
	
	Запрос = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Справочник.ЗаписиУО ГДЕ Владелец = &Ссылка И Представление = &Представление И Код = &Код");
	Запрос.УстановитьПараметр("Ссылка", 		Вледелец);
	Запрос.УстановитьПараметр("Представление", 	Наименование);
	Запрос.УстановитьПараметр("Код",			Код);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда	Возврат Выборка.Ссылка;
	Иначе							Возврат Справочники.ЗаписиУО.ПустаяСсылка() КонецЕсли;
	
КонецФункции
&НаСервере
Функция СкопироватьСтроки(ОткудаСсылка, КудаСсылка)
	
	Запрос = Новый Запрос("ВЫБРАТЬ * ИЗ Справочник.ЗаписиУО ГДЕ Владелец = &Ссылка И НЕ ПометкаУдаления УПОРЯДОЧИТЬ ПО Ссылка ИЕРАРХИЯ");
	Запрос.УстановитьПараметр("Ссылка", ОткудаСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СсылкаПодобного = ПолучитьПодобныйЗаписьСправочник(КудаСсылка, Выборка.Код, Выборка.Представление);
		
		Если СсылкаПодобного.Пустая() Тогда
			
			новСпр = Справочники.ЗаписиУО.СоздатьЭлемент();			
			ЗаполнитьЗначенияСвойств(новСпр, Выборка);
			
			новСпр.Владелец = КудаСсылка;
			Если Не Выборка.Родитель.Пустая() Тогда
				НовСпр.Родитель	= ПолучитьПодобныйЗаписьСправочник(КудаСсылка, Выборка.Родитель.Код, Выборка.Родитель.Представление); КонецЕсли;
			
			Если Не ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(новСпр) Тогда
				Возврат Ложь; КонецЕсли; КонецЕсли; КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаВыборка(УправлОтчеты, текСсылка) Экспорт
	
	Если УправлОтчеты <> Неопределено Тогда
		
		Ном = 0; Кол = УправлОтчеты.Количество();
		Для Каждого УпрОтчет Из УправлОтчеты Цикл Ном = Ном + 1;
			ОбработкаПрерыванияПользователя();
			Если Не СкопироватьСтроки(текСсылка, УпрОтчет) Тогда Возврат КонецЕсли;
			Состояние("Копируем строки", ном / Кол * 100, УпрОтчет); КонецЦикла; КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОткрытьФорму(
			"Справочник.УправленческаяОтчетность.Форма.ФормаВыбораДляКопирования", 
			Новый Структура("МножественныйВыбор", Истина), 
			ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка, 
			Новый ОписаниеОповещения("ОбработкаВыборка", ЭтотОбъект, ПараметрКоманды));
	
КонецПроцедуры
