
&НаСервере
Функция Установить(Ссылки)
	
	Возврат РегистрыСведений.БумажныеДокументы.УстановитьГалки(Ссылки,, Истина);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ИхМного = ПараметрКоманды.Количество() > 1;
	
	Если Установить(ПараметрКоманды) Тогда
		Если ПараметрыВыполненияКоманды.Источник.Элементы.Найти("Список") <> Неопределено Тогда
			ПараметрыВыполненияКоманды.Источник.Элементы.Список.Обновить() КонецЕсли;
		ПоказатьОповещениеПользователя("Отметка документов",,"Первичны" + ?(ИхМного, "е","й") + " документ" + ?(ИхМного, "ы","") + " помечен" + ?(ИхМного, "ы",""), БиблиотекаКартинок.Бухгалтерия) КонецЕсли;
	
КонецПроцедуры
