Процедура СохранитьКартинку(Отказ)
	
	ТекКартинка = Картинка.Получить();
	
	Если ТекКартинка <> Неопределено Тогда
		
		ИмяФайла = КэшируемыеФункции.ПолучитьПутьКОблакуЛокально() + "\service\" + Код + "." + Расширение;
			
		Попытка
			текКартинка.Записать(ИмяФайла);
		Исключение
			стрОшибки = ОписаниеОшибки();
			ОбщиеФункции.СообщитьТекст("Ошибка при записи картинки в облако
			|ИмяФайла = " + ИмяФайла + "
			|" + стрОшибки);
			Отказ = Истина; КонецПопытки; КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	СохранитьКартинку(Отказ);
	
	// Обновим описание картинок в ремонте инструемента
	
	
	
	
	// Проверим что нет одинаковых справочник с основным реквизитом
	//	представление должно быть одним
	//	поэтому если их несколько то заберем основное представление у другого
	
	//Если ЭтоПредставлениеОбъекта Тогда
	//
	//	Запрос = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Справочник." + Метаданные().Имя + " ГДЕ Владелец = &Владелец И Ссылка <> &Ссылка И ЭтоПредставлениеОбъекта = ИСТИНА");
	//	Запрос.УстановитьПараметр("Ссылка", 	Ссылка);
	//	Запрос.УстановитьПараметр("Владелец",	Владелец);
	//	
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Пока Выборка.Следующий() Цикл
	//		
	//		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
	//		СправочникОбъект.ЭтоПредставлениеОбъекта = Ложь;
	//		
	//		Попытка
	//			СправочникОбъект.Записать();
	//		Исключение
	//			ОпОшибки = ОписаниеОшибки();
	//			ОбщиеФункции.СообщитьТекст("Ошибка при снятии основной картинки с объекта" + Выборка.Ссылка + "
	//			|" + ОпОшибки);
	//			Отказ = Истина;
	//		КонецПопытки;
	//		
	//	КонецЦикла;
	//КонецЕсли;
	
	// Выгрузим на сайт
	
	// Картинки.ВыгрузитьКартинуНоменклатурыНаСайт(Владелец);
	
	
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ)
	
	ТекКартинка = Картинка.Получить();
	
	Если ТекКартинка <> Неопределено Тогда
		Расширение	= КонвертацияТипов.РасширениеКартинки(текКартинка) КонецЕсли;
	
КонецПроцедуры

