// ПОЛУЧЕНИЕ ДАННЫХ

Функция ПолучитьСписокЗаказовКОбъединению(ЗадачаСсылка, ДопУсловия = Неопределено) Экспорт
	
	// ДопУсловия - структура
	//	- Параметры 			- (массив) параметры запроса
	//	- ТекстФильтраЗароса 	- (строка) текст который подставляется в блок условий запроса
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Заказ, Заказ.Номер Номер, Заказ.Дата Дата, ЕСТЬNULL(Заказ.Контрагент, Заказ.Заказчик) Заказчик, Заказ.Сумма Сумма, ТИПЗНАЧЕНИЯ(Заказ) ТипЗаказа
	|ИЗ
	|	Задача.ЗадачаПользователю
	|ГДЕ
	|	НЕ ПометкаУдаления И НЕ Выполнена И
	|	Склад = &Склад И Пользователь = &Пользователь И Роль = &Роль И
	|	ТочкаМаршрута = &ТочкаМаршрута
	|	// Доп. параметры
	|
	|УПОРЯДОЧИТЬ ПО 
	|	Заказ.Дата
	|");
	
	Запрос.УстановитьПараметр("Склад", 			ЗадачаСсылка.Склад);
	Запрос.УстановитьПараметр("Пользователь", 	ЗадачаСсылка.Пользователь);
	Запрос.УстановитьПараметр("Роль", 			ЗадачаСсылка.Роль);
	Запрос.УстановитьПараметр("ТочкаМаршрута", 	ЗадачаСсылка.ТочкаМаршрута);
	
	Если ДопУсловия <> Неопределено Тогда
		Для Каждого Параметр Из ДопУсловия.Параметры Цикл Запрос.УстановитьПараметр(Параметр.Ключ, Параметр.Значение) КонецЦикла;
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "// Доп. параметры", ДопУсловия.ТекстФильтраЗароса); КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Список 	= Новый СписокЗначений;
	
	Пока Выборка.Следующий() Цикл
		Список.Добавить(Выборка.Заказ, СтрШаблон("%3: %1 %2 (%4) %5", 
					?(Выборка.ТипЗаказа = Тип("ДокументСсылка.ВнутреннийЗаказ"), "Внутренний заказ", ?(Выборка.ТипЗаказа = Тип("ДокументСсылка.ИнтернетЗаказПокупателя"), "Интернет заказ", "Заказ")),
					Выборка.Номер,
					Формат(Выборка.Дата, "ДФ=yyyy-MM-dd"),
					Выборка.Заказчик,
					Выборка.Сумма)); КонецЦикла;
					
	Возврат Список;
	
КонецФункции

Процедура ОбновитьТаблицуТоваров(ТаблицаТоваров, МассивЗаказов) Экспорт

	ТаблицаТоваров.Загрузить(Заказы.ПолучитьСостояниеТоваров(МассивЗаказов));
		
КонецПроцедуры