
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если Объект.ТипТекста = Перечисления.ТипыТекстовЭлектронныхПисем.HTML Тогда
	
		ТекстПисьма.УстановитьHTML(Объект.Текст, новый Структура);
		
	Иначе
		
		ТекстПисьма.УстановитьHTML(СтрЗаменить(Объект.Текст, Символы.ПС, "<br>"), новый Структура);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбычнаяФорма(Команда)
	
	ОткрытьФорму("Документ.Письмо.Форма.ФормаДокумента", Новый Структура("Ключ", Объект.Ссылка));
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Объект.ТипТекста 		= Перечисления.ТипыТекстовЭлектронныхПисем.HTML;
		Объект.УчетнаяЗапись 	= ОбщиеФункции.НастройкаПользователя("УчетнаяЗаписьПочты");
		
	КонецЕсли;
	
КонецПроцедуры

// Отправка письма

&НаКлиенте
Функция СформироватьПараметрыПисьма(знач ПриведенныйПочтовыйАдрес,
                                    знач Пароль = Неопределено)
	// Проверяет возможность отправления письма и если
	// это возможно - формирует параметры отправки
	//

	ПараметрыПисьма = Новый Структура;
	
	//Если ЗначениеЗаполнено(Пароль) Тогда
	//	ПараметрыПисьма.Вставить("Пароль", Пароль);
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(ПриведенныйПочтовыйАдрес) Тогда
		ПараметрыПисьма.Вставить("Кому", ПриведенныйПочтовыйАдрес);
	КонецЕсли;
	
	//Если ЗначениеЗаполнено(АдресОтвета) Тогда
	//	ПараметрыПисьма.Вставить("АдресОтвета", АдресОтвета);
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Тема) Тогда
		ПараметрыПисьма.Вставить("Тема", Объект.Тема);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Текст) Тогда
		ПараметрыПисьма.Вставить("Тело", Объект.Текст);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ТипТекста) Тогда
		ПараметрыПисьма.Вставить("ТипТекста", Объект.ТипТекста);
	КонецЕсли;
	
	
	//Если ВложенияВПисьмо.Количество() > 0 Тогда
	//	Вложения = Новый Соответствие;
	//	Для Каждого ЭлементВложение Из ВложенияВПисьмо Цикл
	//		Если ЭлементВложение.Пометка Тогда
	//			ДвоичныеДанные = Новый ДвоичныеДанные(ЭлементВложение.Значение);
	//			Вложения.Вставить(ЭлементВложение.Представление, ДвоичныеДанные);
	//		Иначе
	//			Вложения.Вставить(ЭлементВложение.Представление, ЭлементВложение.Значение);
	//		КонецЕсли;
	//	КонецЦикла;
	//	ПараметрыПисьма.Вставить("Вложения", Вложения);
	//КонецЕсли;
	
	Возврат ПараметрыПисьма;
	
КонецФункции
&НаСервере
Функция ПолучитьПарольУчетнойЗаписи()
	
	Пароль = "";
	
	Запрос = Новый Запрос("ВЫБРАТь Пароль ИЗ Справочник.УчетныеЗаписиЭлектроннойПочты ГДЕ Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Объект.УчетнаяЗапись);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Пароль = Выборка.Пароль;
		
	КонецЕсли;
	
	Возврат Пароль;
	
КонецФункции
&НаКлиенте
Процедура ПослатьПисьмо(Команда)
	
	Если Модифицированность Тогда
		Записать();
	КонецЕсли;
	
	ОчиститьСообщения();
	
	Попытка
		ПриведенныйПочтовыйАдрес = ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(Объект.Кому);
	Исключение
		Предупреждение(ОбщегоНазначенияКлиентСервер.ПолучитьПредставлениеОписанияОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	
	//Если ЗначениеЗаполнено(АдресОтвета) Тогда
	//	Попытка
	//		ПриведенныйАдресОтвета = ОбщегоНазначенияКлиентСервер.РазобратьСтрокуСПочтовымиАдресами(АдресОтвета);
	//	Исключение
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОбщегоНазначенияКлиентСервер.ПолучитьПредставлениеОписанияОшибки(ИнформацияОбОшибке()), ЭтаФорма, "АдресОтвета");
	//		Возврат;
	//	КонецПопытки;
	//КонецЕсли;
	
	//Пароль = Неопределено;
	
	Пароль = ПолучитьПарольУчетнойЗаписи();

	ПараметрыПисьма = СформироватьПараметрыПисьма(ПриведенныйПочтовыйАдрес);
	
	Если ПараметрыПисьма = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Ошибка формирования параметров почтового сообщения'"));
		Возврат;
	КонецЕсли;
	
	Попытка
		ЭлектроннаяПочта.ОтправитьПочтовоеСообщение(Объект.УчетнаяЗапись, ПараметрыПисьма);
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОбщегоНазначенияКлиентСервер.ПолучитьПредставлениеОписанияОшибки(ИнформацияОбОшибке()));
		Возврат;
	КонецПопытки;
	
	//СохранитьАдресОтвета(АдресОтвета);
	Предупреждение(НСтр("ru = 'Сообщение успешно отправлено'"));

	Закрыть();

	
КонецПроцедуры
&НаКлиенте
Процедура ВПочтовыйКлиент(Команда)
	
	Пароль = "";
	Если ВвестиСтроку(Пароль) Тогда
		APIGoogle.ПолучитьИдентификаторАвторизации("it@garagetools.ru", Пароль) КонецЕсли;
	//Почта2Клиент.ОтправитьПочтовоеСообщениеПочтовомуКлиенту(Новый Структура("Кому, Тема, Текст", Объект.Кому, Объект.Тема, ТекстПисьма.ПолучитьТекст()));
	
КонецПроцедуры
