
&НаСервере
Функция ПолучитьПараметры(ПараметрКоманды)
	
	Имя = ПараметрКоманды.Метаданные().Имя;
	
	Если Имя = "Партнеры" Тогда
		
		Возврат Новый Структура("Партнер", ПараметрКоманды);
		
	ИначеЕсли Имя = "ЗаявкаПокупателя" Или Имя = "ИнтернетЗаявка" Тогда
		
		Возврат Новый Структура("Организация, Партнер", ПараметрКоманды.Заказ.Организация, ПараметрКоманды.Заказ.Партнер);
		
	Иначе
		
		Возврат Новый Структура("Организация, Партнер", ПараметрКоманды.Организация, ПараметрКоманды.Партнер);
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = ПолучитьПараметры(ПараметрКоманды);
	
	ОткрытьФорму(	"Обработка.ДолгиПоОплате_Управление.Форма.Управление", 
					ПараметрыФормы, 
					ПараметрыВыполненияКоманды.Источник, 
					ПараметрыВыполненияКоманды.Уникальность, 
					ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
