&НаСервере
Функция ПолучитьИмяФайла(Ссылка) Возврат Ссылка.Номер КонецФункции

&НаСервере
Функция ПолучитьТаблДокумент(Ссылки)
	
	Запрос = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Документ.ТехЗаключение ГДЕ ЗаказНаряд В(&Ссылки) И Не ПометкаУдаления");
	Запрос.УстановитьПараметр("Ссылки", Ссылки);
	
	Возврат Документы.ТехЗаключение.ПечатьТехЗаключение(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТаблДок = ПолучитьТаблДокумент(ПараметрКоманды);
	ФункцииФормДокументов.УстановитьНастройкиТабличногоДокумента(ТаблДок);
	ТаблДок.Показать("Тех. заключение (печать)", ПолучитьИмяФайла(ПараметрКоманды[0]));
	
КонецПроцедуры

//&НаКлиенте
//Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
//	
//	Для Каждого Ссылка Из ПараметрКоманды Цикл
//	
//		ТабДок = ПолучитьТаблДокумент(Ссылка);
//		ФункцииФормДокументов.УстановитьНастройкиТабличногоДокумента(ТабДок);
//		
//		ТабДок.ДвусторонняяПечать = ТипДвустороннейПечати.ПереворотВлево;

//		ОткрытьФорму("ОбщаяФорма.ТабличныйДокумент", Новый Структура("ТабличныйДокумент, ИмяФайла", ТабДок, ПолучитьИмяФайла(Ссылка)), ПараметрыВыполненияКоманды.Источник, Новый УникальныйИдентификатор, ПараметрыВыполненияКоманды.Окно); КонецЦикла;
//	
//КонецПроцедуры
