
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Инвойс = ДанныеЗаполнения;
	РасчетВеса = Перечисления.ВидыРасчетаВеса.ПоУпаковкам;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
							|		Тов.Номенклатура КАК Номенклатура,
							|		Тов.Количество КАК Количество,
							|		Упак.ВесНетто,
							|		Упак.ВесБрутто,
							|		Упак.Объем,
							|		Тов.Количество/ЕСТЬNULL(Упак.Коэффициент, 1) КоличествоМест
							|		
							|	ИЗ
							|		Документ.Инвойс.Товары Тов
							|		ЛЕВОЕ СОЕДИНЕНИЕ
							|			Справочник.УпаковкиПоставщика Упак ПО Тов.Номенклатура = Упак.Владелец  И Упак.Основная
							|ГДЕ
							|		Тов.Ссылка = &Ссылка
							|");
							
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);						
	Товары.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры
