
#Область СобытияФормы

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Отказ = ПроверитьПравильностьЗаполненияФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеФункции

&НаКлиенте
Функция ПроверитьПравильностьЗаполненияФормы()
	
	Отказ = Ложь;
	
	Если Объект.СуммаОт >= Объект.СуммаДо Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Значение ""Сумма от"" не может быть больше или равно ""Суммы до""";
		Сообщение.Поле = "СуммаОт";
		Сообщение.УстановитьДанные(ЭтаФорма);
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат Отказ;
	КонецЕсли;
	
	Если Объект.Группа = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Значение ""Группа"" не может быть равным 0";
		Сообщение.Поле = "Группа";
		Сообщение.УстановитьДанные(ЭтаФорма);
		Сообщение.Сообщить();
		Отказ = Истина;
		Возврат Отказ;
	КонецЕсли;

	Возврат Отказ;
	
КонецФункции

#КонецОбласти

