
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ИмяАналитики = ПолучитьИмяАналитики(ПараметрКоманды);
	
	ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Владелец",ПараметрКоманды));
	ОткрытьФорму(ИмяАналитики+".ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

&НаСервере
Функция ПолучитьИмяАналитики(Аналитика) 
	ТекТип = Аналитика.ТипЗначения.Типы()[0];
	ИмяАналитики = Метаданные.НайтиПоТипу(ТекТип).ПолноеИмя();
	Возврат ИмяАналитики;
КонецФункции	

