
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		Контрагенты.ЗагрузитьЗначения(Объект.Партнеры.Выгрузить().ВыгрузитьКолонку("Контрагент"));

КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.Партнеры.Очистить();
	
	Для каждого Строка Из Контрагенты цикл
		новСтрока = ТекущийОбъект.Партнеры.Добавить();
		новСтрока.Контрагент = Строка.Значение;
		новСтрока.Партнер = Строка.Значение.Партнер;
	КонецЦикла;

КонецПроцедуры
