
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(РолиПользователей, "Роль", Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура РолиПользователейПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,"Необходимо сперва записать роль!",,"Предупреждение");
	Иначе
		ОткрытьФорму("РегистрСведений.РолиПользователей.ФормаЗаписи", Новый Структура("Роль", Объект.Ссылка)); КонецЕсли;
	
КонецПроцедуры
