&НаСервере
Функция ОбновитьСтатусы(Дата)
	
	Возврат РегистрыСведений.СрезЗадачПоДням.ОбновитьСтатусыВсехЗадач(Дата);
	
КонецФункции
&НаКлиенте
Процедура ПользовательРешил(Дата, ДополнительныеПараметры) Экспорт
	
	Если Дата <> Неопределено Тогда
		
		текДата = ТекущаяДата();
		Если ОбновитьСтатусы(Дата) Тогда
			ОбщиеФункции.СообщитьТекст("Обновление заверешено сек: " + Строка(ТекущаяДата() - текДата)); КонецЕсли; КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПоказатьВводДаты(Новый ОписаниеОповещения("ПользовательРешил", ЭтотОбъект),,"День с которого обновить статусы до сегодня", ЧастиДаты.Дата);
	
КонецПроцедуры
