
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Ссылка") И ТипЗнч(Параметры.Ссылка) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда 
		Возврат;
	Иначе 
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(Перечисления.ВариантДоставки.ДоставкаДоГрузоперевозчика,  Строка(Перечисления.ВариантДоставки.ДоставкаДоГрузоперевозчика));
		ДанныеВыбора.Добавить(Перечисления.ВариантДоставки.ДоставкаДоКлиента, Строка(Перечисления.ВариантДоставки.ДоставкаДоКлиента));
		ДанныеВыбора.Добавить(Перечисления.ВариантДоставки.ДоставкаДоКлиентаНашимиСилами, Строка(Перечисления.ВариантДоставки.ДоставкаДоКлиентаНашимиСилами));
		ДанныеВыбора.Добавить(Перечисления.ВариантДоставки.СамовывозСНашегоСклада, Строка(Перечисления.ВариантДоставки.СамовывозСНашегоСклада));
	КонецЕсли;
	
КонецПроцедуры
