

Функция ВернутьОшибку_ст(Ответ, стрОшибки)
	
	//Ответ.КодСостояния = 500;
	//Ответ.УстановитьТелоИзСтроки(стрОшибки);
	//
	//Возврат Ответ;
	
КонецФункции

Функция ПолучитьПередачиТовараPOST(Запрос)
	
	Rest.ЛогЗапроса(Запрос,,РегистрыСведений.ЛогМатаМата);
	
	Ответ = МатаМата.ПолучитьПередачиТовараPOST(Запрос);
	
	Rest.ЛогОтвета(Ответ,,РегистрыСведений.ЛогМатаМата);
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьПередачиТовараPOST_ст(Запрос)

КонецФункции
Функция ПолучитьСсылкуСправочника_Ст(Менеджер, Структура, стрОшибки = "")
	
	//Ссылка = Менеджер.ПолучитьСсылку(Новый УникальныйИдентификатор(Структура.Ссылка));
	//Если Ссылка.ПолучитьОбъект() = Неопределено Тогда
	//	
	//	СпрОбъект = Менеджер.СоздатьЭлемент();
	//	СпрОбъект.Наименование = Структура.Наименование;
	//	Если ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(СпрОбъект,,стрОшибки, Ложь) Тогда
	//		Возврат СпрОбъект.Ссылка КонецЕсли;
	//	
	//Иначе
	//	
	//	Возврат Ссылка; КонецЕсли;
	
КонецФункции

