 &НаКлиенте
Процедура ОбщиеРеквизитыНажатие(Элемент)
	
	ФункцииФормДокументов.ОткрытьОбщиеРеквизитыБП(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюДоступностью()
	
	Текст = "
	|<HTML><HEAD>
	|<META content=""text/html; charset=utf-8"" http-equiv=Content-Type>
	|<META name=GENERATOR content=""MSHTML 8.00.7600.16588"">
	|<style>* {margin: 0;padding: 0;}</style>
	|</HEAD>
	|<body bgcolor=""#FCFAEB"">
	|";
	
	Если Объект.ЗаказНаряд.Пустая() Тогда
		
		Текст = Текст + "нет заказ наряда";
	Иначе
		
		Если Объект.ЗаказНаряд.Проведен Тогда
			
			Запрос = Новый Запрос("
			|ВЫБРАТЬ Сумма, Скидка, Сумма(Работ) Работ, Сумма(Запчастей) Запчастей ИЗ (
			|ВЫБРАТЬ Ссылка.Сумма Сумма, Ссылка.Скидка Скидка, СУММА(Сумма) Работ,0 Запчастей ИЗ Документ.ЗаказНаряд.Работы ГДЕ Ссылка = &Заказ СГРУППИРОВАТЬ ПО Ссылка
			|ОБЪЕДИНИТЬ
			|ВЫБРАТЬ Ссылка.Сумма, 0, Ссылка.Скидка Скидка, СУММА(Сумма) ИЗ Документ.ЗаказНаряд.Запчасти ГДЕ Ссылка = &Заказ СГРУППИРОВАТЬ ПО Ссылка
			|) ЗАПРОС СГРУППИРОВАТЬ ПО Сумма, Скидка");
			
			Запрос.УстановитьПараметр("Заказ", Объект.ЗаказНаряд);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Текст = Текст + "Всего <B>" + Выборка.Сумма + "</B> <small>(работ <B>" + Выборка.Работ + "</B> запчастей <B>" + Выборка.Запчастей + "</B></small>)";
			КонецЕсли;
			
			Если	
				Объект.ОтветМенеджера = 1 Тогда
				Текст = Текст + ". Предоплата";
			ИначеЕсли
				Объект.ОтветМенеджера = 2 Тогда
				Текст = Текст + ". Отсрочка оплаты";
			КонецЕсли;
			
		Иначе
			
			Текст = Текст + "заказ не проведен";
			
		КонецЕсли;
	КонецЕсли;
	
	ИтогоHTML = Текст + "</BODY></HTML>"; 
	Элементы.Комментарии.Видимость = НЕ ПустаяСтрока(Комментарии);	
	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
																	
	ЗадачиПроцесса.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
			
	// Прочитаем комментарии
		
	Комментарии = ФункцииБизнесПроцессов.ПолучитьТекстКомментариевHTML(Объект.Ссылка);

	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = СобытияСистемы.Событие_ЗаписанаЗадача() Тогда
		
		БизнесПроцессЗадачи = Неопределено;
		Если Параметр.Свойство("БизнесПроцесс", БизнесПроцессЗадачи) Тогда
			
			Если БизнесПроцессЗадачи = Объект.Ссылка Тогда
				
				Прочитать();
				УправлениеВидимостьюДоступностью();
				Элементы.ЗадачиПроцесса.Обновить();
				
			КонецЕсли;
		КонецЕсли;
				
	КонецЕсли;
	
КонецПроцедуры


