
Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос(
	
	// ПАРАМЕТРЫ СИСТЕМЫ
	
	КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() + "
	|;
	
	// ШАПКА

	|ВЫБРАТЬ
	|	Процесс
	|ИЗ
	|	Документ.ПеремещениеДС
	|ГДЕ
	|	Ссылка = &Ссылка
	|;
	
	
	// ДЕНЕЖНЫЕ СРЕДСТВА
	
	|ВЫБРАТЬ
	|	&Период						Период,
	|	&ВидДвиженияРасход			ВидДвижения,
	|	КассаОтправитель 			Касса,
	|	Сумма
	|ИЗ
	|	Документ.ПеремещениеДС
	|
	|ГДЕ
	|	Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&Период						Период,
	|	&ВидДвиженияПриход			ВидДвижения,
	|	КассаПолучатель 			Касса,
	|	Сумма
	|ИЗ
	|	Документ.ПеремещениеДС
	|
	|ГДЕ
	|	Ссылка = &Ссылка
	|;
	// ОБОРОТЫ ДЕНЕЖНЫХ СРЕДСТВ
	
	|ВЫБРАТЬ
	|	&Период					КАК Период,
	|	Док.КассаПолучатель		КАК КассаСчет,
	|	Док.СтатьяДДС			КАК СтатьяДДС,
	|	ПодразделениеПолучатель Подразделение, 
	|   ОтделПолучатель Отдел,
	|   ОтделПолучатель ЦФУ,
	|	Док.Сумма				КАК Сумма, 
	|" + РаботаСКурсамиВалют.ПолучитьСуммуУпрВЗапросе("Док.Сумма","","ВалЦен.", "ВалУпр.") + " КАК СуммаУпр
	|                          
	|ИЗ
	|	Документ.ПеремещениеДС Док
	|	ЛЕВОЕ СОЕДИНЕНИЕ " + РаботаСКурсамиВалют.ПолучитьКурсыВалютВЗапросе("Док.КассаПолучатель.Валюта") + "
	|ГДЕ
	|	Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	 &Период				КАК Период,
	|	 Док.КассаОтправитель	КАК КассаСчет,
	|	 Док.СтатьяДДС			КАК СтатьяДДС,
	|	ПодразделениеОтправитель, 
	|   ОтделОтправитель,
	|   ОтделОтправитель,
	|	-Док.Сумма				КАК Сумма,
	|" + РаботаСКурсамиВалют.ПолучитьСуммуУпрВЗапросе("-Док.Сумма","","ВалЦен.", "ВалУпр.") + " КАК СуммаУпр
	|                          
	|ИЗ
	|	Документ.ПеремещениеДС Док
	|	ЛЕВОЕ СОЕДИНЕНИЕ " + РаботаСКурсамиВалют.ПолучитьКурсыВалютВЗапросе("Док.КассаОтправитель.Валюта") + "
	|ГДЕ
	|	Ссылка = &Ссылка
	|");
	
	//Запрос.УстановитьПараметр("Область", 			ПараметрыСеанса.ТекущаяОбласть);
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("Период", 			Ссылка.Дата);
	Запрос.УстановитьПараметр("ВидДвиженияПриход", 	ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("ВидДвиженияРасход", 	ВидДвиженияНакопления.Расход);	
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ДополнительныеСвойства.Вставить("ПараметрыСистемы", КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[0].Выгрузить()));
	ДополнительныеСвойства.Вставить("Шапка", 			КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[1].Выгрузить()));
	ДополнительныеСвойства.Вставить("ДенежныеСредства",	Пакет[2].Выгрузить());
	ДополнительныеСвойства.Вставить("ОборотыДенежныхСредств",	Пакет[3].Выгрузить());

	
КонецПроцедуры
