Функция ПолучитьКассуСписания() Экспорт Возврат КассаОтправитель КонецФункции

// ПРЕДОПРЕДЕЛЕННЫЕ ФУНКЦИИ

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Подготовка
	
	Заголовок = КонтрольПроведения.ПолучитьСтандарнтыйЗаголовокПриПроведенииДокумента(Ссылка);
	
	Документы[Метаданные().Имя].ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Проведение
	
	ПроведенияДокументов.ПровестиПоВсемРегистрам(Метаданные().Движения, ДополнительныеСвойства, Движения, Отказ);
	
	// Запишем
	
	Движения.Записать();
	
	// Контроль
	
	КонтрольПроведения.ПроверитьДенежныеСредства(ЭтотОбъект, КассаОтправитель, Отказ, Заголовок);
		
КонецПроцедуры
