
Функция ПолучитьТекстПомощиРедактированияВыражения()
	
	Возврат "
	|Объект 			- новый или изменяемый объект текущей базы
	|СтрокаПриемника 	- строка таблицы нового объекта если это перебор строк
	|Выборка 			- выборка из объекта из COM базы у установленная на текущей строке объекта
	|СтрокаИсточника	- строка выборки источника COM базы если это перебор строк
	|Изменился 			- булево, если объект нужно записать то нужно установить ее в ИСТИНА
	|Connector			- COM соединение 81
	|стрОшибки			- текст, в него можно вернуть выражение об ошибке если она произойдет
	|";

	
КонецФункции

&НаСервере
Процедура ДобавитьРеквизитыНаСервере()
	
	стрОшибки = "";
	МетаОб = COMServer.ПолучитьМетаОбъектПоПравилу(Новый Структура("ИмяПриемника", Объект.ИмяПриемника), , стрОшибки);
	Если МетаОб = Неопределено Тогда
		
		ОбщиеФункции.СообщитьТекст(стрОшибки);
		Возврат;
		
	КонецЕсли;
	
	Для Каждого Реквизит Из МетаОб.Реквизиты Цикл
		Если Не Объект.РеквизитыКЗагрузке.НайтиСтроки(Новый Структура("ИмяПриемника", реквизит.Имя)).Количество() Тогда
		
			НовСтрока = Объект.РеквизитыКЗагрузке.Добавить();
			НовСтрока.ИмяПриемника = реквизит.Имя;
			НовСтрока.ИмяИсточника = реквизит.Имя;
			
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Таблица Из МетаОб.ТабличныеЧасти Цикл
		Для Каждого Реквизит Из Таблица.реквизиты Цикл
			
			имя = Таблица.Имя + "." + Реквизит.Имя;
			
			Если Не Объект.РеквизитыКЗагрузке.НайтиСтроки(Новый Структура("ИмяПриемника", имя)).Количество() Тогда
		
				НовСтрока = Объект.РеквизитыКЗагрузке.Добавить();
				НовСтрока.ИмяПриемника = имя;
				НовСтрока.ИмяИсточника = имя;
				
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры
&НаКлиенте
Процедура ДобавитьРеквизиты(Команда)
	
	ДобавитьРеквизитыНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыражениеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.РеквизитыКЗагрузке.ТекущиеДанные;
	
	ОткрытьФорму("ОбщаяФорма.РедактированияВыражения", 
	                  Новый Структура("Выражение, ТекстПомощи", 
					  	 ТекДанные.Выражение, 
						 ПолучитьТекстПомощиРедактированияВыражения()), 
					Элемент);
					
КонецПроцедуры

&НаКлиенте
Процедура ВыражениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если 	ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда
		
		ТекДанные = Элементы.РеквизитыКЗагрузке.ТекущиеДанные;
		ТекДанные.Выражение = ВыбранноеЗначение;
		
	КонецЕсли;

КонецПроцедуры
