
&НаСервере
Функция ПолучитьТабличныейДокументПрезентации(СсылкиДоков)
	
	Перем МассивДоков;
	
	// Вытащим запросы из доков
	
	ВидыДоков 	= Новый Структура;
	Запрос 		= Новый Запрос;
	Текст		= "";
	стВидДока 	= "";
	
	// Для каждого вида дока запомним его параметры
	
	Для Каждого Ссылка Из СсылкиДоков ЦИкл
		
		ИмВидДока = Ссылка.Метаданные().Имя;
		
		Если ВидыДоков.Свойство(ИмВидДока) Тогда
			
			Если стВидДока <> ИмВидДока Тогда
				ВидыДоков[стВидДока] = МассивДоков;
				МассивДоков = ВидыДоков.ИмВидДока; КонецЕсли;
		Иначе 
			Текст = Текст + "
			|" + ?(Текст = "","","ОБЪЕДИНИТЬ") + "
			|" + СтрЗаменить(Ссылка.ПолучитьОбъект().ПолучитьТекстЗапросаПолученияСпискаТоваров(), "Ссылка = &ДокументСсылка", "Ссылка В(" + "&Ссылка" + ИмВидДока + ")");
			
			МассивДоков = Новый Массив; 
			ВидыДоков.Вставить(ИмВидДока, МассивДоков); КонецЕсли; 
		
		МассивДоков.Добавить(Ссылка);
		стВидДока = ИмВидДока; КонецЦикла;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ Номенклатура ИЗ (" + Текст + ") Запрос УПОРЯДОЧИТЬ ПО Номенклатура.Артикул";
	
	// Установим параметры
	
	Для Каждого ВИд Из ВидыДоков Цикл Запрос.УстановитьПараметр("Ссылка" + Вид.Ключ, ВИд.Значение) КонецЦикла;
	
	// Выполним и вернем
	
	Возврат РаботаСНоменклатурой.ПолучитьТабличныйДокументПрезентации(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура"));
	
КонецФункции

//////////////////////////////ХТМЛ\\\\\\\\\\\\\\\\\\\\\\\\\
&НаСервере
Функция ПолучитьДанныеОНоменклутареДляПрезентацииХТМЛ(СсылкиДоков)
	
	Перем МассивДоков;
	
	// Вытащим запросы из доков	
	ВидыДоков 	= Новый Структура;
	Запрос 		= Новый Запрос;
	Текст		= "";
	стВидДока 	= "";
	
	// Для каждого вида дока запомним его параметры
	Для Каждого Ссылка Из СсылкиДоков ЦИкл	
		ИмВидДока = Ссылка.Метаданные().Имя;
		Если ВидыДоков.Свойство(ИмВидДока) Тогда
			Если стВидДока <> ИмВидДока Тогда
				ВидыДоков[стВидДока] = МассивДоков;
				МассивДоков = ВидыДоков.ИмВидДока; 
			КонецЕсли;
		Иначе 
			Текст = Текст + "
			|" + ?(Текст = "","","ОБЪЕДИНИТЬ") + "
			|" + СтрЗаменить(Ссылка.ПолучитьОбъект().ПолучитьТекстЗапросаПолученияСпискаТоваров(), "Ссылка = &ДокументСсылка", "Ссылка В(" + "&Ссылка" + ИмВидДока + ")");
			МассивДоков = Новый Массив; 
			ВидыДоков.Вставить(ИмВидДока, МассивДоков); 
		КонецЕсли; 
		МассивДоков.Добавить(Ссылка);
		стВидДока = ИмВидДока; 
	КонецЦикла;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ Номенклатура ИЗ (" + Текст + ") Запрос УПОРЯДОЧИТЬ ПО Номенклатура.Артикул";	
	// Установим параметры
	Для Каждого ВИд Из ВидыДоков Цикл 
		Запрос.УстановитьПараметр("Ссылка" + Вид.Ключ, ВИд.Значение) 
	КонецЦикла;
	// Выполним и вернем
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
КонецФункции	

&НаСервере
Функция ПолучитьТекстХТМЛДокументаПрезентации(СсылкиДоков)
	ГоловаХТМЛ = "<html><head>
	|<title>%Титл%</title>
	|<meta charset=""UTF-8"" />
	|</head><body>
	|<style>
	|			@font-face {
	|				font-family:""Verdana"";
	|				src:url(""http://garagetools.ru/assets/jv10-7a389b22ade2822c1e92c5d3b2678df7.eot"");
	|			}
	|
	|			body {
	|				margin: 0;
	|				padding: 0;
	|			}
	|
	|			#newGoods {
	|				font-size: 46;
	|				display: inline;
	|				background-color: white;
	|				border: 4px solid green;
	|				-webkit-border-radius: 3px;
	|				-moz-border-radius: 3px;
	|				border-radius: 3px;
	|			}
	|
	|			.exportList div, a, span, img, ul, li, table, td, tr, th {
	|				font-family: ""jv10"";
	|				margin: 0;
	|				padding: 0;
	|				border: 0;
	|				border-collapse: collapse;
	|			}
	|
	|			.leftAlignedImg {
	|				position: absolute;
	|				left: 0px;
	|			}
	|
	|			.rightAlignedImg {
	|				position: absolute;
	|				right: 0px;
	|			}
	|
	|			.exportHeaderTable {
	|				width: 950px;
	|				border-bottom: 4px solid green;
	|			}
	|
	|			.exportHeaderTable td {
	|				vertical-align: middle;
	|			}
	|
	|			.exportContentTable {
	|				width: 950px;
	|				border-collapse: separate;
	|			}
	|
	|			.exportContentTable td {
	|				height: 120px;
	|				text-align: center;
	|			}
	|
	|			.exportContentTable tr:nth-child(odd) {
	|				background-color: #e7ebea;
	|			}
	|
	|			.exportContentTable tr:nth-child(even) {
	|				background-color: #fcfcfc;
	|			}
	|
	|			.exportContentTable img {
	|				max-height: 120px;
	|				max-width: 120px;
	|			}
	|
	|			.firstTD, .secondTD {
	|				width: 120px;
	|			}
	|
	|			.thirdTD {
	|				width: 600px;
	|			}
	|
	|			.fourthTD {
	|				width: 110px;
	|			}
	|
	|			.tableDiv {
	|				display: inline-block;
	|				border-collapse: collapse;
	|				height: 120px;
	|				vertical-align: middle;
	|				display: table-cell;
	|				text-align: center;
	|				border: 0px solid white;
	|			}
	|
	|			.wideRow .leftTableDiv {
	|				width: 600px;
	|				
	|			}
	|
	|			.wideRow .rightTableDiv {
	|			width: 0px;
	|				display: none;
	|				
	|			}
	|
	|			.thinRow .tableDiv {
	|				width: 300px;
	|				    
	|			}
	|		</style>
	|<div class=""exportList"">
	|<div class=""header"">
	|	<table class=""exportHeaderTable"">
	|		<tr>
	|			<td>
	|				<a href=""http://garagetools.ru""><img src=""http://garagetools.ru/assets/app/logo-28906792034009d2b4bfb12cf798dc9f.png"" style=""margin-left: -20px; margin-top: 10px;""></a>
	|			</td>
	|			<td>
	|			</td>
	|			<td style=""text-align: right;"">
	|				<p id=""newGoods"">НОВИНКИ</p>
	|			</td>
	|		</tr>
	|		<tr>
	|			<td style=""height: 12px;"">
	|			</td>
	|			<td style=""height: 12px;"">
	|			</td>
	|			<td style=""height: 12px;"">
	|			</td>
	|		</tr>
	|	</table>
	|</div>
	|<div class=""exportContent"">
	|	<table class=""exportContentTable"">";
	
	wideRow = "<tr class=""wideRow"" style=""BACKGROUND-COLOR: #e7ebea"">
	|			<td class=""firstTD""><a href=""#""><img src=""%Картинка%""/></a></td>
	|			<td class=""secondTD"">%Артикул%</td>
	|			<td class=""thirdTD"">
	|				<div class=""leftTableDiv tableDiv"">%Номенклатура%</div>
	|				<div class=""rightTableDiv tableDiv"">%Описание%<!--Второй див здесь не видно - у него стоит display: none--></div>
	|		   </td>
	|	       <td class=""fourthTD"">%Цена%</td>
	|          </tr>";
	
	thinRow = "<tr class=""thinRow"">
	|			<td class=""firstTD""><a href=""#""><img src=""%Картинка%""/></a></td>
	|			<td class=""secondTD"">%Артикул%</td>
	|			<td class=""thirdTD"">
	|				<div class=""leftTableDiv tableDiv"">%Номенклатура%</div>
	|				<div class=""rightTableDiv tableDiv"">%Описание%</div>
	|			</td>
	|			<td class=""fourthTD"">%Цена%</td>
	|			</tr>";
	
	ПодвалХТМЛ = "</table></div></div></body></html>";
	/////////////////////////////////////////////////////////////////////////////
	ТипЦенРозница = ОбщиеФункции.ПолучитьЗначениеКонстантыВОбласти("типЦенРозница");
	Валюта = ТипЦенРозница.Валюта;
	СписокНоменклатуры = ПолучитьДанныеОНоменклутареДляПрезентацииХТМЛ(СсылкиДоков);
	
	ТекстХТМЛ = ГоловаХТМЛ; 
	Счетчик = 0;
	
	Для каждого Номенклатура Из СписокНоменклатуры Цикл
		Артикул = Номенклатура.Артикул;
		Описание = Номенклатура.Описание;
		Наименование = Строка(Номенклатура);
		//СсылкаНаКартинку = Картинки.ПолучитьСсылкуОсновногоИзображения(Номенклатура);
		//Картинка = ?(СсылкаНаКартинку = Неопределено, БиблиотекаКартинок.НетФото, ?(СсылканаКартинку.КопияКартинки.Пустая(), СсылкаНаКартинку.Аватар.Получить(), СсылкаНаКартинку.КопияКартинки.Аватар.Получить()));
		//Изображение = Картинки.ПолучитьURLКартинкиВОблаке_ПоКартинке(Картинка, Истина);
		Изображение = Картинки.ПолучитьURLКартинкиВОблаке(Номенклатура.Ссылка, Истина);
		Цена = Формат(РаботаСНоменклатурой.ПолучитьЦену(Номенклатура, ТипЦенРозница), "ЧЦ=15; ЧДЦ=2") + Символы.ПС + Строка(Валюта);
		//////////////////////
		Если (Счетчик / 2 - Цел(Счетчик / 2)) = 0 Тогда
			СтрокаХТМЛ = wideRow;
		Иначе
			СтрокаХТМЛ = thinRow;
		КонецЕсли;
		СтрокаХТМЛ = СтрЗаменить(СтрокаХТМЛ, "%Номенклатура%", Наименование);
		СтрокаХТМЛ = СтрЗаменить(СтрокаХТМЛ, "%Артикул%", Артикул);
		СтрокаХТМЛ = СтрЗаменить(СтрокаХТМЛ, "%Описание%", Описание);
		СтрокаХТМЛ = СтрЗаменить(СтрокаХТМЛ, "%Картинка%", Изображение);
		СтрокаХТМЛ = СтрЗаменить(СтрокаХТМЛ, "%Цена%", Цена);
		ТекстХТМЛ = ТекстХТМЛ + СтрокаХТМЛ;
		Счетчик = Счетчик + 1;
	КонецЦикла;
	ТекстХТМЛ = ТекстХТМЛ + ПодвалХТМЛ;
	Возврат ТекстХТМЛ;
КонецФункции
///////////////////////////////\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\

&НаСервере
Функция ПолучитьПараметрыДляПДФДокумента(Ссылки, СтрНомера = "")
	
	Возврат Заказы.ПолучитьПараметрыДляТабличногоДокумента(Ссылки, СтрНомера);
	
КонецФункции


&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//Партнер = Неопределено; Номер = Неопределено;
	//ДопПараметры = Новый Массив;
	//ДопПараметры.Добавить(Новый Структура("Партнер", Партнер));
	
	///Отключить
	//ОткрытьФорму("ОбщаяФорма.ТабличныйДокумент", 
	//Новый Структура("ТабличныйДокумент, ИмяФайла, ДополнительныеПараметры", 
	//ПолучитьТабличныейДокументПрезентации(ПараметрКоманды),
	//"Презентация", 
	//ДопПараметры), ЭтаФорма);
	//));
	///Отключить
	ДополнительныеПараметры = ПолучитьПараметрыДляПДФДокумента(ПараметрКоманды);
	ОткрытьФорму("ОбщаяФорма.ФормаПрезентации", Новый Структура("ТекстХТМЛ, ДополнительныеПараметры", ПолучитьТекстХТМЛДокументаПрезентации(ПараметрКоманды), ДополнительныеПараметры), ЭтотОбъект,,,,,);
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
