&НаКлиенте
Процедура ПосмотретьДатыПрибытия(Команда)
	
	ОткрытьФорму("Отчет.Новинки.ФормаОбъекта", 
			Новый Структура("СформироватьПриОткрытии, Отбор, ИсточникДоступныхНастроек",
					Истина,
					Новый Структура("МассивТоваров", Товары),
					//Новый ИсточникДоступныхНастроекКомпоновкиДанных(ПолучитьСхемуНовинок())),
					),
			ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Загрузим переданные товары
	
	Товары.ЗагрузитьЗначения(ПолучитьИзВременногоХранилища(Параметры.МассивТоваров));
	Для Каждого Элемент Из Товары Цикл ТоварСтр = ТоварСтр + ?(ТоварСтр = "","","; ") + Элемент.Значение.Артикул + " " + Строка(Элемент.Значение) КонецЦикла;
	
	// Отсеем товары которые уже есть в других новинках
	
	Запрос = Новый Запрос("ВЫБРАТЬ Ссылка, Номенклатура, Номенклатура.Артикул Артикул ИЗ Справочник.Новинки.Товары ГДЕ Номенклатура В(&Товары)");
	Запрос.УстановитьПараметр("Товары", Товары.ВыгрузитьЗначения());
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Товары.Удалить(Товары.НайтиПоЗначению(Выборка.Номенклатура));
		ОбщиеФункции.СообщитьТекст(Выборка.Артикул + " " + Строка(Выборка.Номенклатура) + " - такой товар уже есть в новинке " + Строка(Выборка.Ссылка)); КонецЦикла;
	
	// Установим настройки
	
	ПериодДействия = ТекущаяДата();
		
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Не Товары.Количество() Тогда
		Отказ = Истина;
		ПоказатьОповещениеПользователя("Нет новинок",,"Нет ни одного товара которого можно добавить в новинки", БиблиотекаКартинок.Олень); КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВТаблицуСправочника(СпрОбъект)
	
	Для Каждого Элемент Из Товары Цикл
		НовСтр = СпрОбъект.Товары.Добавить();
		НовСтр.Номенклатура 	= Элемент.Значение;
		НовСтр.ПериодДействия 		= ПериодДействия; КонецЦикла;
	
КонецПроцедуры
&НаСервере
Функция СоздатьНовинкуНаСервере()
	
	// Проверим
	
	Если ПустаяСтрока(НаименованиеНового) Тогда 
		ОбщиеФункции.СообщитьТекст("Не заполнено название новинок", "НаименованиеНового"); Возврат Ложь; КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 ИСТИНА ИЗ Справочник.Новинки ГДЕ Наименование = """ + СокрЛП(НаименованиеНового) + """");
	Если Не Запрос.Выполнить().Пустой() Тогда
		ОбщиеФункции.СообщитьТекст("Новинка с таким названием существует", "НаименованиеНового"); Возврат Ложь; КонецЕсли;
	
	// Создадим новый
	
	НовСпр = Справочники.Новинки.СоздатьЭлемент();
	//НовСпр.ДатаНовинок 	= ДатаНовинки;
	НовСпр.Наименование = НаименованиеНового;
	
	ДобавитьВТаблицуСправочника(НовСпр);

	Возврат ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(НовСпр);
	
КонецФункции
&НаКлиенте
Процедура СоздатьНовинку(Команда)
	
	Если СоздатьНовинкуНаСервере() Тогда Закрыть() КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СохранитьВНовинку(СпрСсылка)
	
	СпрОбъект = СпрСсылка.ПолучитьОбъект();
	ДобавитьВТаблицуСправочника(СпрОбъект);
	
	Возврат ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(СпрОбъект);
	
КонецФункции
&НаКлиенте
Процедура НовинкиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	  Если СохранитьВНовинку(ВыбраннаяСтрока) Тогда Закрыть() КонецЕсли;
	
КонецПроцедуры

