Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос(
	         
	КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() + "
	|;
	
	// ШАПКА
	
	|ВЫБРАТЬ
	|	Автор, Ответственный, Сотрудник
	|ИЗ
	|	Документ.ПризовыеОчки
	|ГДЕ
	|	Ссылка = &Ссылка
	|;
	
	|ВЫБРАТЬ
	|	Ссылка.Месяц Период, &ВидДвиженияПриход ВидДвижения, Ссылка.Отдел Отдел, Ссылка.Подразделение Подразделение, Ссылка.Сотрудник, Количество
	|ИЗ 
	|	Документ.ПризовыеОчки.Очки 
	|ГДЕ 
	|	Ссылка = &Ссылка
	|;
	|ВЫБРАТЬ
	|	Ссылка.Месяц Период, Ссылка.Отдел Отдел, Ссылка.Подразделение Подразделение, Ссылка.Сотрудник, ВидОчков, Количество
	|ИЗ 
	|	Документ.ПризовыеОчки.Очки 
	|ГДЕ 
	|	Ссылка = &Ссылка
	|");
	

	//Запрос.УстановитьПараметр("Область", 		ПараметрыСеанса.ТекущаяОбласть);
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("ВидДвиженияПриход", 	ВидДвиженияНакопления.Приход);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ДополнительныеСвойства.Вставить("ПараметрыСистемы", 		КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[0].Выгрузить()));
	ДополнительныеСвойства.Вставить("Шапка", 					КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[1].Выгрузить()));
	
	ДополнительныеСвойства.Вставить("ПризовыеОчки", Пакет[2].Выгрузить());
	ДополнительныеСвойства.Вставить("ОборотыПоПризовымОчкам", Пакет[3].Выгрузить());
	
	                       
КонецПроцедуры
