
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		Структура = Новый Структура("Договор", ПараметрКоманды);
	
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Контрагенты") Тогда
		Структура = Новый Структура("Контрагент", ПараметрКоманды); 
	
	
	Иначе
		
		ВызватьИсключение "Нет обработчика для данного типа объекта"; КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.ПечатьДокументовВорд", Структура, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
