
Процедура СформироватьОтчет(ТабДок, мИдентификаторФормы, мДанныеРасшифровки) Экспорт
	
	ОсновнаяСхема = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	ДанныеРасшифровкиКомпоновки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	ПараметрыОтчета = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(ОсновнаяСхема, КомпоновщикНастроек.Настройки, ДанныеРасшифровкиКомпоновки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, , ДанныеРасшифровкиКомпоновки, Истина); 
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабДок);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Адрес = ПоместитьВоВременноеХранилище(ДанныеРасшифровкиКомпоновки, мИдентификаторФормы);
	мДанныеРасшифровки = Адрес;
	
КонецПроцедуры
