

Процедура ПриЗаписи(Отказ, Замещение)
	
	// Заполним значениями по умолчнию товар если там его не будет
	
	Если 	НЕ ПараметрыСеанса.КонтрольОстатковВСеансеОтключен И 
			Не ОбменДанными.Загрузка И 
			Количество() И 
			ЗначениеЗаполнено(Отбор.Номенклатура.Значение) Тогда
		
		Изменился = Ложь;
		СпрОбъект = Отбор.Номенклатура.Значение.ПолучитьОбъект();
		
		Для Каждого Запись Из ЭтотОбъект Цикл
			
			РегистрыСведений.НоменклатураПартнеров.ПроверитьИУстановитьСоответвияРеквизитовСправочникаРегиструНоНеЗаписывать(СпрОбъект, Запись, Изменился);
			
			// Если основной остальные нас не интересуют
			
			Если Запись.Основной Тогда Прервать КонецЕсли; КонецЦикла;
			
		// Запишем
			
		Если Изменился И Не ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(СпрОбъект) Тогда
			Отказ = Истина; КонецЕсли; КонецЕсли;
	
КонецПроцедуры
