
&НаСервере
Процедура СоздатьНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПодарочныеКарты.Наименование
	               |ИЗ
	               |	Справочник.ПодарочныеКарты КАК ПодарочныеКарты
	               |ГДЕ
	               |	ПодарочныеКарты.Номинал = &Номинал
	               |	И ПодарочныеКарты.ПорядковыйНомер МЕЖДУ &НомерНачала И &НомерКонца";
	Запрос.УстановитьПараметр("Номинал",Номинал);
	Запрос.УстановитьПараметр("НомерНачала",НомерОт);
	Запрос.УстановитьПараметр("НомерКонца",НомерДо);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Количество()>0 Тогда
		Пока Результат.Следующий() Цикл
			Сообщить("Карта в диапазоне уже существует: "+Результат.Наименование);
		КонецЦикла;
		Сообщить("Создание новых карт невозможно, т.к. в данном диапазоне уже есть созданные карты");
		Возврат;
	КонецЕсли;
	
	Для п=НомерОт По НомерДо Цикл
		НовКарта = Справочники.ПодарочныеКарты.СоздатьЭлемент();
		НовКарта.Номинал = Номинал;
		НовКарта.ПорядковыйНомер = п;
		НовКарта.Наименование = Справочники.ПодарочныеКарты.СформироватьНаименование(НовКарта);
		НовКарта.СтатусКарты = Перечисления.ПодарочныеКарты_Статус.Создана;
		НовКарта.ДатаСоздания = ТекущаяДата();
		НовКарта.Записать();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	Если НомерОт=0 или НомерДо=0 или Номинал.Пустая() Тогда
		ПоказатьПредупреждение(,"Все поля обязательны для заполнения");
		Возврат;
	КонецЕсли;
	СоздатьНаСервере();
КонецПроцедуры

