
Функция ПолучитьИдентификаторАвторизации(ИмяПользователя, Пароль) Экспорт
	
	ФайлИд 		= ПолучитьИмяВременногоФайла();                 
	Соединение 	= Новый HTTPСоединение("www.google.com", , , , , Истина);
	HTTPЗапрос 	= Новый HTTPЗапрос("accounts/ClientLogin?accountType=GOOGLE&service=writely&source=1C&Email=" + ИмяПользователя + "&Passwd=" +  Пароль);
	
	Попытка HTTPОтвет = Соединение.Получить(HTTPЗапрос);
	Исключение 
		стрОшибки = ОписаниеОшибки();
		ОбщиеФункции.СообщитьТекст("Не удалось подключится к серверу google
											|" + стрОшибки);
		Возврат Неопределено; КонецПопытки;
	
	Возврат СтрПолучитьСтроку(HTTPОтвет.ПолучитьТелоКакСтроку(), 3);
	
КонецФункции
