
&НаСервере
Процедура ПровестиНаСервере(ОтключитьИтоги)
	
	Поток.ЗапуститьПоток("ПартионныйУчет.РассчитатьПартии('"+Формат(Период.ДатаНачала,"ДФ=yyyyMMdd")+"','"+Формат(Период.ДатаОкончания,"ДФ=yyyyMMdd")+"',"""+ИмяФормы+""",Параметры.ОтключитьИтоги)",УникальныйИдентификатор,Новый Структура("ОтключитьИтоги",ОтключитьИтоги));
	
КонецПроцедуры


&НаКлиенте
Процедура Провести(Команда)
	
	ПодключитьОбработчикОжидания("ПоказатьТекущееСостояние",1);
	ПровестиНаСервере(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиБезОтключенияИтогов(Команда)
	
	ПодключитьОбработчикОжидания("ПоказатьТекущееСостояние",1);
	ПровестиНаСервере(Ложь);
	
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьТекущееСостояние()
	СтруктураВозврата = ПоказатьТекущееСостояниеНаСервере(ИмяФормы);
	Прогресс=СтруктураВозврата.Прогресс;
	Сост=СтруктураВозврата.Состояние;
	Состояние(Сост,Прогресс);
	Если Лев(Сост,9)="Выполнено" Тогда
		ОтключитьОбработчикОжидания("ПоказатьТекущееСостояние");
		СброситьСчетчик(ИмяФормы);
		Сообщить(сост);
	КонецЕсли;	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоказатьТекущееСостояниеНаСервере(ИмяФормы)
	Возврат РегистрыСведений.ПрогрессБар.ПолучитьЗначение(ИмяФормы);
КонецФункции

&НаСервереБезКонтекста
Процедура СброситьСчетчик(ИмяФормы)
	 РегистрыСведений.ПрогрессБар.СброситьСчетчик(ИмяФормы);
КонецПроцедуры


&НаСервере
Процедура ПересчитатьИтогиНаСервере()
	// Вставить содержимое обработчика.
	РегистрыНакопления.ПартииТоваров.ПересчитатьИтоги();
КонецПроцедуры


&НаКлиенте
Процедура ПересчитатьИтоги(Команда)
	ПересчитатьИтогиНаСервере();
КонецПроцедуры


