//////////////УБРАТЬ НАХЕР!!!//////////////////
//Антон
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Список = СформироватьСписокОткрытия();
	Элементы.СрокПродленияРезерва.СписокВыбора.ЗагрузитьЗначения(Список);
КонецПроцедуры

&НаСервере
Функция СформироватьСписокОткрытия()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СрокиПродленияРезервов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СрокиПродленияРезервов КАК СрокиПродленияРезервов
	|ГДЕ
	|	СрокиПродленияРезервов.ПометкаУдаления = Ложь";
	Результат = Запрос.Выполнить().Выгрузить();
	Колонка = Результат.ВыгрузитьКолонку("Ссылка");
	Возврат Колонка;
КонецФункции   

&НаКлиенте
Процедура ПродлитьИЗакрыть(Команда)
	Если Не ЗначениеЗаполнено(СрокПродленияРезерва) Тогда
		Сообщить("Укажите срок!");
		Возврат;
	КонецЕсли;
	ПродлитьРезерв();
	Закрыть();
КонецПроцедуры
&НаСервере
Процедура ПродлитьРезерв()
	Таб = Новый ТаблицаЗначений;
	Таб.Колонки.Добавить("Заказ");
	Таб.Колонки.Добавить("ДатаСнятияРезерва");
	Таб.Колонки.Добавить("СрокПродления");
	/////
	Нстр = Таб.Добавить();
	Нстр.Заказ = Заказ;
	Нстр.ДатаСнятияРезерва = НоваяДатаАктуальностиРезерва;
	Нстр.СрокПродления = СрокПродления;
	/////
	ЗаписатьВРегистр(Таб);
КонецПроцедуры

&НаСервере
Процедура ЗаписатьВРегистр(ДанныеДляЗаписи)
	НаборЗаписей = РегистрыСведений.ОтсрочкаСнятияРезервов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Заказ.Установить(Заказ);
	НаборЗаписей.Загрузить(ДанныеДляЗаписи);
	НаборЗаписей.Записать();	
КонецПроцедуры

&НаКлиенте
Процедура СрокПродленияРезерваПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	УстановитьРекивизты(СрокПродленияРезерва);
КонецПроцедуры

&НаСервере
Процедура УстановитьРекивизты(СрокПродленияРезерва)
	НоваяДатаАктуальностиРезерва = ДатаАктуальностиРезерва + 60*60*24*СрокПродленияРезерва.Срок;
	//под вопросом
	СрокПродления = (НоваяДатаАктуальностиРезерва - ДатаАктуальностиРезерва)/60/60/24;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаАктуальностиРезерва = Параметры.ДатаАктуальностиРезерва;
	Заказ = Параметры.Заказ;
	///Проверим, а есть ли резерв вообще
	///Проверим, продлевался ли резерв
	Запрос = Новый Запрос("ВЫБРАТЬ
	|Отсрочка.Заказ,
	|Отсрочка.ДатаСнятияРезерва,
	|Отсрочка.СрокПродления
	|ИЗ
	|	РегистрСведений.ОтсрочкаСнятияРезервов КАК Отсрочка
	|ГДЕ
	|	Отсрочка.Заказ = &Заказ");
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Если НЕ Запрос.Выполнить().Пустой() Тогда
		///Тут что - то надо сделать
		Выборка = Запрос.Выполнить().Выбрать();
		Выборка.Следующий();
		СрокПродленияРезерва = Выборка.ДатаСнятияРезерва;
	КонецЕсли;
	
КонецПроцедуры

