
&НаСервере
Процедура ОбновитьНовости_Ст()
	
//	Текст 			= "";
//	Запрос 			= Новый Запрос("
//	//|ВЫБРАТЬ " + ?(НовостиНеБолее, "ПЕРВЫЕ " + Формат(НовостиНеБолее, "ЧГ="),"") + "
//	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ЕСТЬNULL(Отк.Отказ, ЛОЖЬ) Отказ, Ссылка, Текст, ЧистыйHTML, Автор, Дата, Вложения.(Ключ, Картинка) Вложения 
//	|ИЗ 		Документ.Новость Нов
//	|
//	|ЛЕВОЕ СОЕДИНЕНИЕ
//	|	РегистрСведений.ОтказанныеНовости.СрезПоследних(,Пользователь = &ТекущийПользователь) Отк
//	|ПО
//	|	Нов.Ссылка 	= Отк.Новость И
//	|	Отк.Отказ 	= Истина
//	|
//	|ГДЕ Проведен " + ?(ПоказатьВсеНовости, "", "И Отк.Новость ЕСТЬ NULL") + "
//	|УПОРЯДОЧИТЬ  ПО Дата Убыв
//	|");
//	
//	Запрос.УстановитьПараметр("ТекущийПользователь", ?(Пользователь.Пустая(), ПараметрыСеанса.ТекущийПользователь, Пользователь));
//	
//	Выборка 			= Запрос.Выполнить().Выбрать();
//	НовостейНет 		= Истина;
//	ГуидПользователя	= XMLСтрока(?(Пользователь.Пустая(), ПараметрыСеанса.ТекущийПользователь, XMLСтрока(Пользователь)));
//	
//	КолНовостей = Выборка.Количество();
//	Страниц 	= ?(НовостиНеБолее, Цел(КолНовостей / НовостиНеБолее) + ?(Цел(КолНовостей / НовостиНеБолее) <> КолНовостей / НовостиНеБолее, 1, 0), 0);
//	Если текНомСтраницы > Страниц Тогда текНомСтраницы = Страниц КонецЕсли;
//	
//	Инд = -1;
//	Пока Выборка.Следующий() Цикл НовостейНет = Ложь; Инд = Инд + 1;
//		Если Не НовостиНеБолее ИЛИ текНомСтраницы = Цел(Инд / НовостиНеБолее) + 1 Тогда
//		
//			Текст = Текст + "
//			
//			
//			|<div class=""polosa"">
//			|<font size=""2"" color=""white"">" + Формат(Выборка.Дата, "ДЛФ=DD") + "
//			|<font size=""2"" color=""CCFFFF"">" + Выборка.Автор + "</font></font>
//			
//			|<div style=""float:right; position: relative; top: -5px;"">" + ?(Выборка.Отказ, "
//			|<p align=""center""><input class='button' type=""button"" class=""knopka"" title=""Отображать новость при открытии новостей"" name=""v8:Кнопка:Показывать новость:" + XMLСтрока(Выборка.Ссылка) + ":" + ГуидПользователя + """ value=""не просмотрено"">
//			|","
//			|<p align=""center""><input class='button' type=""button"" class=""knopka"" title=""Если нет желания увидеть эту новость еще раз, то нажимай"" name=""v8:Кнопка:Отключить новость:" + XMLСтрока(Выборка.Ссылка) + ":" + ГуидПользователя + """ value=""просмотрено"">
//			//|<a href='v8:Кнопка:Показывать новость:" + XMLСтрока(Выборка.Ссылка) + ":" + ГуидПользователя + "' title=""Отображать новость при открытии новостей"">не просмотрено</a>
//			//|","
//			//|<a href='v8:Кнопка:Отключить новость:" + XMLСтрока(Выборка.Ссылка) + ":" + ГуидПользователя + "' title=""Если нет желания увидеть эту новость еще раз, то нажимай"">просмотрено</a>
//			|") + "
//			|</div>
//			|</div>
//			|<br>
//			|";

//			НовТекст = СтрЗаменить(КонвертацияТипов.ПолучитьТекстHTMLВнутри_Body(Выборка.Текст), "overflow:hidden;", ""); // чтобы скролинг не исчезал
//			
//			
//			Если Не Выборка.ЧистыйHTML Тогда // Форматированный документ
//				
//				// Вытащим картинки во временный каталог
//				
//				ВыборкаВложений = Выборка.Вложения.Выбрать(); 
//				Пока ВыборкаВложений.Следующий() Цикл
//					Данные = ВыборкаВложений.Картинка.Получить();
//					Если ТипЗнч(Данные) = Тип("ДвоичныеДанные") Тогда
//						Адрес 		= ПоместитьВоВременноеХранилище(Новый Картинка(Данные), УникальныйИдентификатор); 
//						НовТекст 	= СтрЗаменить(НовТекст, "'" + ВыборкаВложений.Ключ + "'", "'" + Адрес + "'"); КонецЕсли; КонецЦикла; КонецЕсли;
//			
//			// Добавим в общий текст html
//			
//			Текст = Текст + НовТекст; КонецЕсли; КонецЦикла;
//	
//	Текст = "<HTML><HEAD>
//		|<META content=""text/html; charset=utf-8"" http-equiv=Content-Type>
//		|<META name=GENERATOR content=""MSHTML 9.00.8112.16455"">
//		// Указываем явное совмещение с 9 эксплоером
//		//|<meta http-equiv=""X-UA-Compatible"" content=""IE=11"">
//		|<style type=""text/css"">
//		|body{
//		|scrollbar-3dlight-color: #99FFCC;
//		|scrollbar-arrow-color: #ffffff;
//		|scrollbar-base-color: #3399CC;
//		|scrollbar-darkshadow-color: #336666;
//		|scrollbar-face-color: #33CC99;
//		|scrollbar-highlight-color: #99FF99;
//		|scrollbar-shadow-color: #003300;
//		|scrollbar-track-color: #336633;
//		|}
//		|.newtable{
//		|	border-collapse:collapse;
//		|}
//		|.newth {
//		|	padding:10px;
//		|	border-bottom:1px solid black;
//		|	border-top:1px solid black;
//		|}
//		|.newtd {
//		|	padding:10px;
//		|	border-bottom:1px solid #cccccc;
//		|}
//		|.newgray {
//		|	background-color:#F5F5F5;
//		|}  
//		|.product_avatar
//		|	{
//		|		filter: 
//		|			progid:DXImageTransform.Microsoft.Shadow(color=#aaaaaa,direction=0,strength=1), 
//		|			progid:DXImageTransform.Microsoft.Shadow(color=#aaaaaa,direction=45,strength=2), 
//		|			progid:DXImageTransform.Microsoft.Shadow(color=#aaaaaa,direction=90,strength=8), 
//		|			progid:DXImageTransform.Microsoft.Shadow(color=#aaaaaa,direction=135,strength=3), 
//		|			progid:DXImageTransform.Microsoft.Shadow(color=#aaaaaa,direction=225,strength=3));
//		|	}
//		|.button {
//		|   border: 1px solid #0a3c59;
//		|   background: #519c3e;
//		|   background: -webkit-gradient(linear, left top, left bottom, from(#dbe8d8), to(#519c3e));
//		|   background: -webkit-linear-gradient(top, #dbe8d8, #519c3e);
//		|   background: -moz-linear-gradient(top, #dbe8d8, #519c3e);
//		|   background: -ms-linear-gradient(top, #dbe8d8, #519c3e);
//		|   background: -o-linear-gradient(top, #dbe8d8, #519c3e);
//		|   background-image: -ms-linear-gradient(top, #dbe8d8 0%, #519c3e 100%);
//		|   padding: 2px 1px;
//		|   -webkit-border-radius: 1px;
//		|   -moz-border-radius: 1px;
//		|   border-radius: 1px;
//		|   -webkit-box-shadow: rgba(255,255,255,0.4) 0 1px 0, inset rgba(255,255,255,0.4) 0 1px 0;
//		|   -moz-box-shadow: rgba(255,255,255,0.4) 0 1px 0, inset rgba(255,255,255,0.4) 0 1px 0;
//		|   box-shadow: rgba(255,255,255,0.4) 0 1px 0, inset rgba(255,255,255,0.4) 0 1px 0;
//		|   text-shadow: #7ea4bd 0 1px 0;
//		|   color: #081c29;
//		|   font-size: 12px;
//		|   font-family: helvetica, serif;
//		|   text-decoration: none;
//		|   vertical-align: middle;
//		|   }
//		|.button:hover {
//		|   border: 1px solid #0a3c59;
//		|   text-shadow: #1e4158 0 1px 0;
//		|   background: #34f018;
//		|   background: -webkit-gradient(linear, left top, left bottom, from(#6cab6d), to(#34f018));
//		|   background: -webkit-linear-gradient(top, #6cab6d, #34f018);
//		|   background: -moz-linear-gradient(top, #6cab6d, #34f018);
//		|   background: -ms-linear-gradient(top, #6cab6d, #34f018);
//		|   background: -o-linear-gradient(top, #6cab6d, #34f018);
//		|   background-image: -ms-linear-gradient(top, #6cab6d 0%, #34f018 100%);
//		|   color: #f51b59;
//		|   }
//		|.button:active {
//		|   text-shadow: #1e4158 0 1px 0;
//		|   border: 1px solid #0a3c59;
//		|   background: #65a9d7;
//		|   background: -webkit-gradient(linear, left top, left bottom, from(#3e779d), to(#34f018));
//		|   background: -webkit-linear-gradient(top, #3e779d, #65a9d7);
//		|   background: -moz-linear-gradient(top, #3e779d, #65a9d7);
//		|   background: -ms-linear-gradient(top, #3e779d, #65a9d7);
//		|   background: -o-linear-gradient(top, #3e779d, #65a9d7);
//		|   background-image: -ms-linear-gradient(top, #3e779d 0%, #65a9d7 100%);
//		|   color: #fff;
//		|	}
//		|.polosa {
//		|	height: 20px;
// 		|	background: green;
//        |		filter:
//		|			progid:DXImageTransform.Microsoft.Shadow(color='#042b47', Direction=45, Strength=6)
//		|			progid:DXImageTransform.Microsoft.Shadow(color='#042b47', Direction=135, Strength=6)
//		|			progid:DXImageTransform.Microsoft.Shadow(color='#042b47', Direction=225, Strength=6)
//		|			progid:DXImageTransform.Microsoft.Shadow(color='#042b47', Direction=315, Strength=6);
//		|	position: relative;
//		|	top: -12px;
//		|	left: -12px;
//		|	zoom: 1;
//		|	}
//		|</style>
//		|</HEAD>
//		|<BODY>
////		|<iframe id=""forum_embed""
////  |src=""javascript:void(0)""
////  |scrolling=""no""
////  |frameborder=""0""
////  |width=""900""
////  |height=""700"">
////|</iframe>
//		|" + Текст + "
//		
////		|<script type=""text/javascript"">
////  |document.getElementById('forum_embed').src =
////   |  'https://groups.google.com/forum/embed/?place=forum/garagetools'
////	 |+ '&showsearch=true&showpopout=true&showtabs=false'
////	 |+ '&parenturl=' + encodeURIComponent(window.location.href);
////|</script>
//		|</BODY></HTML>";
//		
//	// Запиавем в док
//	
//	//ИмяФайла = ПолучитьИмяВременногоФайла("html");
//	//Запись = Новый ЗаписьТекста(ИмяФайла);
//	//Запись.ЗаписатьСтроку(Текст);
//	//Запись.Закрыть();
//	//
//	//Док = Новый ДокументHTML;
//	//Док.Проч
//	//ТекстHTML = ИмяФайла;
//	
//	ТекстHTML = Текст;
		
КонецПроцедуры
&НаКлиенте
Процедура ОбновитьНовостиНаКлиенте_Ст()
	
	//ОбновитьНовости();
	//ОбновитьТудаСюда();
	//Если НовостейНет Тогда
	//	Закрыть(); КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ОбновитьТудаСюда_Ст()
	
	//Если НовостиНеБолее И Страниц > 1 Тогда
	//	
	//	Элементы.НадписьТудаСюда.Видимость = Истина;
	//	
	//	Надписи = Новый Массив;
	//	
	//	Если текНомСтраницы > 1 Тогда Надписи.Добавить(Новый ФорматированнаяСтрока(Строка(текНомСтраницы - 1)));Надписи.Добавить(Новый ФорматированнаяСтрока(" << Предыдущая",,,,"-1")) КонецЕсли;
	//	Надписи.Добавить(Новый ФорматированнаяСтрока("   (" + текНомСтраницы + ")", Новый Шрифт(,,16, Истина)));
	//	Если текНомСтраницы < Страниц Тогда Надписи.Добавить(Новый ФорматированнаяСтрока("   Следующая >> ",,,,"1"));Надписи.Добавить(Новый ФорматированнаяСтрока(Строка(текНомСтраницы + 1))); КонецЕсли;
	//	Надписи.Добавить(Новый ФорматированнаяСтрока("     Всего страниц " + Страниц + " "));
	//	
	//	НадписьТудаСюда = Новый ФорматированнаяСтрока(Надписи);  
	//	
	//Иначе
	//	
	//	Элементы.НадписьТудаСюда.Видимость = Ложь; КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ОбновитьТудаСюда()
	
	Если Не НовостейНет Тогда
		
		Элементы.НадписьТудаСюда.Видимость = Истина;
		
		Надписи = Новый Массив;
		
		Если ЕстьПредНовость Тогда Надписи.Добавить(Новый ФорматированнаяСтрока(Строка(ЕстьПредНовость)));Надписи.Добавить(Новый ФорматированнаяСтрока(" << Предыдущая",,,,Формат(ЕстьПредНовость - текНомСтраницы,"ЧН=0; ЧГ="))) КонецЕсли;
		Надписи.Добавить(Новый ФорматированнаяСтрока("   (" + текНомСтраницы + ")", Новый Шрифт(,,16, Истина)));
		Если ЕстьСлНовость Тогда Надписи.Добавить(Новый ФорматированнаяСтрока("   Следующая >> ",,,,Формат(ЕстьСлНовость - текНомСтраницы, "ЧН=0; ЧГ="))); Надписи.Добавить(Новый ФорматированнаяСтрока(Строка(ЕстьСлНовость))); КонецЕсли;
		//Надписи.Добавить(Новый ФорматированнаяСтрока("     Всего страниц " + Страниц + " "));
		
		НадписьТудаСюда = Новый ФорматированнаяСтрока(Надписи);  
		
	Иначе
		
		Элементы.НадписьТудаСюда.Видимость = Ложь; КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НовостиНеБолее 				= ОбщиеФункции.ПолучитьЗначениеКонстантыВОбласти("ПоказыватьНовостиНеБольше");
	//текНомСтраницы				= 1;
	
	//Запрос = Новый Запрос("
	//|ВЫБРАТЬ ПЕРВЫЕ 1 РАЗРЕШЕННЫЕ ЕСТЬNULL(Отк.Отказ, ЛОЖЬ) Отказ, Ссылка Нов
	//|ИЗ 		Документ.Новость Нов
	//|
	//|ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОтказанныеНовости.СрезПоследних(,Пользователь = &ТекущийПользователь) Отк
	//|ПО	Нов.Ссылка 	= Отк.Новость И
	//|	Отк.Отказ 	= Истина
	//|
	//|ГДЕ Проведен И Отк.Новость ЕСТЬ NULL");
	//Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	
	ЗакрыватьЕслиНетНовостей = Параметры.ЗакрыватьЕслиНетНовостей; // И Запрос.Выполнить().Пустой();
	//ОбновитьНовости();
	
	//Результ = Поток.ПолучитьТекстHTMLНовости(Истина, 0, "лалала", Пользователь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//Элементы.ТекстHTML.Документ.Body.Scroll = "Yes";
	
	Если ЗакрыватьЕслиНетНовостей И НовостейНет Тогда
		Отказ = Истина; КонецЕсли;
	
	//ОбновитьТудаСюда();
	ОбновитьНовость();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если HTMLОбработкаКлиент.ТекстHTMLПриНажатии(ДанныеСобытия, СтандартнаяОбработка) Тогда
		ПодключитьОбработчикОжидания("ОбновитьНовость", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВсеНовостиПриИзменении(Элемент)
	
	//текНомСтраницы = 1;
	ОбновитьНовость();
	//ОбновитьТудаСюда();
	
КонецПроцедуры
&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	
	ОбновитьНовость();
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьТудаСюдаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылка, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	текНомСтраницы 	= текНомСтраницы + Число(НавигационнаяСсылка);
	ОбновитьНовость();
	ОбновитьТудаСюда();
	
КонецПроцедуры


#Область Поток

&НаКлиенте
Процедура УстановитьНаписьОбновляется()
	
	ТекстHTML = "
	|<html> 
	|<head> 
	|<meta http-equiv=""X-UA-Compatible"" content=""IE=11"">
	|<style type=""text/css""> 
	|html, body { 
	|    height:100%; 
	|    width:100%; 
	|    margin:0; 
	|    display:flex; 
	|} 
	|p { 
	|    margin:auto; 
	|    font-size: 2em;
	|	width: 50%;
	|	  height: 50%;
	|	  overflow: auto;
	|	  margin: auto;
	|	  position: absolute;
	|	  top: 0; left: 0; bottom: 0; right: 0;
	|} 
	|</style> 
	|</head> 
	|<body> 
	|    <p>Получаю новости ...</p> 
	|</body> 
	|</html>";
	
КонецПроцедуры
&НаСервере
Функция НовостьПолучена()
	
	Структура = ПолучитьИзВременногоХранилища(АдресНовости);
	Если Структура = Неопределено Тогда
		Возврат Ложь;
		
	Иначе
		
		Если Структура.Состояние = Поток.СостояниеВыполнено() Тогда
			
			текНомСтраницы 	= Структура.Результат.текНомНовости;
			ЕстьСлНовость	= Структура.Результат.ЕстьСлНовость;
			ЕстьПредНовость	= Структура.Результат.ЕстьПредНовость;
			ТекстHTML 		= Структура.Результат.ТекстHTML;
			НовостейНет		= Структура.Результат.НовостейНет;
			
		ИначеЕсли Структура.Состояние = Поток.СостояниеОшибка() Тогда
			
			ОбщиеФункции.СообщитьТекст(Структура.стрОшибки); КонецЕсли;
		
		Возврат Истина; КонецЕсли;
	
КонецФункции
&НаКлиенте
Процедура ПолучитьНовостьПостоянно()
	
	Если НовостьПолучена() Тогда
		Если ЗакрыватьЕслиНетНовостей И НовостейНет Тогда Закрыть() КонецЕсли;
		ОбновитьТудаСюда();
		ОтключитьОбработчикОжидания("ПолучитьНовостьПостоянно"); КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПолучитьНовость()
	
	Если НовостьПолучена() Тогда
		Если ЗакрыватьЕслиНетНовостей И НовостейНет Тогда Закрыть() КонецЕсли;
		ОбновитьТудаСюда();
	Иначе
		ПодключитьОбработчикОжидания("ПолучитьНовостьПостоянно", 1) КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ОбновитьНовость()
	
	УстановитьНаписьОбновляется();
	
	АдресНовости = Поток.ПолучитьНовость(ПоказатьВсеНовости, текНомСтраницы, УникальныйИдентификатор, Пользователь);
	ПодключитьОбработчикОжидания("ПолучитьНовость", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти