
&НаСервере
Функция ПолучитьИмяПроцесса(Процесс)
	
	Возврат Процесс.Метаданные().Имя;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("Ключ", ПараметрКоманды);
	//ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
	ОткрытьФорму("БизнесПроцесс." + ПолучитьИмяПроцесса(ПараметрКоманды) + ".Форма.УпрФормаБП", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
