
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Товары.Загрузить(ПолучитьИзВременногоХранилища(Параметры.АдресХранилища));
	
	Для Каждого Строка Из Товары Цикл
		
		Коэффициент = ?(НЕ Строка.Упаковка.Пустая(), Строка.Упаковка.Коэффициент * Строка.Количество, Строка.Количество);
		
		Строка.Вес = Строка.Номенклатура.Вес * Коэффициент;
		Строка.Объем = Строка.Номенклатура.Объем * Коэффициент;
		
	КонецЦикла;    
	
	ИтогоВес = Товары.Итог("Вес");
	ИтогоОбъем = Товары.Итог("Объем");
	ИтогоКоличество = Товары.Итог("Количество");
	
КонецПроцедуры
