
&НаСервере
Функция ЗаписатьМакет(ИмяФайла, Макет)
	
	Попытка
		Макет.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.PDF);
	Исключение
		стрОшибки = ОписаниеОшибки();
		ОбщиеФункции.СообщитьТекст("Ошибка при записи макета в файл
											|" + стрОшибки);
		Возврат ложь; КонецПопытки;
	
	Возврат Истина;
	
КонецФункции
&НаСервере
Функция СформироватьВложения(Ссылки, Кому)
	
	//Каталог = Получитькатало
	Макеты 		= Новый Массив;
	Партнеры 	= Новый Массив;
	
	Для Каждого Ссылка Из Ссылки Цикл
		
		// Сформируем макет
		
		Макет 		= Новый ТабличныйДокумент;
		Тип 		= ТипЗнч(Ссылка);
		
		Если Тип = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			
			Документы.ЗаказПокупателя.Печать_СчетЗаказ(Ссылка);
			Номер 	= Ссылка.Номер;
			Партнер = Ссылка.Партнер;
			
		ИначеЕсли Тип = Тип("БизнесПроцессСсылка.ЗаявкаПокупателя") Тогда
			
			Документы.ЗаказПокупателя.Печать_СчетЗаказ(Макет, Ссылка.Заказ, "Счет");
			Номер 	= Ссылка.Заказ.Номер;
			Партнер = Ссылка.Заказ.Партнер;
			
		Иначе
			
			ОбщиеФункции.СообщитьТекст("Нет обработчика для отправки вложения для " + Тип);
			Возврат Неопределено; КонецЕсли; 
		
		// Сохраним макет в файл
		
		ИмяФайла = ПолучитьИмяВременногоФайла() + ".pdf";
		Если Не ЗаписатьМакет(ИмяФайла, Макет) Тогда Возврат Неопределено КонецЕсли;
		
		// Поместим во временое хранилище
		
		СтруктураКому 	= Новый Структура("Партнер", Партнер);
		АдресПочты 		= Почта2Сервер.ПолучитьПочтуПартнера(Партнер);
		Если Не ПустаяСтрока(АдресПочты) Тогда СтруктураКому.Вставить("Почта", АдресПочты) КонецЕсли;
		Кому.Добавить(СтруктураКому);
		
		Макеты.Добавить(Новый Структура("ИмяФайла, Адрес", Номер + ".pdf", ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяФайла), Новый УникальныйИдентификатор)));
		
		// Удалим файл за собой (правила этикета)
		
		УдалитьФайлы(ИмяФайла); КонецЦикла;
	
	Возврат Макеты;
	
КонецФункции
&НаСервере
Функция СформироватьВложения_Ст(Ссылки)
	
	////Каталог = Получитькатало
	//Макеты 		= Новый Массив;
	//Партнеры 	= Новый Массив;
	//
	//Для Каждого Ссылка Из Ссылки Цикл
	//	
	//	// Сформируем макет
	//	
	//	Макет 		= Новый ТабличныйДокумент;
	//	Тип 		= ТипЗнч(Ссылка);
	//	
	//	Если Тип = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
	//		
	//		Документы.ЗаказПокупателя.Печать_СчетЗаказ(Ссылка);
	//		Номер 	= Ссылка.Номер;
	//		Партнер = Ссылка.Партнер;
	//		
	//	ИначеЕсли Тип = Тип("БизнесПроцессСсылка.ЗаявкаПокупателя") Тогда
	//		
	//		Документы.ЗаказПокупателя.Печать_СчетЗаказ(Макет, Ссылка.Заказ, "Счет");
	//		Номер 	= Ссылка.Заказ.Номер;
	//		Партнер = Ссылка.Заказ.Партнер;
	//		
	//	Иначе
	//		
	//		ОбщиеФункции.СообщитьТекст("Нет обработчика для отправки вложения для " + Тип);
	//		Возврат Неопределено; КонецЕсли; 
	//	
	//	// Сохраним макет в файл
	//	
	//	ИмяФайла = ПолучитьИмяВременногоФайла() + ".pdf";
	//	Если Не ЗаписатьМакет(ИмяФайла, Макет) Тогда Возврат Неопределено КонецЕсли;
	//	
	//	// Поместим во временое хранилище
	//	
	//	//Макеты.Добавить(Новый Структура("Кому, ИмяФайла, Адрес", Кому, Номер + ".pdf", ПоместитьВоВременноеХранилище(Новый ХранилищеЗначения(Новый ДвоичныеДанные(ИмяФайла)), Новый УникальныйИдентификатор)));
	//	Макеты.Добавить(Новый Структура("Партнер, ИмяФайла, Адрес", Партнер, Номер + ".pdf", ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяФайла), Новый УникальныйИдентификатор)));
	//	
	//	// Удалим файл за собой (правила этикета)
	//	
	//	УдалитьФайлы(ИмяФайла); КонецЦикла;
	//
	//Возврат Макеты;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Вложения 		= Новый Массив;
	Кому			= Новый Массив;
	ДанныеССервера 	= СформироватьВложения(ПараметрКоманды, Кому);
	
	Если ДанныеССервера <> Неопределено Тогда
		
		// Считаем вложения во временные файлы
		
		Для Каждого Данные Из ДанныеССервера Цикл
			
			ПолноеИмяФайла = КаталогВременныхФайлов() + Данные.ИмяФайла;
			Попытка ПолучитьИзВременногоХранилища(Данные.Адрес).Записать(ПолноеИмяФайла);
			Исключение	стрОшибки = ОписаниеОшибки();
						ОбщиеФункции.СообщитьТекст("Ошибка записи файла на клиенте " + ПолноеИмяФайла + " " + стрОшибки);
						Возврат; КонецПопытки;
			
			Вложения.Добавить(Новый Структура("ИмяФайла, ПолноеИмяФайла", Данные.ИмяФайла, ПолноеИмяФайла)); КонецЦикла;
		
		// Откроем форму
		
		ОткрытьФорму("Документ.Письмо.Форма.Письмо2", 
				Новый Структура("Кому, Вложения, УдалитьФайлыПослеОтправки", Кому, Вложения, Истина), 
				ПараметрыВыполненияКоманды.Источник, 
				ПараметрыВыполненияКоманды.Уникальность, 
				ПараметрыВыполненияКоманды.Окно, 
				ПараметрыВыполненияКоманды.НавигационнаяСсылка) КонецЕсли;
	
КонецПроцедуры
