
&НаСервере
Функция ВыгрузитьНаСервере(Ссылки)
	
	//Возврат обм_Обмен.Выгрузить(Ссылки, Справочники.обм_ОбменДанными.ПолучитьСсылку(Новый УникальныйИдентификатор("fd517439-f2ba-11e6-80e4-002590da3100"))); 
	Возврат обм_Обмен.Выгрузить(Ссылки, Справочники.обм_ОбменДанными.ПолучитьСсылку(Новый УникальныйИдентификатор("655fc9be-f1e4-11e6-8111-002590d99cf6")));
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ВыгрузитьНаСервере(ПараметрКоманды) Тогда
		
		Если ПараметрКоманды.Количество() = 1 Тогда
				ПоказатьОповещениеПользователя("Данные выгружены", ПолучитьНавигационнуюСсылку(ПараметрКоманды[0]), ПараметрКоманды[0], БиблиотекаКартинок.Бухгалтерия);
		Иначе	ПоказатьОповещениеПользователя("Данные выгружены",,Строка(ПараметрКоманды.Количество()) + " шт.", БиблиотекаКартинок.Бухгалтерия); КонецЕсли; КонецЕсли;

	
КонецПроцедуры


