Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	ИменаРегистров = Новый Массив;
	ПоВсем=Ложь;
	Если Не ДополнительныеСвойства.Свойство("ИменаРегистров",ИменаРегистров) Тогда
		ПоВсем=Истина;
		ИменаРегистров = Новый Массив;
	КонецЕсли;	
	
	Нтаб=Новый Структура;
	ТекстЗапроса="выбрать ""фиктивный запрос для совместимости""";
	ТекНомер=0;	
	
	Если ИменаРегистров.Найти("Взаиморасчеты")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("Взаиморасчеты",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		
		"ВЫБРАТЬ
		|	&Период				КАК Период,
		|	Значение(ВидДвиженияНакопления.Расход)	КАК ВидДвижения,
		|   Организация	КАК Организация,
		|	Контрагент	КАК Контрагент,
		|	ЗНАЧЕНИЕ(Перечисление.ФормаОтношений.Поставщик) 	ФормаОтношений,			
		|	Сумма		КАК Сумма,
		|   Сумма       КАК СуммаУпр
		|ИЗ
		|	Документ.УслугиСтороннейОрганизации
		|ГДЕ
		|	Ссылка = &Ссылка"
		
	КонецЕсли;	
	
	Запрос=Новый Запрос;
	Запрос.Текст=ТекстЗапроса;
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", Ссылка.Дата);

	Пакет = Запрос.ВыполнитьПакет();
	
	Для Каждого Элем Из Нтаб Цикл
		ДополнительныеСвойства.Вставить(Элем.Ключ,Пакет[Элем.Значение].Выгрузить());
	КонецЦикла;	
		
КонецПроцедуры
