Функция ПолучитьТекстЗапросаПолученияСпискаТоваров() Экспорт
	
	Возврат "";
	
КонецФункции
 
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//проверка даты документа
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОтгрузок",РаспределениеНаПеремещения.ВыгрузитьКолонку("Документ"));
	Запрос.Текст="Выбрать Дата, Процесс,СкладОтправитель Поместить Отгрузки из Документ.ОтгрузкаТоваров ГДЕ Ссылка в (&МассивОтгрузок);
	|Выбрать Ссылка Поместить БП из БизнесПроцесс.ПеремещениеТоваров ГДЕ Ссылка в (Выбрать Процесс из Отгрузки);
	|Выбрать Дата ДатаКон,СкладПолучатель из Документ.ПриемТоваров ГДЕ Процесс в (Выбрать Ссылка из БП) Упорядочить по Дата Возр;
	|Выбрать Дата ДатаНач,СкладОтправитель из Отгрузки Упорядочить по Дата Убыв"
	;
	
	МассивРез=Запрос.ВыполнитьПакет();
	Если Не МассивРез[2].Пустой() Тогда
		Стр=МассивРез[2].выгрузить()[0];
		Если Дата>Стр.ДатаКон Тогда
			Отказ=истина;
			Сообщить("Дата документа должна быть меньше даты первого приема товара "+Стр.ДатаКон+" "+Стр.СкладПолучатель);
		КонецЕсли;	
	КонецЕсли;	
	Если Не МассивРез[3].Пустой() Тогда
		Стр=МассивРез[3].выгрузить()[0];
		Если Дата<=Стр.ДатаНач Тогда
			Отказ=истина;
			Сообщить("Дата документа должна быть больше даты последней отгрузи товара "+Стр.ДатаНач+" "+Стр.СкладОтправитель);
		КонецЕсли;	
	КонецЕсли;	
	
	
	
	// Подготовка
	Заголовок = КонтрольПроведения.ПолучитьСтандарнтыйЗаголовокПриПроведенииДокумента(Ссылка);	
	Документы[Метаданные().Имя].ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства);	
	
	// Проведение
	ПроведенияДокументов.ПровестиПоВсемРегистрам(Метаданные().Движения, ДополнительныеСвойства, Движения, Отказ);
	                                     
	// Запись
	Движения.Записать();

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	
КонецПроцедуры
