Функция ПолучитьСкладСписания() Экспорт Возврат Склад КонецФункции
Функция ПолучитьТекстЗапросаПолученияСпискаТоваров() Экспорт
	
	Возврат "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура
	|ИЗ
	|	Документ.ЗаказНаряд.Запчасти
	|ГДЕ
	|	Ссылка = &ДокументСсылка
	|";
	
	
КонецФункции

// ПРЕДОПРЕДЕЛЕННЫЕ ФУНКЦИИ

Процедура ОбработкаПроведения(Отказ, Режим)
		 
	// Подготовка
	
	Заголовок = КонтрольПроведения.ПолучитьСтандарнтыйЗаголовокПриПроведенииДокумента(Ссылка);
	
	Документы[Метаданные().Имя].ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Проведение
	
	ПроведенияДокументов.ПровестиПоВсемРегистрам(
					Метаданные().Движения, 
					ДополнительныеСвойства, 
					Движения, 
					Отказ);
	// Запись
	
	Движения.Записать();
	
	// Контроль
	//
	
	КонтрольПроведения.ПроверитьТоварыНаСкладах(ЭтотОбъект, Склад, Отказ, Заголовок, );//Ссылка); нужно проверять учитывая сам документ, иначе не проверяются резервы
	 
	//
	
	// Установим статус оплаты
	
	Если 	Не Отказ И
			Не Заказы.ПроверитьИУстановитьСтатусОплатыЗаказа(Ссылка) Тогда
			
		Отказ = Истина;
			
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Проверим чтобы была нужная задача
	
	текПроцесс = Документы.ЗаказНаряд.БизнесПроцесс(Ссылка);
	Если Не текПроцесс.Пустая() Тогда
			
		//Если Не ФункцииБизнесПроцессов.СтоитНаТочкеМаршрута(текПроцесс, БизнесПроцессы.РемонтИнструмента.ТочкиМаршрута.Ремонт) Тогда
		
		Если Не КэшируемыеФункции.ЭтоПолныеПрава() Тогда
				Отказ = Истина;
		Иначе
				ОбщиеФункции.СообщитьТекст("Отменить проведение заказ наряда возможно, только во время ремонта инструмента
								|(смотри: " + текПроцесс + ")");
		КонецЕсли;
				
						
		//КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Сумма = Товары.Итог("Сумма") + ?(СуммаВключаетНДС,0,Товары.Итог("СуммаНДС"));
	Если Сумма < 0 Тогда
		Сообщить("Сумма документа не может быть отрицательной");
		Отказ = Истина;
	КонецЕсли;
	
	Скидка = Товары.Итог("СуммаАвтоматическойСкидки");
	
КонецПроцедуры


