
&НаСервере
Процедура ЗагрузитьСписокВыбора()
	
	Список = Элементы.Путь.СписокВыбора;
	Список.Очистить();
	
	Если Объект.ВидЗаписи = Перечисления.ВидыЗаписейПрофиля.Пользователь Тогда
		
		МетаРевизы = Метаданные.Справочники.Пользователи.Реквизиты;
		Для Каждого МетаРекв ИЗ МетаРевизы Цикл Список.Добавить(МетаРекв.Имя) КонецЦикла;
		
	ИначеЕсли Объект.ВидЗаписи = Перечисления.ВидыЗаписейПрофиля.МоиНастройки Тогда
		
		Запрос 	= Новый Запрос("
		|ВЫБРАТЬ 
		|	Ссылка,
		|	ВЫБОР КОГДА Родитель = ЗНАЧЕНИЕ(ПланВидовХарактеристик.НастройкиПользователя.ПустаяСсылка)
		|		ТОГДА ""["" + Родитель.Наименование + ""] "" + Наименование
		|		ИНАЧЕ Наименование 
		|	КОНЕЦ КАК Наименование
		|ИЗ 
		|	ПланВидовХарактеристик.НастройкиПользователя 
		|ГДЕ 
		|	НЕ ПометкаУДаления И Не ЭтоГруппа
		|");
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл Список.Добавить(Выборка.Ссылка, Выборка.Наименование) КонецЦикла;
		
	ИначеЕсли Объект.ВидЗаписи = Перечисления.ВидыЗаписейПрофиля.РегСведенийПоПользователю Тогда
		
		ПодклРегистры = НастройкиПользователя.ПолучитьПодключаемыеРегистрыНастроекПользователя();
		Для Каждого ПодклРегистр Из ПодклРегистры Цикл Список.Добавить(ПодклРегистр.ИмяРегистра, Метаданные.РегистрыСведений[ПодклРегистр.ИмяРегистра]) КонецЦикла;
		
	ИначеЕсли Объект.ВидЗаписи = Перечисления.ВидыЗаписейПрофиля.Конфигуратор Тогда
		
		// Соберем роли
		
		Список.Добавить("Роли", 					"Роли в конфигураторе");
		Список.Добавить("ПоказыватьВСпискеВыбора", 	"Показывать в списке выбора");
		
		// Соберем настройки
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЗаписиПриИзменении(Элемент)
	
	ЗагрузитьСписокВыбора();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗагрузитьСписокВыбора();
	
КонецПроцедуры
