
&НаСервере
Процедура РаспределитьРасходыНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьРасходы(Команда)
	РаспределитьРасходыНаСервере();
КонецПроцедуры



&НаСервере
Процедура УстановитьДатуДокумента()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОтгрузок",Объект.РаспределениеНаПеремещения.Выгрузить().ВыгрузитьКолонку("Документ"));
	Запрос.Текст="Выбрать Максимум(Дата) из Документ.ОтгрузкаТоваров ГДЕ Ссылка в (&МассивОтгрузок)";
	Рез=Запрос.Выполнить();
	Если Не Рез.Пустой() Тогда
		Объект.дата=рез.выгрузить()[0].Дата+1;
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьДату(Команда)
	УстановитьДатуДокумента();
КонецПроцедуры

