
&НаСервере
Функция ПолучитьПараметрыДляТабличногоДокумента(Ссылки, СтрНомер)
	
	Возврат Заказы.ПолучитьПараметрыДляТабличногоДокумента(Ссылки, СтрНомер);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДок = Новый ТабличныйДокумент;
	Печать(ТабДок, ПараметрКоманды);

	ФункцииФормДокументов.УстановитьНастройкиТабличногоДокумента(ТабДок);
	
	ТабДок.ДвусторонняяПечать = ТипДвустороннейПечати.ПереворотВлево;
    ТабДок.АвтоМасштаб = Истина;
	
	СтрНомера = "";
	ДополнительныеПараметры = ПолучитьПараметрыДляТабличногоДокумента(ПараметрКоманды, СтрНомера);
	ОткрытьФорму("ОбщаяФорма.ТабличныйДокумент", Новый Структура("ТабличныйДокумент, ИмяФайла, ДополнительныеПараметры", ТабДок, СтрНомера, ДополнительныеПараметры),ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

&НаСервере
Процедура Печать(ТабДок, ПараметрКоманды)
	
	ПараметрПечати = Новый Структура("ИмяМакета, СкидкаВТаблице, СтрокаУсловиеПоставки, ОриентацияСтраницы", 
									"Спецификация", Ложь, Ложь, ОриентацияСтраницы.Ландшафт);
	
	//ПараметрПечати.Вставить("_1ЛистТолькоКогдаДо", 	6);
	//ПараметрПечати.Вставить("НаПервомНеБолее", 		8);
	//ПараметрПечати.Вставить("НаВторомНеБолее", 		9);
	//ПараметрПечати.Вставить("ВКонцеНеБолее",		8);
	//
	Макет 		= Документы.ЗаказПокупателя.ПолучитьМакет("Спецификация");
	Инд = -1;
	Для Каждого Ссылка Из ПараметрКоманды Цикл 
		Инд = Инд + 1; 
		Если Инд Тогда 
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц(); 
		КонецЕсли;
		
		//ПечатьНаСервере.ЗаполнитьТабличныйДокумент_Спецификация(ТабДок, ПечатьНаСервере.ПолучитьДанныеДляЗаказаВЗаказе(?(ТипЗнч(Ссылка) = Тип("БизнесПроцессСсылка.ЗаявкаПокупателя"), Ссылка.Заказ, Ссылка)), ПараметрПечати); 
		ПечатьНаСервере.ЗаполнитьТабличныйДокумент_Спецификация(ТабДок, ПечатьНаСервере.ПолучитьДанныеДляЗаказаВЗаказе(ПолучитьЗаказы(Ссылка)), ПараметрПечати); 
	КонецЦикла;
		

КонецПроцедуры

&НаСервере
Функция ПолучитьЗаказы(Ссылка)
	
	Если 	ТипЗнч(Ссылка) = Тип("БизнесПроцессСсылка.ЗаявкаПокупателя") Или
			ТипЗнч(Ссылка) = Тип("БизнесПроцессСсылка.ИнтернетЗаявка") Или
			ТипЗнч(Ссылка) = Тип("ДокументСсылка.РеализацияТоваров") Или 
			ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПередачаТовара") Тогда
		
		Возврат Ссылка.Заказ;
		
	ИначеЕСли 	ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказПокупателя") ИЛИ
				ТипЗнч(Ссылка) = Тип("ДокументСсылка.ИнтернетЗаказПокупателя")	Тогда
		
		Возврат Ссылка;
		
	ИначеЕСли ТипЗнч(Ссылка) = Тип("ДокументСсылка.РеализацияПереданныхТоваров") Тогда
				
		ПутьКДоку = Ссылка.Метаданные().ПолноеИмя();
		
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ ДокументПередачи.Заказ Заказ ИЗ Документ.РеализацияПереданныхТоваров.Товары ГДЕ Ссылка = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Заказ"); КонецЕсли;
	
КонецФункции