
&НаСервере
Функция БПСуществует(Заказ, СсылкаНаБП)
	
	Запрос = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ БизнесПроцесс.СборкаЗаказа ГДЕ ПометкаУдаления = ЛОЖЬ И Заказ = &Заказ");
	Запрос.УстановитьПараметр("Заказ", Заказ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		СсылкаНаБП = Выборка.Ссылка;
		Возврат Истина;
		
	Иначе
		
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции
&НаСервере
Функция ВСборку(ВнутреннийЗаказ)
	
	Процесс = БизнесПроцессы.СборкаЗаказа.СоздатьБизнесПроцесс();
	Процесс.Дата = ТекущаяДата();
	//Процесс.ДатаПервойСборки = БизнесПроцессы.СборкаЗаказа.ПолучитьДатуПервойСборкиЗаказа(ВнутреннийЗаказ);
	
	Процесс.Заполнить(ВнутреннийЗаказ);
	
	НачатьТранзакцию();
	
	Попытка
		Процесс.Записать();
	Исключение
		ОбщиеФункции.СообщитьТекст(ОписаниеОшибки());
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	Попытка
		Процесс.Старт()
	Исключение
		ОбщиеФункции.СообщитьТекст(ОписаниеОшибки());
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();
	
	Возврат Истина;	
	
КонецФункции
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СсылкаНаБП = Неопределено;
	
	Если БПСуществует(ПараметрКоманды, СсылкаНаБП) Тогда
		
		ОткрытьФорму("ОбщаяФорма.СвязанныеДокументыПроцессы", 
						Новый Структура("Документ", ПараметрКоманды), ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
		
	Иначе
	
		Если ВСборку(ПараметрКоманды) Тогда
			
			ОткрытьФорму("ОбщаяФорма.СвязанныеДокументыПроцессы", 
						Новый Структура("Документ", ПараметрКоманды), ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);

		КонецЕсли;
	КонецЕсли;
			
КонецПроцедуры

