
Процедура Напоминить(Текст, Пояснение, Источник, Картинка = Неопределено)
	
	ПоказатьОповещениеПользователя(
			Пояснение, 
			ПолучитьНавигационнуюСсылку(Источник),
			Текст,
			Картинка);
	
КонецПроцедуры

Процедура ПроверитьНапоминания() Экспорт
	
	Напоминания = НапоминанияСервер.ПолучитьНапоминания();
	//ВремеМеждуСообщениями = 5;
	
	Для Каждого Напоминание Из Напоминания Цикл
		
		Напоминить(
				Напоминание.Текст, 
				КонвертацияТипов.ПолучитьРазницуВремениСтрокой(Напоминание.ДатаНапоминания, ТекущаяДата(), 2, 1) + " назад", 
				Напоминание.Ссылка)
				//Напоминание.Картинка);
		
	КонецЦикла;
	
КонецПроцедуры