&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	НачальноеЗаполнение();
КонецПроцедуры

&НаСервере
Процедура НачальноеЗаполнение()
	РРЗ = ПолучитьРасписаниеРегламентногоЗадания(Объект.Расписание);
	Объект.РасписаниеПредставление = Строка(?(РРЗ = Неопределено,"",РРЗ));
	
	Объект.ФорматФайла = ?(Объект.ФорматФайла = "","xlsx",Объект.ФорматФайла);
КонецПроцедуры

//Расписание
&НаСервереБезКонтекста
Функция ПолучитьРасписаниеРегламентногоЗадания(СтрокаВнутр)
	Если СтрокаВнутр = "" Тогда
		Возврат Неопределено
	КонецЕсли;
	Возврат ЗначениеИзСтрокиВнутр(СтрокаВнутр)
КонецФункции	

&НаСервере
Процедура ВыполнитьПослеЗакрытияДРРЗ(Расписание, ДополнительныеПараметры)Экспорт
	 Если Расписание =Неопределено Тогда
	 
	 	Возврат	
	 
	 КонецЕсли;
	Объект.Расписание =  ЗначениеВСтрокуВнутр(Расписание);
	Объект.РасписаниеПредставление = Строка(Расписание);
	
КонецПроцедуры // ()

&НаКлиенте
Процедура РасписаниеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	РРЗ = ПолучитьРасписаниеРегламентногоЗадания(Объект.Расписание);
	Если РРЗ = Неопределено Тогда
	    РРЗ = Новый РасписаниеРегламентногоЗадания;	
	КонецЕсли;
	ДРРЗ = Новый ДиалогРасписанияРегламентногоЗадания(РРЗ);
	Оп = Новый ОписаниеОповещения("ВыполнитьПослеЗакрытияДРРЗ", ЭтотОбъект);
	ДРРЗ.Показать(Оп); 

КонецПроцедуры

&НаКлиенте
Процедура РасписаниеПредставлениеОчистка(Элемент, СтандартнаяОбработка)
	Объект.Расписание = "";
КонецПроцедуры

&НаКлиенте
Процедура ПолучателиПолучательПриИзменении(Элемент)
	ТД = Элементы.Получатели.ТекущиеДанные;
	ТД.Email = ПолучитьEmail(ТД.Получатель);
КонецПроцедуры

&НаСервере
Функция ПолучитьEmail(Получатель)
	Возврат СокрЛП(Получатель.Почта);
КонецФункции




