
Процедура ПриЗаписи(Отказ)
	
	//Если Не ОбменДанными.Загрузка Тогда
	//	
	//	// всегда прописываем в табличную часть текущего пользователя
	//	
	//	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 ИСТИНА ИЗ Справочник.Пользователи.ПрофилиИнтернетПочты ГДЕ Ссылка = &ТекущийПользователь И Профиль = &Ссылка");
	//	Запрос.УстановитьПараметр("ТекущийПользователь", 	ПараметрыСеанса.ТекущийПользователь);
	//	Запрос.УстановитьПараметр("Ссылка", 				Ссылка);
	//	
	//	Если Запрос.Выполнить().Пустой() Тогда // Проверим есть ли он у пользователя
	//		
	//		// Установим
	//		
	//		ПользовательОбъект = ПараметрыСеанса.ТекущийПользователь.ПолучитьОбъект();
	//		ПользовательОбъект.ПрофилиИнтернетПочты.Добавить().Профиль = Ссылка;
	//		
	//		// Запишем
	//		
	//		Если ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(ПользовательОбъект) Тогда
	//			Отказ = Истина КонецЕсли;КонецЕсли; КонецЕсли;
	
КонецПроцедуры
