
&НаКлиенте
Процедура ОбновитьТекстHTML()
	
	ТекстHTML = ДиалогиСПользователем.СформироватьТекстHTML(Объект.ОписаниеПроекта);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьОписаниеНажатие(Элемент)
	
	ОткрытьФорму("ОбщаяФорма.РедактированияТекстаHTML", 
	                  	Новый Структура("Текст", Объект.ОписаниеПроекта), 
						ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Объект.ОписаниеПроекта = ВыбранноеЗначение;
	ОбновитьТекстHTML();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьТекстHTML();
	
КонецПроцедуры
