&НаСервере
Функция ПолучитьИмяФайла(Ссылка) Возврат Ссылка.Номер КонецФункции

&НаСервере
Функция ПолучитьТаблДокумент(Ссылки)
	
	Возврат Документы.ТехЗаключение.ПечатьТехЗаключение(Ссылки);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТаблДок = ПолучитьТаблДокумент(ПараметрКоманды);
	ФункцииФормДокументов.УстановитьНастройкиТабличногоДокумента(ТаблДок);
	ТаблДок.Показать("Тех. заключение (печать)", ПолучитьИмяФайла(ПараметрКоманды[0]));
	
КонецПроцедуры