
&НаСервере
Процедура ОбновитьСписок()
	
	ТаблицаПоСкладм.Параметры.УстановитьЗначениеПараметра("Номенклатура", Номенклатура);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Номенклатура = Параметры.Номенклатура;
	
	ОбновитьСписок();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если СобытияСистемы.Событие_ИзменениеРасшифровкиНоменклатуры() Тогда
		
		Номенклатура = Параметр;
		ОбновитьСписок();
		
	КонецЕсли;
	
КонецПроцедуры
