
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	БазовыйТипЦен = Параметры.БазовыйТипЦен;	
	Элементы.ЦенаБазовая.Заголовок = Строка(БазовыйТипЦен) + ", " + Строка(БазовыйТипЦен.Валюта);
	           
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	НаДату = ВладелецФормы.Объект.НаДату;
	ЗаполнитьТаблицу(ВладелецФормы.Цены);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицу(Знач Таблица)
	
	ИмяКолонки = СтрЗаменить(Строка(БазовыйТипЦен.УникальныйИдентификатор()),"-","");
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос("	ВЫБРАТЬ
							|	Товары.Номенклатура,
							|	Товары.Артикул,
							|	Товары.Количество, " + "Товары.БазовыйТипНоваяЦена" + ИмяКолонки + " НоваяЦена 
							|ПОМЕСТИТЬ
							|	ТоварыДокумента
							|ИЗ
							|	&ВыбТаблица КАК Товары");
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	                                     
	Запрос.УстановитьПараметр("ВыбТаблица", Таблица.Выгрузить());
	Запрос.Выполнить();
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Тов.Номенклатура, 
	|   Тов.Артикул,
	|	Тов.Количество,
	|	Тов.Аналог,
	|	Тов.Аналог.Артикул	АртикулАналог, 
	|	Тов.НоваяЦена		ЦенаБазовая,
	//|   Цен.Цена 
	|   Кон.Цена ЦенаАналога
	|ИЗ	
	|	(ВЫБРАТЬ
	|		Таб.Номенклатура,
	|		Таб.Артикул,
	|		Таб.Количество,
	|		Таб.НоваяЦена,
	|		ВЫБОР КОГДА
	|			Рег.Номенклатура1.Производитель = &Производитель
	|		ТОГДА
	|			Рег.Номенклатура1
	|		ИНАЧЕ
	|			ВЫБОР КОГДА
	|				Рег.Номенклатура2.Производитель = &Производитель
	|			ТОГДА
	|				Рег.Номенклатура2
	|	    	КОНЕЦ
	|		КОНЕЦ Аналог
	|	 ИЗ
	|		ТоварыДокумента Таб
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрСведений.АналогиНоменклатуры Рег
	|		ПО
	|			Таб.Номенклатура = Рег.Номенклатура1 ИЛИ
	|			Таб.Номенклатура = Рег.Номенклатура2		
	|	ГДЕ
	|		Рег.Основной = ИСТИНА
	|		И (Рег.Номенклатура1.Производитель = &Производитель И Рег.Номенклатура1 <> Таб.Номенклатура ИЛИ
	|		Рег.Номенклатура2.Производитель = &Производитель И Рег.Номенклатура2 <> Таб.Номенклатура)	
	|	) Тов
	//|		ЛЕВОЕ СОЕДИНЕНИЕ
	//|			РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата, ТипЦен = &ТипЦен) Цен
	//|		ПО 
	//|			Тов.Номенклатура = Цен.Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ
	|			РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата, ТипЦен = &ТипЦенКонкурента) Кон
	|		ПО 
	|			Тов.Аналог = Кон.Номенклатура
	|";	
	
	Запрос.УстановитьПараметр("Производитель", Производитель);
	Запрос.УстановитьПараметр("Дата", НаДату);
	Запрос.УстановитьПараметр("ТипЦен", БазовыйТипЦен);
	Запрос.УстановитьПараметр("ТипЦенКонкурента", ТипЦенКонкурента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Цены.Очистить();

	Если НЕ РезультатЗапроса.Пустой() Тогда
					Цены.Загрузить(РезультатЗапроса.Выгрузить());
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриИзмененииТипЦенКонкурентаНаСервере(Знач Таблица)
	
	Элементы.ЦенаАналога.Заголовок = Строка(ТипЦенКонкурента) + ", " + Строка(ТипЦенКонкурента.Валюта) + " (" + Строка(Производитель) + ")";
	ЗаполнитьТаблицу(Таблица);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЦенКонкурентаПриИзменении(Элемент)
	
	ПриИзмененииТипЦенКонкурентаНаСервере(ВладелецФормы.Цены);
	
КонецПроцедуры
&НаКлиенте
Процедура ПроизводительПриИзменении(Элемент)
	  
	ЗаполнитьТаблицу(ВладелецФормы.Цены);
	
КонецПроцедуры

