
&НаСервереБезКонтекста
Функция ДанныеЗаполненияСтроки()
	
	СтруктураДанных = Новый Структура("Автор,ДатаПоследнегоИзменения");
	СтруктураДанных.Автор = ПараметрыСеанса.ТекущийПользователь;
	СтруктураДанных.ДатаПоследнегоИзменения = ТекущаяДата();
	
	Возврат СтруктураДанных;
	
КонецФункции

&НаКлиенте
Процедура СоставПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ДанныеЗаполнения = ДанныеЗаполненияСтроки();
	Элементы.Состав.ТекущиеДанные.Автор = ДанныеЗаполнения.Автор;
	Элементы.Состав.ТекущиеДанные.ДатаПоследнегоИзменения = ДанныеЗаполнения.ДатаПоследнегоИзменения;
	
КонецПроцедуры
