
//                      __gggrgM**M#mggg__
//                 __wgNN@"B*P""mp""@d#"@N#Nw__
//               _g#@0F_a*F#  _*F9m_ ,F9*__9NG#g_
//            _mN#F  aM"    #p"    !q@    9NL "9#Qu_
//           g#MF _pP"L  _g@"9L_  _g""#__  g"9w_ 0N#p
//         _0F jL*"   7_wF     #_gF     9gjF   "bJ  9h_
//        j#  gAF    _@NL     _g@#_      J@u_    2#_  #_
//       ,FF_#" 9_ _#"  "b_  g@   "hg  _#"  !q_ jF "*_09_
//       F N"    #p"      Ng@       `#g"      "w@    "# t
//      j p#    g"9_     g@"9_      gP"#_     gF"q    Pb L      УЗЕЛ ПЕРЕРАСПРЕДЕЛЕНИЯ
//      0J  k _@   9g_ j#"   "b_  j#"   "b_ _d"   q_ g  ##
//      #F  `NF     "#g"       "Md"       5N#      9W"  j#                |
//      #k  jFb_    g@"q_     _*"9m_     _*"R_    _#Np  J#                |
//      tApjF  9g  J"   9M_ _m"    9%_ _*"   "#  gF  9_jNF                |
//       k`N    "q#       9g@        #gF       ##"    #"j          <---- --- ---->
//       `_0q_   #"q_    _&"9p_    _g"`L_    _*"#   jAF,'               |   |
//        9# "b_j   "b_ g"    *g _gF    9_ g#"  "L_*"qNF
//         "b_ "#_    "NL      _B#      _I@     j#" _#"
//           NM_0"*g_ j""9u_  gP  q_  _w@ ]_ _g*"F_g@
//            "NNh_ !w#_   9#g"    "m*"   _#*" _dN@"
//               9##g_0@q__ #"4_  j*"k __*NF_g#@P"
//                 "9NN#gIPNL_ "b@" _2M"Lg#N@F"
//                     ""P@*NN#gEZgNN@#@P""       D.H., 1991


Функция СоздатьЗаказ(Запрос) 			Rest.ЛогЗапроса(Запрос); 		Ответ = Rest.СоздатьЗаказ(Запрос); 	Rest.ЛогОтвета(Ответ); 			Возврат Ответ; КонецФункции
Функция ОбновитьЗаказ(Запрос) 			Rest.ЛогЗапроса(Запрос); 		Ответ = Rest.ОбновитьЗаказ(Запрос); Rest.ЛогОтвета(Ответ); 			Возврат Ответ; КонецФункции
Функция ПолучитьЗаказ(Запрос)			Rest.ЛогЗапроса(Запрос); 		Ответ = Rest.ПолучитьЗаказ(Запрос); Rest.ЛогОтвета(Ответ); 			Возврат Ответ; КонецФункции
Функция ОплатитьЗаказ(Запрос)			Rest.ЛогЗапроса(Запрос); 		Ответ = Rest.ОплатитьЗаказ(Запрос); Rest.ЛогОтвета(Ответ); 			Возврат Ответ; КонецФункции
Функция ПрикрепитьФайлКЗаказу(Запрос)	Rest.ЛогЗапроса(Запрос, Истина); Ответ = Rest.ПрикрепитьФайлКЗаказу(Запрос); Rest.ЛогОтвета(Ответ);	Возврат Ответ; КонецФункции

Функция СоздатьПользователя(Запрос) 	Rest.ЛогЗапроса(Запрос); Ответ = Rest.СоздатьПользователя(Запрос); Rest.ЛогОтвета(Ответ); 	Возврат Ответ; КонецФункции
Функция ОбновитьПользователя(Запрос)	Rest.ЛогЗапроса(Запрос); Ответ = Rest.ОбновитьПользователя(Запрос); Rest.ЛогОтвета(Ответ);	Возврат Ответ; КонецФункции
Функция ПолучитьПользователя(Запрос)	Rest.ЛогЗапроса(Запрос); Ответ = Rest.ПолучитьПользователя(Запрос); Rest.ЛогОтвета(Ответ);	Возврат Ответ; КонецФункции
Функция ПолучитьУровеньСкидки(Запрос)	Rest.ЛогЗапроса(Запрос); Ответ = Rest.ПолучитьУровеньСкидки(Запрос); Rest.ЛогОтвета(Ответ);	Возврат Ответ; КонецФункции

Функция СоздатьАдресДоставки(Запрос) 	Rest.ЛогЗапроса(Запрос); Ответ = Rest.СоздатьАдресДоставки(Запрос); Rest.ЛогОтвета(Ответ); 	Возврат Ответ; КонецФункции
Функция ОбновитьАдресДоставки(Запрос)	Rest.ЛогЗапроса(Запрос); Ответ = Rest.ОбновитьАдресДоставки(Запрос); Rest.ЛогОтвета(Ответ);	Возврат Ответ; КонецФункции
Функция ПолучитьАдресДоставки(Запрос)	Rest.ЛогЗапроса(Запрос); Ответ = Rest.ПолучитьАдресДоставки(Запрос); Rest.ЛогОтвета(Ответ);	Возврат Ответ; КонецФункции
Функция УдалитьАдресДоставки(Запрос)	Rest.ЛогЗапроса(Запрос); Ответ = Rest.УдалитьАдресДоставки(Запрос); Rest.ЛогОтвета(Ответ);	Возврат Ответ; КонецФункции

Функция ПолучитьКоличествоТоваров(Запрос)	Rest.ЛогЗапроса(Запрос); Ответ = Rest.ПолучитьКоличествоТоваров(Запрос); Rest.ЛогОтвета(Ответ); Возврат Ответ; КонецФункции
Функция ПолучитьТоварыЛегкие(Запрос)		Rest.ЛогЗапроса(Запрос); Ответ = Rest.ПолучитьТоварыЛегкие(Запрос); 	Rest.ЛогОтвета(Ответ); Возврат Ответ; КонецФункции

Функция ПолучитьТовар(Запрос) 				Rest.ЛогЗапроса(Запрос); Ответ = Rest.ПолучитьТовар(Запрос); 			Rest.ЛогОтвета(Ответ); Возврат Ответ; КонецФункции
Функция ПолучитьТовары(Запрос) 				Rest.ЛогЗапроса(Запрос); Ответ = Rest.ПолучитьТовары(Запрос); 			Rest.ЛогОтвета(Ответ); Возврат Ответ; КонецФункции
Функция ПолучитьТоварыГуиды(Запрос) 	    Rest.ЛогЗапроса(Запрос); Ответ = Rest.ПолучитьТоварыГуиды(Запрос); 		Rest.ЛогОтвета(Ответ); Возврат Ответ; КонецФункции

Функция ПолучитьКатегорию(Запрос) 			Rest.ЛогЗапроса(Запрос); Ответ = Rest.ПолучитьКатегорию(Запрос); 		Rest.ЛогОтвета(Ответ); Возврат Ответ; КонецФункции
Функция ПолучитьКатегории(Запрос) 			Rest.ЛогЗапроса(Запрос); Ответ = Rest.ПолучитьКатегории(Запрос); 		Rest.ЛогОтвета(Ответ); Возврат Ответ; КонецФункции
Функция ЗапросНаличияТовара(Запрос) 		Rest.ЛогЗапроса(Запрос); Ответ = Rest.ЗапросНаличияТовара(Запрос); 		Rest.ЛогОтвета(Ответ); Возврат Ответ; КонецФункции

Функция ПолучитьСвойстваТоваров(Запрос) 	Rest.ЛогЗапроса(Запрос);	Ответ = Rest.ПолучитьСвойстваТоваров(Запрос); 	Rest.ЛогОтвета(Ответ); Возврат Ответ; КонецФункции
Функция ПолучитьПроизводителей(Запрос) 		Rest.ЛогЗапроса(Запрос);	Ответ = Rest.ПолучитьПроизводителей(Запрос); 	Rest.ЛогОтвета(Ответ); Возврат Ответ; КонецФункции
Функция ПолучитьПроизводителя(Запрос) 		Rest.ЛогЗапроса(Запрос);	Ответ = Rest.ПолучитьПроизводителя(Запрос); 	Rest.ЛогОтвета(Ответ); Возврат Ответ; КонецФункции
Функция ПолучитьСклады(Запрос) 				Rest.ЛогЗапроса(Запрос);	Ответ = Rest.ПолучитьСклады(Запрос); 			Rest.ЛогОтвета(Ответ); Возврат Ответ; КонецФункции
Функция ПолучитьСклад(Запрос)				Rest.ЛогЗапроса(Запрос);	Ответ = Rest.ПолучитьСклад(Запрос); 			Rest.ЛогОтвета(Ответ); Возврат Ответ;КонецФункции

Функция ПолучитьТипыЦен(Запрос) 			Rest.ЛогЗапроса(Запрос);	Ответ = Rest.ПолучитьТипыЦен(Запрос); 			Rest.ЛогОтвета(Ответ); Возврат Ответ; КонецФункции
Функция ТипЦеныПолучить(Запрос) 			Rest.ЛогЗапроса(Запрос);	Ответ = Rest.ПолучитьТипыЦен(Запрос); 			Rest.ЛогОтвета(Ответ); Возврат Ответ; КонецФункции

Функция ПолучитьАкции(Запрос) 				Rest.ЛогЗапроса(Запрос);	Ответ = Rest.ПолучитьАкции(Запрос); 			Rest.ЛогОтвета(Ответ); Возврат Ответ; КонецФункции
Функция ПолучитьВариантыОплат(Запрос) 		Rest.ЛогЗапроса(Запрос);	Ответ = Rest.ПолучитьВариантыОплат(Запрос); 	Rest.ЛогОтвета(Ответ); Возврат Ответ; КонецФункции
Функция ПолучитьПорогиСкидок(Запрос) 		Rest.ЛогЗапроса(Запрос);	Ответ = Rest.ПолучитьПорогиСкидок(Запрос); 		Rest.ЛогОтвета(Ответ); Возврат Ответ; КонецФункции

Функция ПолучитьСообщения(Запрос) 				Rest.ЛогЗапроса(Запрос); Ответ = Rest.ПолучитьСообщения(Запрос); 			Rest.ЛогОтвета(Ответ); Возврат Ответ; КонецФункции
Функция ПолучитьСообщенияПользователя(Запрос) 	Rest.ЛогЗапроса(Запрос); Ответ = Rest.ПолучитьСообщенияПользователя(Запрос); Rest.ЛогОтвета(Ответ); Возврат Ответ; КонецФункции

Функция ПолучитьКартинку(Запрос) Rest.ЛогЗапроса(Запрос); Ответ = Rest.ПолучитьКартинку(Запрос); Rest.ЛогОтвета(Ответ, Истина); Возврат Ответ; КонецФункции
Функция ПолучитьКартинкуНеНоменклатуры(Запрос) Rest.ЛогЗапроса(Запрос); Ответ = Rest.ПолучитьКартинкуНеНоменклатуры(Запрос); Rest.ЛогОтвета(Ответ, Истина); Возврат Ответ; КонецФункции
Функция ПолучитьАватар(Запрос) Rest.ЛогЗапроса(Запрос); Ответ = Rest.ПолучитьАватар(Запрос); Rest.ЛогОтвета(Ответ, Истина); Возврат Ответ; КонецФункции

Функция ПолучитьСеверСтальЛимиты(Запрос) 			Rest.ЛогЗапроса(Запрос);	Ответ = Rest.ПолучитьСеверСтальЛимиты(Запрос); 			Rest.ЛогОтвета(Ответ); Возврат Ответ; КонецФункции
Функция ПолучитьСеверСтальЛимит(Запрос) 			Rest.ЛогЗапроса(Запрос);	Ответ = Rest.ПолучитьСеверСтальЛимит(Запрос); 			Rest.ЛогОтвета(Ответ); Возврат Ответ; КонецФункции
Функция ПолучитьСтатусСогласованияТовара(Запрос) 	Rest.ЛогЗапроса(Запрос);	Ответ = Rest.ПолучитьСтатусСогласованияТовара(Запрос); 	Rest.ЛогОтвета(Ответ); Возврат Ответ; КонецФункции
Функция СоздатьСогласованияТовара(Запрос) 			Rest.ЛогЗапроса(Запрос);	Ответ = Rest.СоздатьСогласованияТовара(Запрос); 		Rest.ЛогОтвета(Ответ); Возврат Ответ; КонецФункции

Функция ПолучитьДокументы(Запрос) 	Rest.ЛогЗапроса(Запрос);	Ответ = Rest.ПолучитьДокументы(Запрос); Rest.ЛогОтвета(Ответ); 			Возврат Ответ; КонецФункции
Функция ПолучитьДокумент(Запрос) 	Rest.ЛогЗапроса(Запрос);	Ответ = Rest.ПолучитьДокумент(Запрос); 	Rest.ЛогОтвета(Ответ, Истина); 	Возврат Ответ; КонецФункции

Функция ПолучитьКатегорииСтатей(Запрос) Rest.ЛогЗапроса(Запрос);	Ответ = Rest.ПолучитьКатегорииСтатей(Запрос); 	Rest.ЛогОтвета(Ответ); Возврат Ответ; КонецФункции
Функция ПолучитьСтатью(Запрос) 			Rest.ЛогЗапроса(Запрос);	Ответ = Rest.ПолучитьСтатью(Запрос); 			Rest.ЛогОтвета(Ответ); Возврат Ответ; КонецФункции
Функция ПолучитьСтатьи(Запрос) 			Rest.ЛогЗапроса(Запрос);	Ответ = Rest.ПолучитьСтатьи(Запрос); 			Rest.ЛогОтвета(Ответ); Возврат Ответ; КонецФункции
Функция ПолучитьСтатьиКатегории(Запрос) Rest.ЛогЗапроса(Запрос);	Ответ = Rest.ПолучитьСтатьиКатегории(Запрос); 	Rest.ЛогОтвета(Ответ); Возврат Ответ; КонецФункции

Функция ПолучитьМенеджеров(Запрос)      Rest.ЛогЗапроса(Запрос); Ответ = Rest.ПолучитьМенеджеров(Запрос); 		Rest.ЛогОтвета(Ответ); Возврат Ответ; КонецФункции
Функция ПолучитьМенеджера(Запрос)       Rest.ЛогЗапроса(Запрос); Ответ = Rest.ПолучитьМенеджера(Запрос); 		Rest.ЛогОтвета(Ответ); Возврат Ответ; КонецФункции

Функция ЗадачиПолучить(Запрос) 			Rest.ЛогЗапроса(Запрос); Ответ = Rest.ПолучитьЗадачи(Запрос); 			Rest.ЛогОтвета(Ответ); Возврат Ответ; КонецФункции

Функция ПолучитьКонтакты(Запрос) 		Rest.ЛогЗапроса(Запрос); Ответ = Rest.ПолучитьКонтакты(Запрос); 		Rest.ЛогОтвета(Ответ); Возврат Ответ; КонецФункции

Функция ИсторияОбъектовПолучить(Запрос) Rest.ЛогЗапроса(Запрос); Ответ = Rest.ИсторияОбъектовПолучить(Запрос); 		Rest.ЛогОтвета(Ответ); Возврат Ответ; КонецФункции

Функция СтраницыСвойствПолучить(Запрос) Rest.ЛогЗапроса(Запрос); Ответ = Rest.СтраницыСвойствПолучить(Запрос); 		Rest.ЛогОтвета(Ответ); Возврат Ответ; КонецФункции
Функция СтраницаСвойстПолучить(Запрос)  Rest.ЛогЗапроса(Запрос); Ответ = Rest.СтраницаСвойстПолучить(Запрос); 		Rest.ЛогОтвета(Ответ); Возврат Ответ; КонецФункции
