
&НаСервере
Функция ПолучитьСуммуСтроку(ВыделенныеСтроки)
	
	Возврат ДиалогиСПользователем.ПолучитьСуммуВыделеныхСтрок(ВыделенныеСтроки, "БизнесПроцесс.ИнтернетЗаявка", "Заказ.Сумма");
	
КонецФункции
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// Выведем информационную надпись
	
	//ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	//
	//Если ВыделенныеСтроки.Количество() Тогда
	//	
	//	Сумма = ПолучитьСуммуСтроку(ВыделенныеСтроки);
	//	ИнформационнаяСтрока = ?(Сумма, 
	//			"Выделено на сумму " + Сумма, 
	//			"нет суммы");
	//	
	//Иначе
	//	
	//	ИнформационнаяСтрока = "не выбраны документы";
	//	
	//КонецЕсли;
	
	
КонецПроцедуры


// ОТОБРАЖЕНИЕ

&НаСервере
Процедура ОбновитьСостяние()

	//Список.Параметры.УстановитьЗначениеПараметра("ВыбраноСостояние", 	Не Состояние.Пустая());
	//Список.Параметры.УстановитьЗначениеПараметра("Состояние", 			Состояние);
	//Список.Параметры.УстановитьЗначениеПараметра("ТолькоМои", 			ТолькоМои);
	//Список.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	
КонецПроцедуры

// ТИПОВЫЕ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Список.Параметры.УстановитьЗначениеПараметра("СостояниеЧерновик", Перечисления.СостоянияЗаказа.Черновик);
	
	ОбновитьСостяние();
	
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры

// ЭЛЕМЕНТЫ

&НаКлиенте
Процедура СостояниеФильтрПриИзменении(Элемент)
	
	ОбновитьСостяние();
	
КонецПроцедуры
&НаКлиенте
Процедура СостояниеФильтрОчистка(Элемент, СтандартнаяОбработка)
	
	ОбновитьСостяние();
	
КонецПроцедуры
&НаКлиенте
Процедура ТолькоМоиПриИзменении(Элемент)
	
	ОбновитьСостяние();
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюДоступностью()
	Элементы.Менеджер.Видимость          = РольДоступна("РазрешеноМенятьМенеджераЗаказа");
	Элементы.ИзменитьМенеджера.Видимость = РольДоступна("РазрешеноМенятьМенеджераЗаказа");
КонецПроцедуры

&НаСервере
Процедура ИзменитьМенеджераНаСервере()
	ЗаказО=Элементы.Список.ТекущаяСтрока.Заказ.ПолучитьОбъект();
	ЗаказО.МенеджерЗаказа=Менеджер;
    ЗаказО.Записать();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьМенеджера(Команда)
	ИзменитьМенеджераНаСервере();
КонецПроцедуры
