
Процедура ПриЗаписи(Отказ, Замещение)
	
	// Отправим сайту инфу о том что лимит интернет-пользователя нужно бы обновить
	
	КодПолученияМассиваОбъектов = "
	|массивФизЛиц = Новый Массив;
	|Для каждого лЗапись Из пОбъект Цикл
	|	Если лЗапись.Инициатор = Справочники.ФизическиеЛица.ПустаяСсылка() Тогда Продолжить; КонецЕсли;
	|	массивФизЛиц.Добавить(лЗапись.Инициатор);
	|КонецЦикла;
	|
	|Запрос = Новый Запрос;
	|Запрос.Текст = ""ВЫБРАТЬ Ссылка ИЗ Справочник.ПользователиИнтернет ГДЕ ФизЛицо В (&ФизЛицо)"";
	|Запрос.УстановитьПараметр(""ФизЛицо"", массивФизЛиц);
	|
	|массивОбъектов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(""Ссылка"");
	|";
	Если 	Количество() И
			Константы.ИнтеграцияССайтом.Получить() И
			Не API2.ЗаписатьНаборВБуферОбновленияНаСайте(ЭтотОбъект, Новый Структура("Поле, АдресРесурсаСервера, Очередь, ФункцияПолученияОбъекта, КодПолученияМассиваОбъектов", "Инициатор", "/api/users", 40, "ПолучитьПользователей", КодПолученияМассиваОбъектов)) Тогда
			
		Отказ = Истина КонецЕсли;
	
КонецПроцедуры
