
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ТипЦенОснование.СписокВыбора.ЗагрузитьЗначения(Параметры.ТипыЦен.ВыгрузитьЗначения());
    Элементы.ТипЦенОснование.СписокВыбора.Добавить("Себестоимость", "Себестоимость");
	
	Для Каждого Строка из Параметры.ТипыЦен Цикл
		НоваяСтрока = Таблица.Добавить();
		НоваяСтрока.ТипЦен = Строка.Значение;
		НоваяСтрока.ТипЦенОснование = НоваяСтрока.ТипЦен;
		НоваяСтрока.Пометка = Истина;
	КонецЦикла;
	КонецПроцедуры

&НаКлиенте
Процедура ВыделитьВсе(Команда)
	
	Для Каждого Строка Из Таблица Цикл
		Строка.Пометка = Истина;
	КонецЦикла;

КонецПроцедуры
&НаКлиенте
Процедура СнятьВсе(Команда)
	
	Для Каждого Строка Из Таблица Цикл
		Строка.Пометка = Ложь;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)
	
	СоответствиеИмен = ВладелецФормы.ПолучитьСоответствияЦен();

	// какая-то пошаговая фигня
	
	Для Каждого СтрокаПроцент Из Таблица Цикл
		Если СтрокаПроцент.Пометка И СтрокаПроцент.Процент <> 0 Тогда
			
			//частный случай для увеличения цены на процент по отношению к себестоимости
			Если ТипЗнч(СтрокаПроцент.ТипЦенОснование) = Тип("Строка") Тогда
				
				ИмяКолонки = СоответствиеИмен[СтрокаПроцент.ТипЦен];
				
			   	Для Каждого Строка Из ВладелецФормы.Цены Цикл
					Если Строка.Пометка И ЗначениеЗаполнено(Строка.Себестоимость) Тогда
						
						// величину себестоимости приводим к валюте изменяемой колонки
						ВеличинаОснования = Строка.Себестоимость*Строка["БазовыйТипКратность" + ИмяКолонки]/Строка["БазовыйТипКурс" + ИмяКолонки];	
						
						Слагаемое = ВеличинаОснования*(СтрокаПроцент.Процент/100);
						
						Строка["БазовыйТипНоваяЦена" + ИмяКолонки] = Строка["БазовыйТипНоваяЦена" + ИмяКолонки] + Слагаемое; 	
						
						ВладелецФормы.ЦеныПересчеты(Строка.ПолучитьИдентификатор(), ИмяКолонки);	
						
					КонецЕсли;		
				КонецЦикла;
				
			// общий случай для увеличения цены на процент относительно любой выбранной базовой колонки
			Иначе
				ИмяКолонки = СоответствиеИмен[СтрокаПроцент.ТипЦен];
				ИмяКолонкиОснование = СоответствиеИмен[СтрокаПроцент.ТипЦенОснование];
		        ИмяКолонкиЦеныОснование = ?(ПоОтношениюК, "БазовыйТипНоваяЦена" + ИмяКолонкиОснование,"БазовыйТип" + ИмяКолонкиОснование);
				
			   	Для Каждого Строка Из ВладелецФормы.Цены Цикл
					Если Строка.Пометка И ЗначениеЗаполнено(Строка[ИмяКолонкиЦеныОснование]) Тогда
						
							// величину колонки основания приводим к типу изменяемой колонки
							ВеличинаОснования = Строка[ИмяКолонкиЦеныОснование]*(Строка["БазовыйТипКурс" + ИмяКолонкиОснование]*Строка["БазовыйТипКратность" + ИмяКолонки])/(Строка["БазовыйТипКурс" + ИмяКолонки]*Строка["БазовыйТипКратность" + ИмяКолонкиОснование]);
												
							Слагаемое = ВеличинаОснования*(СтрокаПроцент.Процент/100);
						
							Строка["БазовыйТипНоваяЦена" + ИмяКолонки] = Строка["БазовыйТипНоваяЦена" + ИмяКолонки] + Слагаемое;
							
							ВладелецФормы.ЦеныПересчеты(Строка.ПолучитьИдентификатор(), ИмяКолонки);
						
					КонецЕсли;		
				КонецЦикла;
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры
