&НаКлиенте
Процедура ДополнительныеРеквизиты(Команда)
	
	ФункцииФормДокументов.ОткрытьОбщиеРеквизиты(ЭтаФорма);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтандартныеОчкиНаСервере()
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ ВидОчков, Количество ИЗ РегистрСведений.СтандартныеОчки.СрезПоследних(&Период, Сотрудник = &Сотрудник И Отдел = &Отдел И Подразделение = &Подразделение)");
	
	Запрос.УстановитьПараметр("Период", Объект.Месяц);
	Запрос.УстановитьПараметр("Сотрудник", Объект.Сотрудник);
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	Запрос.УстановитьПараметр("Отдел", Объект.Отдел);
	
	объект.Очки.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСтандартныеОчки(Команда)
	ЗаполнитьСтандартныеОчкиНаСервере();
КонецПроцедуры
