
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	СтандартнаяОбработка 	= Ложь;      
	ИсточникНастроек 		= Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемы);
	ОбработкаРасшифровкиКД 	= Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, ИсточникНастроек);            
	
	ОбработкаРасшифровкиКД.ПоказатьВыборДействия(Новый ОписаниеОповещения("ВыборДействияРасшифровки", ЭтаФорма),Расшифровка);            


КонецПроцедуры
&НаКлиенте
Процедура ВыборДействияРасшифровки(ВыполненноеДействие, ПараметрВыполненногоДействия, ДополнительныеПараметры) Экспорт
	
	Если ВыполненноеДействие <> ДействиеОбработкиРасшифровкиКомпоновкиДанных.Нет Тогда                        
		Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда                                    
			
			ПоказатьЗначение(,ПараметрВыполненногоДействия); 
			
		ИначеЕсли ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Расшифровать Тогда
			
			//РасшифроватьНаСервере(Расшифровка);
			
		//Иначе
			//Описание = Новый ОписаниеОбработкиРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Расшифровка, ПараметрДействия); КонецЕсли; КонецЕсли;       
			
		Иначе СтандартнаяОбработка = Истина КонецЕсли; КонецЕсли;
КонецПроцедуры
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Результат = Параметры.Результат;
	АдресСхемы = Параметры.АдресСхемы;
	ДанныеРасшифровки = Параметры.ДанныеРасшифровки;
	
КонецПроцедуры
