
&НаСервере
Процедура ЗагрузитьВсеНаСервере()
	
	стрОшибки = "";
	
	
	Правило = КэшируемыеФункции.ПолучитьПравилаСопостовленияУТ81Поимени82("Справочник.ЕдиницыИзмерения", стрОшибки);
	Если Правило = Неопределено Тогда
		
		ОбщиеФункции.СообщитьТекст(стрОшибки);
		
	Иначе
		
		Если Не COMServer.ЗагрузитьОбъекты(Правило.Ссылка,, стрОшибки) Тогда
		
			ОбщиеФункции.СообщитьТекст(стрОшибки);
		
		Иначе
		
			ОбщиеФункции.СообщитьТекст("Справочник загружена");
		
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВсе(Команда)
	
	ЗагрузитьВсеНаСервере();
	Элементы.Список.Обновить();
	
КонецПроцедуры
