
Функция ОбновитьСтатусыВсехЗадач(ДатаНачала = Неопределено, ДатаОкончания = Неопределено) Экспорт
	
	// Это можно было сделать одним запросом
	
	СтатусВРаботе = Перечисления.СтатусыЗадач.ВРаботе;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ МИНИМУМ(ДатаСоздания) ДатаСоздания ИЗ Справочник.Задачи ГДЕ ДатаСоздания <> &ПустаяДата И НЕ ПометкаУдаления;
	|ВЫБРАТЬ ДатаСоздания, ДатаЗавершения, Ссылка КАК Задача, ВЫБОР КОГДА Статус = &СтатусУточняется ТОГДА &СтатусВРаботе ИНАЧЕ Статус КОНЕЦ Статус ИЗ Справочник.Задачи ГДЕ ДатаСоздания <> &ПустаяДата И НЕ ПометкаУдаления");
	
	Запрос.УстановитьПараметр("СтатусВРаботе", 		СтатусВРаботе);
	Запрос.УстановитьПараметр("СтатусУточняется", 	Перечисления.СтатусыЗадач.ТребуетУточнение);
	Запрос.УстановитьПараметр("ПустаяДата", 		'00010101');
	
	Пакет 			= Запрос.ВыполнитьПакет();
	Выборка 		= Пакет[0].Выбрать();
	ВыборкаЗадач 	= Пакет[1].Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Набор 	= РегистрыСведений.СрезЗадачПоДням.СоздатьНаборЗаписей();
		текДата = НачалоДня(?(ДатаНачала = Неопределено, Выборка.ДатаСоздания, ДатаНачала));
		текДень = НачалоДня(?(ДатаОкончания = Неопределено, ТекущаяДата(), ДатаОкончания));
		
		Пока текДата <= текДень Цикл
			
			ВыборкаЗадач.Сбросить();
			Пока ВыборкаЗадач.Следующий() Цикл 
				Если ВыборкаЗадач.ДатаСоздания <= текДата Тогда
					
					НовЗапись = Набор.Добавить();
					НовЗапись.Период = текДата;
					НовЗапись.Задача = ВыборкаЗадач.Задача;
					НовЗапись.Статус = ?(ВыборкаЗадач.ДатаЗавершения > текДата, СтатусВРаботе, ВыборкаЗадач.Статус); КонецЕсли;  КонецЦикла;
			
			текДата = текДата + 86400; КонецЦикла; КонецЕсли;
		
	Возврат ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(Набор);
	
КонецФункции