
&НаСервере
Процедура ОбновитьДерево()
	
	//Дерево.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
	
КонецПроцедуры

Функция ТоварыБуфераСтрокой()
	
	товТЗ = Буфер.Выгрузить();
	товТЗ.Колонки.Ячейка.Имя = "ЯчейкаОтправитель";
	
	Возврат ЗначениеВСтрокуВнутр(товТЗ);
	
КонецФункции

// ТИПОВЫЕ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Склад = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор("d41ff055-98b3-11e0-9ab8-0015175303fd"));
	ОбновитьДерево();
	
КонецПроцедуры
&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	Буфер.Очистить();
	ОбновитьДерево();
	
КонецПроцедуры

// КОМАНДЫ

&НаКлиенте
Процедура СоздатьПеремещение(Команда)
	
	Если Буфер.Количество() Тогда
	
		ОткрытьФорму("Документ.ПеремещениеТоваров.ФормаОбъекта", 
					Новый Структура("СкладОтправитель, ТоварыСтрокой", 
								Объект.Склад, ТоварыБуфераСтрокой()));
		
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ДеревоВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	НовСтрока = Буфер.Добавить();
	ЗаполнитьЗначенияСвойств(НовСтрока, Элемент.ТекущиеДанные);
	
КонецПроцедуры
&НаКлиенте
Процедура ОчиститьБуфер(Команда)
	
	Буфер.Очистить();
	
КонецПроцедуры
