
&НаСервере
Функция ЗагрузитьСтроку(стрОшибки)
	
	Возврат COMServer.ЗагрузитьСтрокуЭкселя();
	
КонецФункции

&НаСервере
Функция ЗагрузитьНаСервере()
	
	стрОшибки = "";
	Соединение = КэшируемыеФункции.ИницилизироватьADO(, стрОшибки);
	
	Если Соединение = Неопределено Тогда
		
		ОбщиеФункции.СообщитьТекст(стрОшибки);
		Возврат Ложь;
		
	Иначе
		
		// Получим структуру правил
	
		СтруктураПравил = КонвертацияТипов.ПолучитьСтруктуруИзСправочника(Объект.Правило, стрОшибки);
		Если СтруктураПравил = Неопределено Тогда
			ОбщиеФункции.СообщитьТекст(стрОшибки);
			Возврат Ложь;
		КонецЕсли;

		// Сфрмируем текст запроса
		
		Возврат MySQLСервер.ПолучитьТаблицу(Соединение, структураПравил, стрОшибки)
						
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции
&НаСервере
Функция СинхронизироватьНаСервере()
	
	стрОшибки = "";
	Соединение = КэшируемыеФункции.ИницилизироватьADO(, стрОшибки);
	
	Если COMServer.СинхронизироватьОбъекты_в_MySQL(Объект.Правило, стрОшибки) Тогда
		
		Возврат Истина;
		
	Иначе
		
		ОбщиеФункции.СообщитьТекст(стрОшибки);
		Возврат Ложь;
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура Загрузить(Команда)
	
	стрОшибки = "";
	
	// Проверим правило
	
	Если Объект.Правило.Пустая() Тогда
		ОбщиеФункции.СообщитьТекст("Не указано правило", "Правило", Объект);
		Возврат;
	КонецЕсли;
	
	// Получим структуру правил
	
	//СтруктураПравил = КонвертацияТипов.ПолучитьСтруктуруИзСправочника(Объект.Правило, стрОшибки);
	//Если СтруктураПравил = Неопределено Тогда
	//	ОбщиеФункции.СообщитьТекст(стрОшибки);
	//	Возврат;
	//КонецЕсли;
	
	// Получим эксель
	
	//Эксель = COMФункцииДиалогов.ОткрытьФайлЭкселя(Объект.ИмяФайла, стрОшибки);
	//
	//Если Эксель = Неопределено Тогда
	//	ОбщиеФункции.СообщитьТекст(стрОшибки);
	//	Возврат;
	//КонецЕсли;
	
	//Если ЗагрузитьНаСервере() Тогда
	//	
	//	ОбщиеФункции.СообщитьТекст("Данные загружены.");
	//	
	//КонецЕсли;
	
	Если СинхронизироватьНаСервере() Тогда
		
		ОбщиеФункции.СообщитьТекст("Данные загружены.");
		
	КонецЕсли;
	
	// Подготовим таблицу для считывания
	
КонецПроцедуры

&НаСервере
Функция ЗагрузитьНаСервере2(стрОшибки)
	
	Возврат COMServer.ЗагрузитьОбъектИзЭкселя(
			Вычислить("Метаданные." + Объект.Правило.ВидОбъекта), 
			РеквизитФормыВЗначение("ТаблицаДанных"), 
			Новый Структура("ЭтоГруппа", 
						Объект.правило.Группа), 
		стрОшибки);
	
КонецФункции

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДВ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДВ.Фильтр =  "Эксель (*.xls)|*.xls*";
	
	Если ДВ.Выбрать() Тогда
		
		Объект.ИмяФайла = ДВ.ПолноеИмяФайла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КартинкаЗагрузки = Метаданные.ОбщиеКартинки.Эксель;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьИмяФайлаПоПравилу()
	
	Объект.ИмяФайла = Объект.Правило.ИмяФайла;
	
КонецПроцедуры

