
Процедура ПередЗаписью(Отказ)
	Запрос=Новый Запрос 
	("ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДоговорыКонтрагентов.Наименование
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Наименование = &Наименование
	|	И ДоговорыКонтрагентов.Ссылка <> &Ссылка");
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат=Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		ОбщиеФункции.СообщитьТекст("Договор с таким номером уже существует !!");
		Отказ=Истина;
	КонецЕсли;
	
	//+neti Муталлапова 26.04.2017
	Если не ДоговорПролонгируется Тогда 
		Пролонгация = Справочники.ПролонгацияДоговоров.ПустаяСсылка();
	КонецЕсли;
	//+neti Муталлапова 26.04.2017
	
КонецПроцедуры          

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	СтатусДоговора = Перечисления.СтатусДоговора.НеДействует;
	
	// + neti Муталлапова 21.04.2017
	ДатаСоздания = ТекущаяДата();
	Автор = ПараметрыСеанса.ТекущийПользователь;
	// - neti Муталлапова 21.04.2017
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	 СтатусДоговора = Перечисления.СтатусДоговора.НеДействует;
 КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	 
	Если УсловияОплаты = Справочники.УсловияОплаты.ЧастичнаяОплата И УровеньПредоплаты = 0 Тогда 
		Отказ = Истина;
		Сообщить("Укажите уровень предоплаты!");
	КонецЕсли;
	
	Если ВидДоговора.ОбязателенСпособДоставки И Не ЗначениеЗаполнено(ВариантДоставки) Тогда 
		Сообщить("Укажите способ доставки!");
	КонецЕсли;
	
 КонецПроцедуры
