
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Описание = "файл не выбран"
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоАдресВременногоХранилища(АдресФайла) Тогда
		ТекущийОбъект.Файл = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресФайла));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайл(Команда)
	СтандартнаяОбработка = Ложь;
	
	новАдресФайла = "";
	ИмяФайла = "";
	Если ПоместитьФайл(новАдресФайла, "", ИмяФайла, Истина, УникальныйИдентификатор) Тогда
		АдресФайла = новАдресФайла;
		Модифицированность = Истина;
		
		ВыбФайл = Новый Файл(ИмяФайла);
		Объект.Описание = Строка(Окр(ВыбФайл.Размер() / 1024)) + " Кб Дата изменения: " + Формат(ВыбФайл.ПолучитьВремяИзменения(), "ДФ=dd.MM.yyyy");
		
		ИмяФайла = СтрЗаменить(ИмяФайла, "\", Символы.ПС);
		Объект.Наименование = СтрПолучитьСтроку(ИмяФайла, СтрЧислоСтрок(ИмяФайла));
		Объект.Расширение = СтрЗаменить(ВыбФайл.Расширение, ".", "");
	КонецЕсли;
КонецПроцедуры
