&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Отбор.Свойство("Владелец") Тогда
		Владелец = Параметры.Отбор.Владелец;
		Элементы.ФормаСоздатьНаОснованииВладельца.Видимость = Истина;
	КонецЕсли;
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата",ТекущаяДата());
КонецПроцедуры

&НаСервере
Процедура СделатьОсновнымНаСервере()
	Если Элементы.Список.ТекущаяСтрока<>Неопределено Тогда
		РегЗапись = РегистрыСведений.ОсновнойГрузополучатель.СоздатьМенеджерЗаписи();
		РегЗапись.Контрагент = Элементы.Список.ТекущаяСтрока.Владелец;
		РегЗапись.Грузополучатель = Элементы.Список.ТекущаяСтрока.Ссылка;
		РегЗапись.Записать(Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СделатьОсновным(Команда)
	СделатьОсновнымНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНаОснованииВладельца(Команда)
	Если Владелец.Пустая() Тогда
		Возврат;
	КонецЕсли;
	СоздатьГрузополучателяСервер(Владелец);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СоздатьГрузополучателяСервер(Владелец)
	Справочники.Грузополучатели.СоздатьГрузополучателяПоВладельцу(Владелец,Владелец);
КонецПроцедуры

&НаСервере
Процедура УбратьОсновныхНаСервере()
	Если Элементы.Список.ТекущаяСтрока<>Неопределено Тогда
		Рег = РегистрыСведений.ОсновнойГрузополучатель.СоздатьНаборЗаписей();
		Рег.Отбор.Контрагент.Установить(Элементы.Список.ТекущаяСтрока.Владелец);
		Рег.Записать();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УбратьОсновных(Команда)
	УбратьОсновныхНаСервере();
	Элементы.Список.Обновить();
КонецПроцедуры
