
&НАсЕРВЕРЕ
Процедура ПечатьНаСервере(ТабДок, МассивНоменклатуры)
	
	ФормированиеПечатныхФорм.НаПечатьЭтикетки(ТабДок, МассивНоменклатуры);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДок = Новый ТабличныйДокумент;
	
	Печать(ТабДок, ПараметрКоманды);

	ФункцииФормДокументов.УстановитьНастройкиТабличногоДокумента(ТабДок);
	
	ТабДок.АвтоМасштаб = Истина;
	ТабДок.РазмерКолонтитулаСверху = 0;
	ТабДок.РазмерКолонтитулаСнизу = 0;
	ТабДок.ПолеСверху = 0;
	ТабДок.ПолеСлева = 0;
	ТабДок.ПолеСнизу = 0;
	ТабДок.ПолеСправа = 0;
	
	//ТабДок.РазмерСтраницы = "eti01";
	
	ТабДок.Показать();
	
	в = 2;
	
КонецПроцедуры

&НаСервере
Функция Печать(ТабДок, ПараметрКоманды, ПараметрыПечати = Неопределено)
	
	
	
	//Инд = -1;
	//Для Каждого Ссылка Из ПараметрКоманды Цикл Инд = Инд + 1;
	//	
	//		Если Инд Тогда
	//			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	//		КонецЕсли;
	//		
	//		// как-то совсем тупо
	//		
	//		Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Номенклатура") И НЕ Ссылка.ЭтоГруппа Тогда
	//			
				ПечатьНаСервере(ТабДок, ПараметрКоманды);

	//		ИначеЕсли 
	//			ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
	//			
	//			ПараметрыПечати = Новый Структура("Организация", Ссылка.Организация);
	//			Печать(ТабДок, Ссылка.Товары.ВыгрузитьКолонку("Номенклатура"), ПараметрыПечати)
	//		КонецЕсли;
	//			
	//КонецЦикла;
	
КонецФункции