&НаСервере
Процедура ОбновитьМестаСтр()
	
	Места = СтрСоединить(Объект.Места.Выгрузить(,"Место").ВыгрузитьКолонку("Место"), "; ");
	
КонецПроцедуры
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьМестаСтр();
	
	// Загрузим отборы
	
	Схема = Справочники.ПакетыПечатныхДокументов.ПолучитьМакет("МакетНастроек"); 

	АдресСхемыКомпоновкиНовый = ПоместитьВоВременноеХранилище(Схема, ЭтаФорма.УникальныйИдентификатор);
	ИсточникНастроек = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресСхемыКомпоновкиНовый);
	
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	
	Запрос = Новый Запрос("ВЫБРАТЬ НастройкаКомпоновки Из Справочник.ПакетыПечатныхДокументов ГДЕ Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЭлементыКомпоновки = Выборка.НастройкаКомпоновки.Получить();
		
		Если ЭлементыКомпоновки <> Неопределено Тогда
			КонвертацияТипов.ЗаполнитьЭлементыОтбораКомпоновкиДанных(ЭлементыКомпоновки.Элементы, КомпоновщикНастроек.Настройки.Отбор.Элементы); КонецЕсли; КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокМест()
	
	Список 		= Новый СписокЗначений;
	ТипПереч 	= Объект.Ссылка.Метаданные().ТабличныеЧасти.Места.Реквизиты.Место.Тип.Типы()[0];
	МетаПер 	= Метаданные.НайтиПоТипу(ТипПереч);
	Для КАждого Мета Из МетаПер.ЗначенияПеречисления ЦИкл Пер = Перечисления[МетаПер.Имя][Мета.Имя]; Список.Добавить(Пер, Мета.Синоним, Объект.Места.НайтиСтроки(Новый Структура("Место", Пер)).Количество()); КонецЦикла;
	
	Возврат Список;
	
КонецФункции
&НаКлиенте
Процедура ОтметилМеста(Список, ДополнительныеПараметры) Экспорт
	
	Если Список <> Неопределено Тогда Модифицированность = Истина;
		Объект.Места.Очистить();
		Для Каждого Элемент ИЗ Список Цикл Если Элемент.Пометка Тогда Объект.Места.Добавить().Место = Элемент.Значение КонецЕсли; КонецЦикла;
		ОбновитьМестаСтр(); КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура Места1НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПолучитьСписокМест().ПоказатьОтметкуЭлементов(Новый ОписаниеОповещения("ОтметилМеста", ЭтаФорма), "Где показывать пакет?");
	
КонецПроцедуры

&НаКлиенте
Процедура СоставПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элементы.Состав.ТекущиеДанные.ЧислоКопий = 1; КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ТекущийОбъект.НастройкаКомпоновки = Новый ХранилищеЗначения(КомпоновщикНастроек.Настройки.Отбор);
	
КонецПроцедуры
