
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Документы[Метаданные().Имя].ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства);
	ПроведенияДокументов.ПровестиПоВсемРегистрам(Метаданные().Движения, ДополнительныеСвойства, Движения, Отказ);
	Движения.Записать();	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	НеЗаполненыИд = "";
	Для каждого лПартнер Из Контрагенты Цикл
		Если ПустаяСтрока(лПартнер.Контрагент.ИдДляСайта) Тогда
			НеЗаполненыИд = НеЗаполненыИд + ?(ПустаяСтрока(НеЗаполненыИд), "", ", ") + лПартнер.Контрагент;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ПустаяСтрока(НеЗаполненыИд) Тогда
		Сообщить(	"Заполните поле ""ID для сайта"" для партнеров: " + НеЗаполненыИд + Символы.ПС + 
				"Данное поле требуется для правильной связи товара, пользователя на сайте garagetools.ru" + Символы.ПС + 
				"Заполняйте только латинскими буквами, примеры:" + Символы.ПС + 
				"Северсталь -> severstal | ССМ-Тяжмаш (ООО) -> tyzhmash | Северсталь ТПЗ-Шексна (ООО) -> tpz_sheksna");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
