
&НаКлиенте
Перем ИсторияПереходов;

&НаСервере
Процедура ОбновитьСписокПапок(Путь)
	
	СписокПапок.Очистить();
	Файлы = НайтиФайлы(Путь, "*", Ложь);
	
	Для Каждого Файл Из Файлы Цикл Если Файл.ЭтоКаталог() Тогда СписокПапок.Добавить(Файл.ПолноеИмя, Файл.Имя); КонецЕсли; КонецЦикла;
	
	СписокПапок.СортироватьПоПредставлению();
	          
КонецПроцедуры
&НаКлиенте
Процедура ОбновитьОтображение()
	
	ТекущийПуть = ИсторияПереходов[ИсторияПереходов.ВГраница()];
	Элементы.Назад.Видимость = ИсторияПереходов.Количество() > 1;
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	Закрыть(ТекущийПуть);
	
КонецПроцедуры

&НаКлиенте
Процедура НазадНажатие(Элемент)
	
	Если ИсторияПереходов.Количество() > 1 Тогда
		
		ИсторияПереходов.Удалить(ИсторияПереходов.ВГраница());
		ОбновитьСписокПапок(ИсторияПереходов[ИсторияПереходов.ВГраница()]);
		ОбновитьОтображение();  КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПервыйПуть = "c:\";
	ИсторияПереходов.Добавить(ПервыйПуть);
	ОбновитьСписокПапок(ПервыйПуть);
	ОбновитьОтображение();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПапокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Путь = Элемент.ТекущиеДанные.Значение;
	ИсторияПереходов.Добавить(Путь);
	ОбновитьСписокПапок(Путь);
	ОбновитьОтображение();
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийПутьПриИзменении(Элемент)
	
	ОбновитьСписокПапок(ТекущийПуть);
	
КонецПроцедуры

ИсторияПереходов = Новый Массив;