&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	кому = "";
	Если ВвестиСтроку(кому, "EMail:") Тогда
	
		Вложения = ПолучитьВложения(ПараметрКоманды);
		Если Вложения <> Неопределено Тогда
			
			Почта2Клиент.ОтправитьПочтовоеСообщениеПочтовомуКлиенту(Новый Структура("Кому, Вложения", Кому, Вложения)); КонецЕсли; КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВложения(ПараметрКоманды)
	
	Вложения = Новый Массив;
	Для Каждого Ссылка Из ПараметрКоманды Цикл 
		
		ТабДок = Новый ТабличныйДокумент;
		
		Если ТипЗнч(Ссылка) = Тип("БизнесПроцессСсылка.ЗаявкаПокупателя") Тогда
			Документы.ЗаказПокупателя.Печать_СчетЗаказ(ТабДок, Ссылка.Заказ, "Счет");
			СсылкаДок = Ссылка.Заказ;
		ИначеЕсли
			ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			Документы.ЗаказПокупателя.Печать_СчетЗаказ(ТабДок, Ссылка, "Счет");
			СсылкаДок = Ссылка;
		ИначеЕсли
			ТипЗнч(Ссылка) = Тип("ДокументСсылка.ИнтернетЗаказПокупателя") Тогда
			Документы.ИнтернетЗаказПокупателя.Печать_СчетЗаказ(ТабДок, Ссылка, "Счет");
			СсылкаДок = Ссылка;
		ИначеЕсли
			ТипЗнч(Ссылка) = Тип("БизнесПроцессСсылка.ИнтернетЗаявка") Тогда
			Документы.ИнтернетЗаказПокупателя.Печать_СчетЗаказ(ТабДок, Ссылка.Заказ, "Счет");
			СсылкаДок = Ссылка.Заказ;
		Иначе Продолжить; КонецЕсли;
		
		Вложение = Почта2Сервер.СохранитьДокументВОблаке(СсылкаДок, ТабДок);
		Если Вложение = Неопределено Тогда Возврат Неопределено КонецЕсли; 
		Вложения.Добавить(Вложение); КонецЦикла;
	
	Возврат Вложения;
		
КонецФункции