

&НаКлиенте
Процедура Подбор(Команда)
	ОткрытьФорму("Справочник.ФизическиеЛица.Форма.ФормаВыбора", Новый Структура("МножественныйВыбор", Истина), Элементы.Состав); //,,,, Новый ОписениеОповещения("НеобходимыеПозицииВыбраны", ЭтаФорма));
КонецПроцедуры


&НаКлиенте
Процедура НеобходимыеПозицииВыбраны(ВыбранноеЗначение, Параметры) Экспорт
КонецПроцедуры

&НаКлиенте
Процедура СоставОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		Для Каждого Строка Из ВыбранноеЗначение Цикл
			НоваяСтрока = Объект.Состав.Добавить();
			НоваяСтрока.ФизическоеЛицо = Строка; КонецЦикла; КонецЕсли;
КонецПроцедуры
