////////////////////////////////////////////////////////////////////////////////
// СЕКЦИЯ ОБРАБОТЧИКОВ СОБЫТИЙ
//

&НаКлиенте
// Обработчик события Выбор элемента Список типа ДинамическийСписок формы.
// Если установлен флаг особой обработки, то форма вызвана модально и необходимо
// вернуть выбранную строку.
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОповеститьОВыборе(ВыбраннаяСтрока);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаСервере
// Обработчик события ПриСозданииНаСервере формы.
// Если форма вызвана с установленным флагом ОсобаяОбработка, то в форме выбора
// необходимо отобразить только базовые валюты (независимые).
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ФормаПодбора") Тогда
		ЗакрыватьПриВыборе = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("ЗагружаемыеВалюты") Тогда
		УстановитьОтборПоЗагружаемымВалютам();
	КонецЕсли;
		
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЕКЦИЯ "СЛУЖЕБНЫХ" ФУНКЦИЙ И ПРОЦЕДУР 

&НаСервере
// Метод устанавливает такой запрос динамического списка формы, что из ИБД
// будут выбираться только базовые (независимые) валюты.
//
Процедура УстановитьОтборПоЗагружаемымВалютам()
	
	ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВалютаЗагружается");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Истина;
	
КонецПроцедуры
