
&НаСервере
Функция ПолучитьСуммуСтроку(ВыделенныеСтроки)
	
	//Возврат ДиалогиСПользователем.ПолучитьСуммуВыделеныхСтрок(ВыделенныеСтроки, "БизнесПроцесс.ИнтернетЗаявка", "Заказ.Сумма");
	
КонецФункции
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	//// Выведем информационную надпись
	//
	//ВыделенныеСтроки = Элементы.Список.ВыделенныеСтроки;
	//
	//Если ВыделенныеСтроки.Количество() Тогда
	//	
	//	Сумма = ПолучитьСуммуСтроку(ВыделенныеСтроки);
	//	ИнформационнаяСтрока = ?(Сумма, 
	//			"Выделено на сумму " + Сумма, 
	//			"нет суммы");
	//	
	//Иначе
	//	
	//	ИнформационнаяСтрока = "не выбраны документы";
	//	
	//КонецЕсли;

	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТекущийПартнер") Тогда
		Контрагент = Параметры.ТекущийПартнер;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьПроцесс(ИмяПроцесса, СсылкаЗаказ)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка
	|ИЗ БизнесПроцесс." + ИмяПроцесса + "
	|ГДЕ Заказ = &Заказ
	|");
	
	Запрос.УстановитьПараметр("Заказ", СсылкаЗаказ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Ссылка;
		
	КонецЕсли;
	
КонецФункции
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ИмяПроцесса = Элементы.Список.ТекущиеДанные.ИмяПроцесса;
	
	Если Не ПустаяСтрока(ИмяПроцесса) Тогда
		
		Процесс = ПолучитьПроцесс(ИмяПроцесса, ВыбраннаяСтрока);
		Если Процесс <> Неопределено Тогда
			
			СтандартнаяОбработка = Ложь;
			ОткрытьФорму("БизнесПроцесс." + ИмяПроцесса + ".ФормаОбъекта", Новый Структура("Ключ", Процесс), ЭтаФорма);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Слежение.Записать("Открытие. Документы контрагента с корректировками", "ЖурналыДокументов.ДокументыПартнераСКорректировками");
	
КонецПроцедуры
