&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИмяФайлаОжидания = Параметры.ИмяФайлаОжидания;
	
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ОжиданиеФайла", 1, ЛОЖЬ);
	
КонецПроцедуры
&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если Не ФайлЗакрыт И
			Вопрос("Если закрыть форму то открытый документ word`a не будет сохранен в базе данных.
			|Все равно закрыть?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			
		Отказ = Истина; КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОжиданиеФайла()
	
	Если ОбщиеФункции.ФайлДоступенДляЗаписи(ИмяФайлаОжидания) Тогда
		
		ФайлЗакрыт = Истина;
		Закрыть(Истина); КонецЕсли;

КонецПроцедуры
 


