
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	ЗначениеОтбора  = Новый Структура("Заказ", ?(ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.ИнтернетЗаказПокупателя"),ПараметрКоманды ,ПолучитьЗаказ(ПараметрКоманды)));
   
	ПараметрыФормы  = Новый Структура("Отбор", ЗначениеОтбора);
	
	ОткрытьФорму("Справочник.ХранилищеФайловЗаказов.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры
&НаСервере
Функция ПолучитьЗаказ(БП)
	Возврат БП.Заказ;
КонецФункции

