
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	GUID = Объект.Ссылка.УникальныйИдентификатор();
	
	ОтборыСписковКлиентСервер.УстановитьЭлементОтбораСписка(Сотрудники, "Склад", Объект.Ссылка);
	
	
КонецПроцедуры
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Отказ = Истина;
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(,"Необходимо сперва записать склад!",,"Предупреждение");
	Иначе
		ОткрытьФорму("РегистрСведений.СкладыПользователя.ФормаЗаписи", Новый Структура("Склад", Объект.Ссылка)); КонецЕсли;
		
КонецПроцедуры


