
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//ОткрытьФорму(	"ОбщаяФорма.НастроенныйОтчет",
	//				Новый Структура("ИмяОтчета, ИмяМакета, Отборы, ЗаголовокОкна",
	//					"ВедомостьТоваров",
	//					"ДвижениеОдногоТовара",
	//					Новый Структура("Номенклатура", 
	//										ПараметрКоманды),
	//					"Движения товара"),
	//				ПараметрыВыполненияКоманды.Источник,
	//				ПараметрыВыполненияКоманды.Уникальность,
	//				ПараметрыВыполненияКоманды.Окно);
	//	
	
	ПараметрыФормы = Новый Структура("Отбор, КлючНазначенияИспользования, СформироватьПриОткрытии", 
	 							Новый Структура("Номенклатура", 
											ПараметрКоманды),,
								Истина);
								
	ОткрытьФорму("Отчет.ВедомостьОдногоТовара.ФормаОбъекта", ПараметрыФормы,					
					ПараметрыВыполненияКоманды.Источник,
					ПараметрыВыполненияКоманды.Уникальность,
					ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
