
&НаКлиенте
Процедура ДобавитьКартинку(Команда)
	
	НачатьПомещениеФайла(Новый ОписаниеОповещения("ПослеВыбораКартинки", ЭтотОбъект),,,Истина,УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКартинки(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	Если Результат Тогда
		СсылкаНаКартинку = Адрес;
		НоваяСтрока = Объект.КартинкиТочек.Добавить();
		НоваяСтрока.СсылкаНаКартинку = Адрес;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//Обработчик механизма "Контактная информация"
	УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект.Ссылка, Отказ);
	Ид = -1;     НоваяСтрока = Неопределено;
	ТекущийОбъект.КартинкиТочек.Очистить();
	Для Каждого Строка Из Объект.КартинкиТочек Цикл // Ид = Ид+1;
		Если ЭтоАдресВременногоХранилища(Строка.СсылкаНаКартинку) Тогда
			//ТекущийОбъект.КартинкиТочек[Ид].ДанныеКартинки = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Строка.СсылкаНаКартинку));
			  НоваяСтрока = ТекущийОбъект.КартинкиТочек.Добавить();
			  ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
			  НоваяСтрока.ДанныеКартинки = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Строка.СсылкаНаКартинку));
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Ид = -1;
	объект.КартинкиТочек.Очистить();
	Запрос = Новый ЗАпрос("ВЫБРАТЬ НомерСтроки, ДанныеКартинки, ФотоСнаружи, ФотоВнутри ИЗ Справочник.ТочкиПродаж.КартинкиТочек ГДЕ Ссылка = &Ссылка Упорядочить по НомерСтроки");
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НовСтрока = Объект.КартинкиТочек.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, Выборка);
		НовСтрока.СсылкаНаКартинку = ПоместитьВоВременноеХранилище(Выборка.ДанныеКартинки.Получить(), УникальныйИдентификатор);
	КонецЦикла;
	// не работает из-за глюка платформы	
	//Для Каждого Строка Из Объект.КартинкиТочек Цикл Ид = Ид+1;
		//Инд =  Объект.КартинкиТочек.Индекс(Строка);
		//Строка.СсылкаНаКартинку = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "КартинкиТочек.ДанныеКартинки", Инд);
	//КонецЦикла;
	
	
	// Обработчик механизма "Контактная информация"
	УправлениеКонтактнойИнформацией.ПриСозданииНаСервере(ЭтаФорма, Объект.Ссылка);
	
	ЭлементОтбора = КонтактныеЛица.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));

	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Владелец");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование = Истина;
	ЭлементОтбора.ПравоеЗначение = Объект.Ссылка;
	
КонецПроцедуры

&НаКлиенте
Процедура КартинкиПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.КартинкиТочек.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		СсылкаНаКартинку = ТекДанные.СсылкаНаКартинку;
	КонецЕсли;
КонецПроцедуры
////////////////////////////////////////////////////////////////////////////////
// КОНТАКТНАЯ ИНФОРМАЦИЯ

&НаКлиенте
Процедура КонтактнаяИнформацияПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	УправлениеКонтактнойИнформациейКлиент.ПредставлениеНачалоВыбора(ЭтаФорма, Объект.Ссылка, Модифицированность, СтандартнаяОбработка);
	           
КонецПроцедуры
&НаКлиенте

Процедура КонтактнаяИнформацияПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	       
	УправлениеКонтактнойИнформациейКлиент.ПриНачалеРедактирования(ЭтаФорма, Объект.Ссылка, НоваяСтрока, Копирование);
	
КонецПроцедуры

&НаСервере
Функция ЗаписатьЭтотОбъект()
	
	Попытка
		Записать();
	Исключение
		Сообщить("Ошибка сохранения данных: " + ОписаниеОшибки());
		Возврат Ложь;
	КонецПопытки;

	Возврат Истина;
	
КонецФункции
&НаКлиенте
Процедура КонтактнаяИнформацияПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Объект.Ссылка.Пустая() Тогда
	Отказ = Истина;
	Ответ = Вопрос("Данные еще не записаны" + Символы.ПС + 
					"Переход к заполнению Контактной Информации возможен только после записи данных" + Символы.ПС +
					"Данные будут записаны", РежимДиалогаВопрос.ОКОтмена, 0);
	Если Ответ = КодВозвратаДиалога.Отмена Тогда
	    Возврат;
	КонецЕсли;
	
	ЗаписатьЭтотОбъект();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтактнаяИнформацияПередУдалением(Элемент, Отказ)
	УправлениеКонтактнойИнформациейКлиент.ПередУдалением(ЭтаФорма, Объект.Ссылка, Отказ);
КонецПроцедуры

&НаКлиенте
Процедура ТекстКонтактнойИнформацииНажатие(Элемент)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ПоказатьПредупреждение(,"Необходимо сохранить данные");
		
	Иначе
	
		//Вставить содержимое обработчика.                                                                     
		//ОткрытьФорму("Обработка.КонтактнаяИнформация.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
		ОткрытьФорму("Обработка.КонтактнаяИнформация.Форма.ФормаГлавная", Новый Структура("Контакт, ЗакрыватьПриЗакрытииВладельца", Объект.Ссылка, Истина), ЭтаФорма, УникальныйИдентификатор); КонецЕсли;
	

КонецПроцедуры

