
Функция ИницилизироватьCOMConnectorБухгалтерии(ПараметрыПодключения = Неопределено, стрОшибки = "") Экспорт
	
	Перем База;
	
	Если ПараметрыПодключения = Неопределено Тогда
		
		ПараметрыПодключения = ИнтеграцияСБухгалтерией.ПолучитьПараметрыПодключенияКБухгалтерииПоУмолчанию();
		
		Если ПустаяСтрока(ПараметрыПодключения) Тогда
			стрОшибки = "не заданы параметры подключения к базе УТ 81.
								|Для задания параметров установите константу - ""Параметры подключения к УТ 81"" ";
			Возврат Неопределено; КонецЕсли; КонецЕсли;

	Connector = глCOMСоединения[ПараметрыПодключения];
	Если Connector = Неопределено Тогда
		
		Попытка База = Новый COMОбъект("V83.COMConnector");
		Исключение
		 	стрОшибки = "Не установлено 1С:Предприятие 8.3. 
						|Не могу инициализировать СОМ соединение для выполнения сервисных функций.";
			Возврат Неопределено; КонецПопытки;
	
		Попытка
			Connector 	= База.Connect(ПараметрыПодключения);
			Имя 		= Connector.Метаданные().Имя;
		Исключение
			стрОшибки = ОписаниеОшибки();
			стрОшибки = "Ошибка при подключении к базе 83
						|" + стрОшибки;
			База = Неопределено;
			Возврат Неопределено; КонецПопытки; 
		
		глCOMСоединения.Вставить(ПараметрыПодключения, Connector); КонецЕсли;
	
	Возврат Connector;
	
КонецФункции