
&НаСервере
Функция ПолучитьСсылкиНаКартинки()
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ Ссылка ИЗ Справочник.Картинки ГДЕ НЕ ЭтоГруппа
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ Ссылка ИЗ Справочник.КартинкиНоменклатуры
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ Ссылка ИЗ Справочник.КартинкиРемонта
	|");
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Процедура ЗаписатьСправочник(Ссылка)
	
	Ссылка.ПолучитьОбъект().Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Ссылки 	= ПолучитьСсылкиНаКартинки();
	Кол 	= Ссылки.Количество();
	ном		= 0;
	
	Для Каждого Ссылка Из Ссылки Цикл ном = ном + 1;
		ОбработкаПрерыванияПользователя();
		Состояние("Сохранение картинок в облако", ном / Кол * 100, Строка(Ссылка));
		ЗаписатьСправочник(Ссылка); КонецЦикла;
	
	ПоказатьПредупреждение(,"Обработка завершена, сохранено картинок: " + кол,,"Сообщение!");
	
КонецПроцедуры
