 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Пользователь = ПараметрыСеанса.ТекущийПользователь; 
	
	НеПоказыватьТочки = Новый Массив;
	НеПоказыватьТочки.Добавить(БизнесПроцессы.ИнтернетЗаявка.ТочкиМаршрута.СборкаЗаказа);
	НеПоказыватьТочки.Добавить(БизнесПроцессы.ИнтернетЗаявка.ТочкиМаршрута.ОжиданиеОплаты);
	НеПоказыватьТочки.Добавить(БизнесПроцессы.ИнтернетЗаявка.ТочкиМаршрута.ОжиданиеОтвета);
	НеПоказыватьТочки.Добавить(БизнесПроцессы.ЗаявкаПокупателя.ТочкиМаршрута.СборкаЗаказа);
	НеПоказыватьТочки.Добавить(БизнесПроцессы.ЗаявкаПокупателя.ТочкиМаршрута.ПеремещениеТоваров);
	//НеПоказыватьТочки.Добавить(БизнесПроцессы.СборкаЗаказа.ТочкиМаршрута.Переместить);
	//НеПоказыватьТочки.Добавить(БизнесПроцессы.СборкаЗаказа.ТочкиМаршрута.ПереместитьКогдаСобран);
	
	СписокВыполненных.Параметры.УстановитьЗначениеПараметра("СборкаИнтернетЗаказа", 		БизнесПроцессы.ИнтернетЗаявка.ТочкиМаршрута.СборкаЗаказа);
	СписокВыполненных.Параметры.УстановитьЗначениеПараметра("СборкаЗаказаПокупателя", 		БизнесПроцессы.ЗаявкаПокупателя.ТочкиМаршрута.СборкаЗаказа);
	СписокВыполненных.Параметры.УстановитьЗначениеПараметра("Перемещение1", 				БизнесПроцессы.ЗаявкаПокупателя.ТочкиМаршрута.ПеремещениеТоваров);
	//СписокВыполненных.Параметры.УстановитьЗначениеПараметра("Перемещение2", 				БизнесПроцессы.СборкаЗаказа.ТочкиМаршрута.Переместить);
	
	
	СписокВыполненных.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	СписокВыполненных.Параметры.УстановитьЗначениеПараметра("СборкаЗаказа", 	БизнесПроцессы.ИнтернетЗаявка.ТочкиМаршрута.СборкаЗаказа);
	
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если 	ИмяСобытия = СобытияСистемы.Событие_ЗаписанаЗадача() Или
			ИмяСобытия = СобытияСистемы.Событие_ЗаписанБизнесПроцесс() Тогда
			
		Если Элементы.Найти("СписокВыполненных") <> Неопределено Тогда
			Элементы.СписокВыполненных.Обновить(); КонецЕсли;
		
		Если Элементы.Найти("СписокТекущих") <> Неопределено Тогда
			Элементы.СписокТекущих.Обновить(); КонецЕсли; КонецЕсли;

КонецПроцедуры
