&НаСервере
Функция ПолучитьРеквизитыДокумента(Ссылка)
	Возврат ФункцииФормДокументов.ПолучитьРеквизитыДокумента(Ссылка);
КонецФункции

&НаСервере
Процедура ЗаполнитьРеквизитыФормы(Ссылка)
	
	РеквизитыВладельца = ПолучитьРеквизитыДокумента(Ссылка);
	
	Для Каждого Имя Из РеквизитыВладельца Цикл
		Если Элементы.Найти(Имя) <> Неопределено Тогда
			ЭтаФорма[Имя] = Ссылка[Имя];
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
		
	  
КонецПроцедуры


&НаСервере
Процедура ОбновитьМакет()
	
	Обработки.ПечатьОбщихФорм.Печать_СчетФактура(Макет, Основание, Номер, Дата);	
	
	Макет.ВерхнийКолонтитул.Выводить          = Истина;
	Макет.ВерхнийКолонтитул.НачальнаяСтраница = 2;
	Макет.ВерхнийКолонтитул.ВертикальноеПоложение = ВертикальноеПоложение.Низ;
	Макет.ВерхнийКолонтитул.ТекстСлева   = ФормированиеПечатныхФорм.СформироватьЗаголовокДокумента(Основание, "Счет-фактура",, Истина);
	Макет.ВерхнийКолонтитул.ТекстСправа  = "Лист [&НомерСтраницы]";
	Макет.ДвусторонняяПечать = ТипДвустороннейПечати.ПереворотВверх;
	
КонецПроцедуры
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Основание = Параметры.Основание;
	Элементы.ФормаПечать.Доступность = Ложь;

	ЗаполнитьРеквизитыФормы(Основание);

	Запрос = Новый Запрос("ВЫБРАТЬ * ИЗ РегистрСведений.СчетФактуры ГДЕ Основание = &Основание");
	Запрос.УстановитьПараметр("Основание", Основание);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		ЗаполнитьЗначенияСвойств(ЭтаФорма, Выборка, , "Основание");
		Элементы.ФормаПечать.Доступность = Истина;
	КонецЕсли;
		
    ОбновитьМакет();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеПриИзменении(Элемент)
	
	ЗаполнитьРеквизитыФормы(Основание);
	ОбновитьМакет();
	
КонецПроцедуры

Функция ЗаписатьДокумент()
	
	Менеджер = РегистрыСведений.СчетФактуры;
	
	Запись = Менеджер.СоздатьМенеджерЗаписи();
	
	ЗаполнитьЗначенияСвойств(Запись, ЭтаФорма);
	
	Попытка
		Запись.Записать();
	Исключение
		Сообщить("Не удалось сохранить счет-фактуру: " + ОписаниеОшибки());
		Возврат Ложь;	
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	Если ЗаписатьДокумент() Тогда
		Оповестить("ЗаписьСФ", Новый Структура("Номер, Дата", Номер, Дата));
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	Если ЗаписатьДокумент() Тогда
		
		Элементы.ФормаПечать.Доступность = Истина;
		Оповестить("ЗаписьСФ", Новый Структура("Номер, Дата", Номер, Дата));
		
		ОбновитьМакет();
		
	КонецЕсли;
КонецПроцедуры
