
////////////////////////////////////////////////////////////////////////////////
// Клиентские процедуры общего назначения


// Установка заголовка приложения на основании текущего пользователя
// и заданной константы.
//
Процедура УстановитьПроизвольныйЗаголовокПриложения() Экспорт
	
	ТекущийЗаголовокПриложения = ПолучитьЗаголовокПриложения();

	ПредставлениеЗаголовка = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента().ЗаголовокПриложения;
	Если ПустаяСтрока(ПредставлениеЗаголовка) Тогда
		ПредставлениеЗаголовка = СокрЛП(ТекущийЗаголовокПриложения);
	КонецЕсли;
	
	ПредставлениеПользователя = СтандартныеПодсистемыКлиентПовтИсп.ПараметрыРаботыКлиента().ТекущийПользователь;
	Если НЕ ПустаяСтрока(СокрЛП(Строка(ПредставлениеПользователя))) Тогда
		ПредставлениеПользователя = " /" + ПредставлениеПользователя + "/";
	КонецЕсли;

	ЗаголовокПриложения = СокрЛП(ПредставлениеЗаголовка + ПредставлениеПользователя);
	УстановитьЗаголовокПриложения(ЗаголовокПриложения);
	
КонецПроцедуры
	
// Переводит время из зимнего к текущему с учетом NTFS коррекции
Процедура ПреобразоватьЗимнееВремяКТекущему(ДатаВремя) Экспорт
	ДатаВремя = МестноеВремя(ДатаВремя);
КонецПроцедуры

