
&НаСервере
Процедура РассчитатьНаСервере()
	
	МодульРегламентныхЗаданий.РассчитатьСреднийОстаток(Период.ДатаНачала, Период.ДатаОкончания); //КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать(Команда)
	РассчитатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура РассчитатьВСебестоимостиНаСервере()
	МодульРегламентныхЗаданий.РассчитатьСреднийОстатокВСебестоимости(Период.ДатаНачала, Период.ДатаОкончания); //КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьВСебестоимости(Команда)
	РассчитатьВСебестоимостиНаСервере();
КонецПроцедуры
