// Обработки
&НаКлиенте
Процедура ОткрытьОбработкуЗагрузкаАссортиментнойМатрицы(Команда)
	
	Форма = ПолучитьФорму("Обработка.ЗагрузкаАссортиментнойМатрицы.Форма.Форма");
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбработкуОчисткаДанныхОтШума(Команда)
	
	Форма = ПолучитьФорму("Обработка.ОчисткаДанныхОтШума.Форма.Форма");
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбработкуПрогнозПродаж(Команда)
	
	Форма = ПолучитьФорму("Обработка.ПрогнозПродаж.Форма.Форма");
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбработкуФормированиеЗаказаПоставщику(Команда)
	
	Форма = ПолучитьФорму("Обработка.ФормированиеЗаказаПоставщику.Форма.Форма");
	Форма.Открыть();
	
КонецПроцедуры

// Отчеты
&НаКлиенте
Процедура ОткрытьОтчетПоАссортиментнойМатрице(Команда)
	
	Форма = ПолучитьФорму("Отчет.ОтчетПоАссортиментнойМатрице.Форма.ФормаОтчета");
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетПоДаннымПродаж(Команда)
	
	Форма = ПолучитьФорму("Отчет.ОтчетПоДаннымПродаж.Форма.ФормаОтчета");
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетПоАкциям(Команда)
	
	Форма = ПолучитьФорму("Отчет.ОтчетПоАкциям.Форма.ФормаОтчета");
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетПоОборачиваемости(Команда)
	
	Форма = ПолучитьФорму("Отчет.ОтчетПоОборачиваемости.Форма.ФормаОтчета");
	Форма.Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетДниНаОстатке(Команда)
	
	Форма = ПолучитьФорму("Отчет.ДниНаОстатке.Форма.ФормаОтчета");
	Форма.Открыть();
	
КонецПроцедуры
