&НаКлиенте
Процедура ДополнительныеРеквизиты(Команда)
	
	ФункцииФормДокументов.ОткрытьОбщиеРеквизиты(ЭтаФорма);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеНаСервере()
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ Сотрудник, КоличествоНачальныйОстаток ОстатокНачальный, КоличествоПриход Начислено, КоличествоРасход Учтено, КоличествоКонечныйОстаток Расчет  ИЗ РегистрНакопления.ПризовыеОчки.ОстаткиИОбороты(&НачалоПериода, ДОБАВИТЬКДАТЕ(ДОБАВИТЬКДАТЕ(&НачалоПериода, МЕСЯЦ, 1), СЕКУНДА, -1))");// " +  ?(Объект.Отдел.Пустая(), "", "Отдел = &Отдел") + ?(Объект.Подразделение.Пустая(), "", ?(Объект.Отдел.Пустая(), "", " И " ) + "Подразеделение = &Подразеделение") + ")");
	
	Запрос.УстановитьПараметр("НачалоПериода", Объект.Месяц);
	Объект.Очки.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДанные(Команда)
	ЗаполнитьДанныеНаСервере();
КонецПроцедуры
