
&НаСервере
Функция ПереключитьНаСервере()
	
	ПараметрыСеанса.ТекущийЯзык = ?(ПараметрыСеанса.ТекущийЯзык = Перечисления.Языки.Русский, Перечисления.Языки.Немецкий, Перечисления.Языки.Русский);
	ПараметрыСеанса.ТекущийЯзыкСтр = ?(ПараметрыСеанса.ТекущийЯзык = Перечисления.Языки.Русский, "ru", "de");
	
	Возврат ПараметрыСеанса.ТекущийЯзыкСтр;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	глТекущийЯзыкСтр = ПереключитьНаСервере();
	
	ПоказатьОповещениеПользователя(
			НСтр("ru=""Смена языка""; de=""Sprache ändern"""),,
			НСтр("ru=""Установлен язык: " + ВРег(глТекущийЯзыкСтр) + """; de=""Sprache Satz: " + ВРег(глТекущийЯзыкСтр) + """"),
			БиблиотекаКартинок.ИнтернетМагазин);
			
	//ОбновитьИнтерфейс(); зависает ( список
	
КонецПроцедуры
