
Процедура ПриЗаписи(Отказ, Замещение)
	запрос = Новый Запрос;
	запрос.Текст = "
	|ВЫБРАТЬ Номен.Родитель КАК Родитель
	|ПОМЕСТИТЬ Родители
	|ИЗ Справочник.Номенклатура КАК Номен
	|ГДЕ Номен.Ссылка = &Ссылка
	|ОБЪЕДИНИТЬ ВСЕ
	|ВЫБРАТЬ НоменклатураДополнительныеРодители.Родитель
	|ИЗ Справочник.Номенклатура.ДополнительныеРодители КАК НоменклатураДополнительныеРодители
	|ГДЕ НоменклатураДополнительныеРодители.Ссылка = &Ссылка
	|;
	|ВЫБРАТЬ
	|	Родители.Родитель КАК Номенклатура
	|ИЗ
	|	Родители КАК Родители
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ТегиНоменклатуры КАК ТегиНоменклатуры
	|ПО 
	|	ТегиНоменклатуры.Номенклатура = Родители.Родитель
	|ГДЕ 
	|	ТегиНоменклатуры.Тег = &Тег
	|	И ТегиНоменклатуры.Номенклатура Есть NULL
	|";
	
	Для каждого лЗапись Из ЭтотОбъект Цикл
		Если лЗапись.Номенклатура.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		
		запрос.УстановитьПараметр("Ссылка", лЗапись.Номенклатура);
		запрос.УстановитьПараметр("Тег", лЗапись.Тег);
		выборка = запрос.Выполнить().Выбрать();
		Пока выборка.Следующий() Цикл
			новаяЗапись = РегистрыСведений.ТегиНоменклатуры.СоздатьМенеджерЗаписи();
			новаяЗапись.Номенклатура 	= выборка.Номенклатура;
			новаяЗапись.Тег				= лЗапись.Тег;
			новаяЗапись.Записать();
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры
