
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КомментарийHTML = Параметры.Комментарий;
КонецПроцедуры

&НаКлиенте
Процедура КомментарийHTMLДокументСформирован(Элемент)
	Если ЗначениеЗаполнено(КомментарийHTML) Тогда
		Элемент.Документ.body.scrollTop = 10000;
	КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если Элементы.КомментарийHTML.Документ <> Неопределено Тогда
		НекоеМножество = Элементы.КомментарийHTML.Документ.forms;
		Для Каждого стрКомментарий Из НекоеМножество Цикл 
			текКомментарий = СокрЛП(СтрЗаменить(стрКомментарий.innerText, "Ваш комментарий: ", "")); 
		КонецЦикла;
		
		ФункцииБизнесПроцессовКлиент.СохранитьКомментарий(ВладелецФормы, текКомментарий);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗапомнитьИЗакрыть(Команда)
	Закрыть();
КонецПроцедуры
