
&НаСервереБезКонтекста
Функция СписокВыборНаСервере(ЗадачаСсылка)
	Возврат	ЗадачаСсылка.ТочкаМаршрута.Имя;
КонецФункции

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Элемент.ТекущиеДанные.Задача) Тогда
		СтандартнаяОбработка = Ложь;
		ИмяЗадачи = СписокВыборНаСервере(Элемент.ТекущиеДанные.Задача);
		ОткрытьФорму("БизнесПроцесс.УтверждениеДоговора.Форма.Задача_" + ИмяЗадачи, Новый Структура("Ключ", Элемент.ТекущиеДанные.Задача));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СхемаБП(Команда)
	
	Схема = СхемаБПНаСервере();
	Заголовок = "Схема утверждения договора";
	Если Схема <> Неопределено Тогда
		ОткрытьФорму("ОбщаяФорма.СхемаБП", 
		Новый Структура("Схема, Заголовок", 
		Схема, Заголовок));
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СхемаБПНаСервере()
	
	Если Элементы.Список.ТекущаяСтрока <> Неопределено И ЗначениеЗаполнено(Элементы.Список.ТекущаяСтрока.Задача.БизнесПроцесс) Тогда
		Возврат Элементы.Список.ТекущаяСтрока.Задача.БизнесПроцесс.ПолучитьОбъект().ПолучитьКартуМаршрута();
	КонецЕсли;	
	Возврат Неопределено;
	
КонецФункции
