
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("ГруппаОтветственные", Параметры.Группа);
КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	СписокОбработкаЗаписиНовогоНаСервере(НовыйОбъект);
КонецПроцедуры

&НаСервере
Процедура СписокОбработкаЗаписиНовогоНаСервере(Ссылка)
	
	новОбъект = Ссылка.ПолучитьОбъект();
	новОбъект.Родитель = Справочники.ФизическиеЛица.НайтиПоНаименованию("Северсталь");
	
	Попытка
		новОбъект.Записать();
	Исключение
		Сообщить("Ошибка записи данных: 
		|" + ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры
