
&НаСервере
Функция ВыгрузитьНаСервере(Ссылки)
	
	Возврат обм_Обмен.Выгрузить(Ссылки, Справочники.обм_ОбменДанными.ПолучитьСсылку(Новый УникальныйИдентификатор("60590e19-c752-11e6-8111-002590d99cf6")));
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ВыгрузитьНаСервере(ПараметрКоманды) Тогда
		
		Если ПараметрКоманды.Количество() = 1 Тогда
				ПоказатьОповещениеПользователя("Данные выгруженны", ПолучитьНавигационнуюСсылку(ПараметрКоманды[0]), ПараметрКоманды[0], БиблиотекаКартинок.Бухгалтерия);
		Иначе	ПоказатьОповещениеПользователя("Данные выгруженны",,Строка(ПараметрКоманды.Количество()) + " шт.", БиблиотекаКартинок.Бухгалтерия); КонецЕсли; КонецЕсли;
	
КонецПроцедуры
