
Процедура ОбработатьНаСервере(ИмяФормы) Экспорт
	Запрос=Новый Запрос("ВЫБРАТЬ
	                    |	Ссылка
	                    |ИЗ
	                    |	Документ.ИнтернетЗаказПокупателя  ");
	Выборка=Запрос.Выполнить().Выбрать();
	
	//обязательная часть кода №1
	Всего = Выборка.Количество();
	Счетчик=0;
	ПредСчетчик=0;
	Состояние="Выполнение этапа №...";
	//
	
	Пока Выборка.Следующий() Цикл
		
		//обязательная часть кода №2
		Счетчик=Счетчик+1;
		РегистрыСведений.ПрогрессБар.УстановитьЗначение(ИмяФормы,Счетчик,ПредСчетчик,Всего,Состояние);
		ПредСчетчик=Счетчик;		
		//
		
	КонецЦикла	
КонецПроцедуры

