
&НаСервере
Функция ПолучитьСобытияSQLНаСервере()

	Табл = Parsec.ПолучитьСобытияСКартамиИФизиками(датаНачала);
	Если Табл = Неопределено Тогда
		Возврат Ложь;
		
	Иначе
		Объект.События.Загрузить(Табл);
		Возврат Истина; КонецЕсли;
	
КонецФункции
	
&НаКлиенте
Процедура ПолучитьСобытияИзSQL(Команда)
	
	ПолучитьСобытияSQLНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСобытияSQLНаСерверепРОЩЕ()

	Табл = Parsec.ПолучитьСобытия(датаНачала);
	Если Табл = Неопределено Тогда
		Возврат Ложь;
		
	Иначе
		Объект.События.Загрузить(Табл);
		Возврат Истина; КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПолучитьПроще(Команда)
	
	ПолучитьСобытияSQLНаСерверепРОЩЕ();
	
КонецПроцедуры
