
Процедура ПередЗаписью(Отказ, Замещение)
	
	//Для Каждого Зап Из ЭтотОбъект Цикл
	//	Если Не ЗначениеЗаполнено(Зап.Заказ) и Не Зап.Заказ = Неопределено Тогда
	//		Отказ=Истина;
	//		Сообщить("Поле Заказ в строке "+(Зап.НомерСтроки+1)+" содержит пустую ссылку. Выберете, пожалуйста, неопределенное значение (нажмите крестик)");
	//	КонецЕсли;	
	//	
	//	Если Не ЗначениеЗаполнено(Зап.ДокументОтгрузки) и Не Зап.ДокументОтгрузки = Неопределено Тогда
	//		Отказ=Истина;
	//		Сообщить("Поле Документ отгрузки в строке "+(Зап.НомерСтроки+1)+" содержит пустую ссылку. Выберете, пожалуйста, неопределенное значение (нажмите крестик)");
	//КонецЕсли	
	//
	//КонецЦикла;	
	
	
КонецПроцедуры
