Функция ПолучитьТаблицуТоваров()
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	НомерСтроки,
	|	Номенклатура КАК Товар,
	|	МинимальныйОстаток,
	|	Склад,
	|	Ссылка.Дата КАК Период
	|ИЗ
	|	Документ.УстановкаМинимальногоОстатка.Товары КАК Док
	|ГДЕ
	|	Док.Ссылка = &Ссылка");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ДвиженияПоРегистрам(СтруктураШапки, ТаблицаТоваров, РежимПроведения, Отказ, Заголовок)
	
	// ТОВАРЫ НА СКЛАДАХ
	
	Таблица = Движения.МинимальныеОстаткиНаСкладе.Выгрузить();
	Таблица.Очистить();
	
	Для Каждого СтрокаТоваров Из ТаблицаТоваров Цикл
		
		НовСтрока = Таблица.Добавить();
		НовСтрока.Регистратор = Ссылка;
		ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаТоваров);
		
		НовСтрока.Активность = Истина;
		
	КонецЦИкла;
	
	Движения.МинимальныеОстаткиНаСкладе.Загрузить(Таблица);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	//Заголовок = "Проведение документа " + Ссылка;
	//
	////СтруктураШапки	= ПолучитьСтруктуруШапки();
	//ТаблицаТоваров 	= ПолучитьТаблицуТоваров();
	//
	//Если НЕ Отказ Тогда
	//	ДвиженияПоРегистрам(Новый Структура, ТаблицаТоваров, РежимПроведения, Отказ, Заголовок);
	//КонецЕсли;

	Движения.МинимальныеОстаткиНаСкладе.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		
		Движение = Движения.МинимальныеОстаткиНаСкладе.Добавить();
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТовары.Номенклатура;
		Движение.Склад = ТекСтрокаТовары.Склад;
		Движение.МинимальныйОстаток 	= ТекСтрокаТовары.МинимальныйОстаток;
		Движение.РекомендуемыйОстаток 	= ТекСтрокаТовары.РекомендуемыйОстаток; КонецЦикла;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Ид = ПроверяемыеРеквизиты.Найти("Склад");
	Если Ид <> Неопределено Тогда
		ПроверяемыеРеквизиты.Удалить(Ид); КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СтрСклады = "";
	текСклады = Новый Соответствие;
	
	Для Каждого Строка Из Товары Цикл Если текСклады[Строка.Склад] = Неопределено Тогда текСклады.Вставить(Строка.Склад, Истина); СтрСклады = СтрСклады + ?(СтрСклады = "", "", ",") + Строка(строка.Склад); КонецЕсли; КонецЦикла;
	
КонецПроцедуры
