
Процедура СохранитьКомментарий(Форма, новКомментарий = "") Экспорт
	
	// Сохраним комментарий
	текКомментарий = Форма.Объект.Комментарий; 
	
	текОбъект = Форма.Объект.Ссылка;
	ДоступностьКомментариев = ?(ТипЗнч(текОбъект) = Тип("ЗадачаСсылка.ЗадачаПользователю"), НЕ ФункцииБизнесПроцессов.ЗадачаВыполнена(текОбъект) , Ложь);
		
	Если ТипЗнч(текОбъект) = Тип("БизнесПроцессСсылка.ЗаявкаПокупателя") Тогда
		ДоступностьКомментариев = (НЕ ФункцииБизнесПроцессов.Стартован(текОбъект) И НЕ ФункцииБизнесПроцессов.Завершен(текОбъект)) ИЛИ
														(ФункцииБизнесПроцессов.Стартован(текОбъект) И 
																	ФункцииБизнесПроцессов.СтоитНаТочкеМаршрута(
																			текОбъект, 
																			"ФормированиеЗаказа", "ЗаявкаПокупателя"
																	
																	));
	ИначеЕсли ТипЗнч(текОбъект) = Тип("БизнесПроцессСсылка.ИнтернетЗаявка") Тогда
		ДоступностьКомментариев = (НЕ ФункцииБизнесПроцессов.Стартован(текОбъект) И НЕ ФункцииБизнесПроцессов.Завершен(текОбъект)) ИЛИ
														(ФункцииБизнесПроцессов.Стартован(текОбъект) И 
																	НЕ ФункцииБизнесПроцессов.СтоитНаТочкеМаршрута(
																			текОбъект, 
																			"СборкаЗаказа", "ИнтернетЗаявка"
																							));
    ИначеЕсли ТипЗнч(текОбъект) = Тип("БизнесПроцессСсылка.РемонтИнструмента")Тогда 
		ДоступностьКомментариев = (НЕ ФункцииБизнесПроцессов.Стартован(текОбъект) И НЕ ФункцииБизнесПроцессов.Завершен(текОбъект)) ИЛИ
														(ФункцииБизнесПроцессов.Стартован(текОбъект) И 
																	ФункцииБизнесПроцессов.СтоитНаТочкеМаршрута(
																			текОбъект, 
																			"ОформитьЗаявку", "РемонтИнструмента" 
																							));
																	
	КонецЕсли;
	
	
	Если  ДоступностьКомментариев Тогда			
		
		текКомментарий =  новКомментарий;
			
		Если текКомментарий <> Форма.Объект.Комментарий Тогда
				
			Форма.Объект.Комментарий = текКомментарий;
			Форма.Модифицированность = Истина;
			Форма.ПоследнийКомментарий = текКомментарий;
			
			Если Форма.Объект.Свойство("Заказ") И ЗначениеЗаполнено(Форма.Объект.Заказ) Тогда ФункцииБизнесПроцессов.ЗаписатьКомментарийВРегистр(Форма.Объект.Заказ,текКомментарий); КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ОбновитьКомментарий(Форма)
	
	ТекстHTML = "";
	
	текОбъект = Форма.Объект.Ссылка;
	ДоступностьКомментариев = ?(ТипЗнч(текОбъект) = Тип("ЗадачаСсылка.ЗадачаПользователю"), НЕ ФункцииБизнесПроцессов.ЗадачаВыполнена(текОбъект), Ложь);
	
	// исключительно для формы заявки (менеджеры)
	Если ТипЗнч(текОбъект) = Тип("БизнесПроцессСсылка.ЗаявкаПокупателя")Тогда 
		ДоступностьКомментариев = (НЕ ФункцииБизнесПроцессов.Стартован(текОбъект) И НЕ ФункцииБизнесПроцессов.Завершен(текОбъект)) ИЛИ
														(ФункцииБизнесПроцессов.Стартован(текОбъект) И 
																	ФункцииБизнесПроцессов.СтоитНаТочкеМаршрута(
																			текОбъект, 
																			"ФормированиеЗаказа", "ЗаявкаПокупателя" 
																							));
	ИначеЕсли ТипЗнч(текОбъект) = Тип("БизнесПроцессСсылка.ИнтернетЗаявка") Тогда
		ДоступностьКомментариев = (НЕ ФункцииБизнесПроцессов.Стартован(текОбъект) И НЕ ФункцииБизнесПроцессов.Завершен(текОбъект)) ИЛИ
														(ФункцииБизнесПроцессов.Стартован(текОбъект) И 
																	НЕ ФункцииБизнесПроцессов.СтоитНаТочкеМаршрута(
																			текОбъект, 
																			"СборкаЗаказа", "ИнтернетЗаявка"
																							));
    ИначеЕсли ТипЗнч(текОбъект) = Тип("БизнесПроцессСсылка.РемонтИнструмента")Тогда 
		ДоступностьКомментариев = (НЕ ФункцииБизнесПроцессов.Стартован(текОбъект) И НЕ ФункцииБизнесПроцессов.Завершен(текОбъект)) ИЛИ
														(ФункцииБизнесПроцессов.Стартован(текОбъект) И 
																	ФункцииБизнесПроцессов.СтоитНаТочкеМаршрута(
																			текОбъект, 
																			"ОформитьЗаявку", "РемонтИнструмента" 
																							));

	//	Задача = ФункцииБизнесПроцессов.ТекущаяЗадача(текОбъект);
	КонецЕсли;
		
	Если  ДоступностьКомментариев Тогда
        ТекстHTML = ФункцииБизнесПроцессов.ПолучитьТекстОтобранныхКомментариевHTMLСФормойВвода(Форма.МассивКомментариев, Форма.Объект.Комментарий);
	Иначе
		ТекстHTML = ФункцииБизнесПроцессов.ПолучитьТекстОтобранныхКомментариевHTMLБезФормыВвода(Форма.МассивКомментариев, Форма.Объект.Комментарий);
	КонецЕсли;

	Возврат ТекстHTML;
	
КонецФункции

Процедура КомандаПоказатьКомментарий(Форма) Экспорт
		
	ТекстHTML = ОбновитьКомментарий(Форма);
	ОткрытьФорму("ОбщаяФорма.Комментарий", Новый Структура("Комментарий", ТекстHTML), Форма);
	
КонецПроцедуры

Процедура ПолучитьМассивКомментариев(Форма, Ссылка) Экспорт
	
	// получаем массив комментариев Бизнес-процесса и устанавливаем значение последнего
	
	Форма.МассивКомментариев = ФункцииБизнесПроцессов.ПолучитьМассивКомментариев(Ссылка);
	Форма.ПоследнийКомментарий = Форма.Объект.Комментарий;
	
	Если Форма.МассивКомментариев.Количество() И ПустаяСтрока(Форма.ПоследнийКомментарий) Тогда
		Форма.ПоследнийКомментарий = Форма.МассивКомментариев[Форма.МассивКомментариев.Количество()-1].Комментарий;
	КонецЕсли;
	
	Форма.ПоследнийКомментарий = СтрЗаменить(Форма.ПоследнийКомментарий, Символы.ПС, Символы.НПП);
	
КонецПроцедуры

                                