
Функция УстановитьГалки(Ссылки, Первичный = Неопределено, КорректировкаПервичного = Неопределено, Примечание = Неопределено) Экспорт
	
	НачатьТранзакцию();
	
	Для Каждого Ссылка Из Ссылки Цикл
		
		Записывать = Ложь;
		
		Запись = СоздатьМенеджерЗаписи();
		Запись.Документ = Ссылка;
		Запись.Прочитать();
		
		Запись.Документ = Ссылка;
		Запись.Ответственный = ПараметрыСеанса.ТекущийПользователь;
		
		Если Первичный <> Неопределено Тогда 				Запись.ПервичныйДокумент = Первичный; Записывать = Истина; КонецЕсли;
		Если КорректировкаПервичного <> Неопределено Тогда 	Запись.ПервичныйПослеКорректировки = КорректировкаПервичного; Записывать = Истина; КонецЕсли;
		Если КорректировкаПервичного = Истина Тогда			Запись.БылаКорректировка = Ложь; Записывать = Истина; КонецЕсли;
		Если Примечание <> Неопределено Тогда				Запись.Примечание = Примечание; Записывать = Истина; КонецЕсли;
		
		Если Записывать И Не ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(Запись) Тогда
			ОтменитьТранзакцию();
			Возврат Ложь; КонецЕсли; КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
	Возврат Истина;
	
КонецФункции