Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос(
	         
	КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() + "
	|;
	|ВЫБРАТЬ
	|	Автор, Ответственный, ДатаНачала, ДатаОкончания, Сценарий
	|ИЗ
	|	Документ.Бюджет
	|ГДЕ
	|	Ссылка = &Ссылка
	|;
	|ВЫБРАТЬ
	|	Ссылка.Отдел Отдел,
	|Ссылка.Сценарий Сценарий, 
	|Ссылка.МодельБюджета МодельБюджета,
	|СтатьяБюджета,
	|СтатьяБюджета.Коэффициент Коэф,
	|Аналитика1,  Аналитика2, Аналитика3, 
	|   Сумма(Значение1),Сумма(Значение2),Сумма(Значение3),Сумма(Значение4),Сумма(Значение5),Сумма(Значение6),Сумма(Значение7),Сумма(Значение8),Сумма(Значение9),Сумма(Значение10),Сумма(Значение11),Сумма(Значение12),
	|   ДатаВремя(1,1,1) Период,0 Сумма,0 СуммаФакт
	|ИЗ 
	|	Документ.Бюджет.Показатели 
	|ГДЕ 
	|	Ссылка = &Ссылка
	|СГРУППИРОВАТЬ
	|По Ссылка.Отдел ,Ссылка.Сценарий , Ссылка.МодельБюджета , СтатьяБюджета, Аналитика1,  Аналитика2, Аналитика3, ДатаВремя(1,1,1)
	|");
	

	//Запрос.УстановитьПараметр("Область", 		ПараметрыСеанса.ТекущаяОбласть);
	Запрос.УстановитьПараметр("Ссылка", 		Ссылка);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ДополнительныеСвойства.Вставить("ПараметрыСистемы", 		КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[0].Выгрузить()));
	
	Шапка=КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[1].Выгрузить());
	ДополнительныеСвойства.Вставить("Шапка", Шапка);
	
	ТЧ=Пакет[2].Выгрузить();
	Периоды=ПолучитьПериоды(Шапка.ДатаНачала,Шапка.ДатаОкончания,Шапка.Сценарий);
	
	Бюджетирование=ТЧ.СкопироватьКолонки();
	Для Н=1 По Периоды.Количество() Цикл
		ТекПериод = Периоды[Н-1];
		Для Каждого Стр Из ТЧ Цикл
			НовСтр=Бюджетирование.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр,Стр);
			Новстр.Период=ТекПериод;
			НовСтр.Сумма=Стр["Значение"+Н]* ?(Стр.Коэф=0,1,Стр.Коэф);
		КонецЦикла;
	КонецЦикла;	
	
	ДополнительныеСвойства.Вставить("Бюджетирование", Бюджетирование);
	
КонецПроцедуры

Функция ПолучитьПериоды(ДатаНачала,ДатаОкончания,Сценарий) Экспорт
	
	МассивПериодов=Новый Массив;
	
	Если ЗначениеЗаполнено(ДатаНачала) и ЗначениеЗаполнено(ДатаОкончания) и ЗначениеЗаполнено(Сценарий) Тогда
		
		ПериодичностьСтр=Строка(Сценарий.Периодичность);
		
		Запрос=Новый Запрос;
		Запрос.Текст=
		"Выбрать Выразить(&ДатаНач КАК Дата)  ТекПериод
		|объединить все
		|выбрать НачалоПериода(&ДатаКон,"+ПериодичностьСтр+")
		|Упорядочить по ТекПериод
		|Итоги  по ТекПериод Периодами("+ПериодичностьСтр+",&ДатаНач,&ДатаКон)"
		;
		Запрос.УстановитьПараметр("ДатаНач",ДатаНачала);
		Запрос.УстановитьПараметр("ДатаКон",ДатаОкончания);
		
		Рез=Запрос.Выполнить();
		Выборка=Рез.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"ТекПериод", "Все");
		Пока Выборка.Следующий() Цикл
			МассивПериодов.Добавить(Выборка.ТекПериод);
		КонецЦикла;	
		
	КонецЕсли;
	
	Возврат МассивПериодов;
	
КонецФункции	

	
