
Функция ПронумероватьПсоледующиеДокументы(Знач текНомер, Знач текДата)
	
	Запрос = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Документ.Новость ГДЕ Проведен И Дата > &Дата УПОРЯДОЧИТЬ ПО Дата");
	Запрос.УстановитьПараметр("Дата", текДата);
	
	Выборка = Запрос.Выполнить().Выбрать();
		
	Пока Выборка.Следующий() Цикл
			
		Док = Выборка.Ссылка.ПолучитьОбъект();
		Док.ПорядковыйНомер = текНомер;
		Если Не ОбщиеФункции.ЗаписатьОбъектИСообщитьЕслиОшибка(Док) Тогда
			Возврат Ложь; КонецЕсли; 
		
		текНомер = текНомер + 1;КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Установим следующий порядковый номер
	
	Если 	РежимЗаписи = РежимЗаписиДокумента.Проведение И
			Не ПорядковыйНомер И
			Дата <> '00010101' Тогда
			
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 ПорядковыйНомер ИЗ Документ.Новость ГДЕ Проведен И ПорядковыйНомер <> 0 И Дата < &Дата УПОРЯДОЧИТЬ ПО ПорядковыйНомер УБЫВ");
		Запрос.УстановитьПараметр("Дата", ?(Дата = '00010101', ТекущаяДата(), Дата));
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ПорядковыйНомер = Выборка.ПорядковыйНомер + 1;
		Иначе
			ПорядковыйНомер = 1; КонецЕсли; 
		
		Если Не ПронумероватьПсоледующиеДокументы(ПорядковыйНомер + 1, Дата) Тогда
			Отказ = Истина; КонецЕсли;
		
	// Установим другие порядковые номера для предыдущих документов если отменяют проведение
	
	ИначеЕсли 	РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения И
				ПорядковыйНомер Тогда
				
		Если ПронумероватьПсоледующиеДокументы(ПорядковыйНомер, Дата) Тогда
			ПорядковыйНомер = 0;
		Иначе
			Отказ = Истина; КонецЕсли; КонецЕсли;
	
КонецПроцедуры

