&НаКлиенте
Процедура ОбщиеРеквизиты(Команда)
	
	ФункцииФормДокументов.ОткрытьОбщиеРеквизиты(ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостью()
		
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Элементы.СуммаДокумента.Доступность = ?(РольДоступна("ПолныеПрава") ИЛИ РольДоступна("Бухгалтер")ИЛИ РольДоступна("ПолныеПраваВОбласти"),Истина, Ложь); 
		Элементы.ВидОперации.Доступность = ?(РольДоступна("ПолныеПрава") ИЛИ РольДоступна("Бухгалтер")ИЛИ РольДоступна("ПолныеПраваВОбласти"),Истина, Ложь); 
		Элементы.Контрагент.Доступность = ?(РольДоступна("ПолныеПрава") ИЛИ РольДоступна("Бухгалтер") ИЛИ РольДоступна("ПолныеПраваВОбласти"),Истина, Ложь); 
		Элементы.Организация.Доступность = ?(РольДоступна("ПолныеПрава") ИЛИ РольДоступна("Бухгалтер")ИЛИ РольДоступна("ПолныеПраваВОбласти"),Истина, Ложь); 
		Элементы.ОператорПлатежнойСистемы.Доступность = ?(РольДоступна("ПолныеПрава") ИЛИ РольДоступна("Бухгалтер")ИЛИ РольДоступна("ПолныеПраваВОбласти"),Истина, Ложь); 
		Элементы.СуммаКомиссии.Доступность = ?(РольДоступна("ПолныеПрава") ИЛИ РольДоступна("Бухгалтер")ИЛИ РольДоступна("ПолныеПраваВОбласти"),Истина, Ложь); 
		Элементы.ФормаДополнительныеРеквизиты.Доступность = ?(РольДоступна("ПолныеПрава") ИЛИ РольДоступна("Бухгалтер")ИЛИ РольДоступна("ПолныеПраваВОбласти"),Истина, Ложь);
		Элементы.ИнтернетЗаказПокупателя.Доступность = ?(РольДоступна("ПолныеПрава") ИЛИ РольДоступна("Бухгалтер")ИЛИ РольДоступна("ПолныеПраваВОбласти"),Истина, Ложь);
	КонецЕсли;
		
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеВидимостью();
	
КонецПроцедуры


&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЗапретРедактирования.УстановитьРежимТолькоПросмотрПоДатеЗапрета(ЭтаФорма);

КонецПроцедуры
