&НаКлиенте
Перем Обновить;

&НаКлиенте
Процедура ЭлементПриИзменении_уд(Элемент)
	
	Имя 		= Элемент.Имя;
	Значение 	= ЭтаФорма[Имя];
	
	ВладелецФормы[Имя] = Значение;
	Обновить = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если Модифицированность Тогда
		Ответ = Вопрос("Сохранить изменения?", РежимДиалогаВопрос.ДаНетОтмена);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			
			СохранитьИзменения();
			Отказ = Истина;
			СтандартнаяОбработка = Ложь;
			Закрыть(Истина);
			
		ИначеЕсли Ответ = КодВозвратаДиалога.Отмена Тогда
			Отказ = Истина;
		Иначе
			Закрыть();
		КонецЕсли;
		
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СкладыПриОкончанииРедактирования_уд(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ВладелецФормы.Склады.ЗагрузитьЗначения(Склады.ВыгрузитьЗначения());
	Обновить = Истина;
	
КонецПроцедуры
&НаКлиенте
Процедура СкладыПослеУдаления_уд(Элемент)
	
	ВладелецФормы.Склады.ЗагрузитьЗначения(Склады.ВыгрузитьЗначения());
	Обновить = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтаФорма, Параметры, "ТипЦен, Валюта, ЦенаВключаетНДС, Склады, ЗапрашиватьКоличество, ЗапрашиватьЦену");
	
	// Заполним склады
	
	ВсеСклады = Не Параметры.Склады.Количество();
	новСклады = Новый СписокЗначений;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ Ссылка ИЗ Справочник.Склады ГДЕ НЕ ВАрхив И Не ПометкаУдаления УПОРЯДОЧИТЬ ПО Наименование");
	Выборка = Запрос.Выполнить().Выбрать();
	ПОка Выборка.Следующий() Цикл новСклады.Добавить(Выборка.Ссылка,,ВсеСклады Или Параметры.Склады.НайтиПоЗначению(Выборка.Ссылка) <> Неопределено); КонецЦикла;
	
	Склады = новСклады;
	
КонецПроцедуры

&НаКлиенте
Процедура Применить(Команда)
	СохранитьИзменения();
	Закрыть(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИзменения()
	
	ЗаполнитьЗначенияСвойств(ВладелецФормы, ЭтаФорма, "ТипЦен, Валюта, ЦенаВключаетНДС, ЗапрашиватьКоличество, ЗапрашиватьЦену");
	
	// Заполним склады
	ВладелецФормы.Склады = ?(ВсеСклады, Новый СписокЗначений, КонвертацияТипов.ПолучитьОтмеченныеЗначенияСпискаСписком(Склады));
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьИзмененияПоВсемСкладам()
	
	Для Каждого Элемент Из Склады Цикл Элемент.Пометка = ВсеСклады КонецЦикла;
	
КонецПроцедуры
&НаКлиенте
Процедура ВсеСкладыПриИзменении(Элемент)
	
	УстановитьИзмененияПоВсемСкладам();
	
КонецПроцедуры

&НаКлиенте
Процедура СкладыПометкаПриИзменении(Элемент)
	
	ВсеСклады = КонвертацияТипов.ПолучитьОтмеченныеЗначенияСписка(Склады).Количество() = Склады.Количество();
	
КонецПроцедуры
