
Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	//Если НЕ ПроведенияДокументов.РазрешеноПерепроводитьДокумент(Ссылка) Тогда
	//	Возврат;
	//КонецЕсли;	
			
			
	ИменаРегистров = Новый Массив;
	ПоВсем=Ложь;
	Если Не ДополнительныеСвойства.Свойство("ИменаРегистров",ИменаРегистров) Тогда
		ПоВсем=Истина;
		ИменаРегистров = Новый Массив;
	КонецЕсли;	
			
	
	ТекстЗапроса=КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() +Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		
	"ВЫБРАТЬ
	|	СкладОтправитель, СкладПолучатель
	|ИЗ
	|	Документ.ПриемТоваров
	|ГДЕ
	|	Ссылка = &Ссылка
	|";
	
	Нтаб=Новый Структура;
	ТекНомер=1;	
		
	Если ИменаРегистров.Найти("ТоварыНаСкладах")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ТоварыНаСкладах",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
	
	
		"//>>> ТоварыНаСкладах
		
		|ВЫБРАТЬ
		|	&Период						КАК Период,
		|	&ВидДвиженияПриход			КАК ВидДвижения,
		|	Выбор 
		|	когда Решение =  Значение(Перечисление.ДействияСПотеряннымВПутиТоваром.ВернутьНаСкладОтправитель)
		|		тогда СкладОтправитель
		|	когда Решение =  Значение(Перечисление.ДействияСПотеряннымВПутиТоваром.ОприходоватьНаСкладПолучатель)
		|		тогда СкладПолучатель 	
		|	Конец 						КАК Склад,
		|	Номенклатура	        	КАК Номенклатура,
		|	Количество					КАК Количество
		|ИЗ
		|	Документ.СписаниеПотерьВПути.Товары
		|ГДЕ
		|	Ссылка = &Ссылка
		|"
		
	КонецЕсли;
	

	
	Если ИменаРегистров.Найти("ПотериТоваровВПути")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ПотериТоваровВПути",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		"//>>> ПотериТоваровВПути
		
		|ВЫБРАТЬ
		|	&Период						КАК Период,
		|	&ВидДвиженияРасход			КАК ВидДвижения,
		|	Заказ 						,
		|	СкладОтправитель 			,
		|	СкладПолучатель 			,
		|	Номенклатура	           	,
		|	Количество 					
		|ИЗ
		|	Документ.СписаниеПотерьВПути.Товары
		|
		|ГДЕ
		|	Ссылка = &Ссылка
		|"
	КонецЕсли;	
	
	
	Запрос=Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("Период", 			Ссылка.Дата);
	Запрос.УстановитьПараметр("ВидДвиженияПриход", 	ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("ВидДвиженияРасход", 	ВидДвиженияНакопления.Расход);
	
	Запрос.Текст=ТекстЗапроса;
	Пакет = Запрос.ВыполнитьПакет();
	
	Для Каждого Элем Из Нтаб Цикл
		ДополнительныеСвойства.Вставить(Элем.Ключ,Пакет[Элем.Значение].Выгрузить());
	КонецЦикла;	
		
КонецПроцедуры
