
&НаСервере
Функция ПолучитьЗначениеРасшифровки(Расшифровка)
	
	ДанныеРасшифровкиОбъект = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	Поле = ДанныеРасшифровкиОбъект.Элементы[Расшифровка].ПолучитьПоля()[0];
	
	
	ЗначениеРасшифровки = ДанныеРасшифровкиОбъект.Элементы[Расшифровка].ПолучитьПоля()[0].Значение;
	
	Если Поле.Поле = "Картинки" И ЗначениеЗаполнено(ДанныеРасшифровкиОбъект.Элементы[Расшифровка].ПолучитьПоля()[1].Значение) Тогда
		
		Возврат Поле.Значение;
		
	КонецЕсли;
	
	//Возврат ТипЗнч(ЗначениеРасшифровки) = Тип("ЗадачаСсылка.ЗадачаИсполнителя");

	
КонецФункции

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Значение = ПолучитьЗначениеРасшифровки(Расшифровка);
	
	Если Значение <> Неопределено Тогда
		
		СтандартнаяОбработка = Ложь;
		
		Файл = Новый Файл(ПутьККартинкам + "\" + Значение);
		Если Не Файл.Существует() Тогда
			
			Если Вопрос("Не найден каталог с картинками " + Файл.ПолноеИмя + "
				|нужно выгрузить картинки из базы на локальный диск
				|Открыть обработку выгрузки картинок?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
				
				ОткрытьФорму("БизнесПроцесс.РемонтИнструмента.Форма.ВыгрузкаКартинокВКаталог");
			
			КонецЕсли;
		
			Возврат;
			
		КонецЕсли;
		
		ЗапуститьПриложение(Файл.ПолноеИмя);
		
	КонецЕсли;
	
	//Обр = Новый ОбработкаРасшифровкиКомпоновкиДанных
	           
   //   СтандартнаяОбработка = Ложь;
   ////
   //   ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиданных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(Схемакомпа));
   //	
   //   ВыполненноеДействие= Неопределено;
   //   МассивДоступныхДействий= Новый Массив;
   //   МассивДоступныхДействий.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
   //   МассивДоступныхДействий.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать);
   //	
   //   СписокДопМеню= Новый СписокЗначений;
   //   СписокДопМеню.Добавить("Открыть Хрень");
   //	
   //   НастройкиРасшифровки= ОбработкаРасшифровки.Выполнить(Расшифровка, ВыполненноеДействие, МассивДоступныхДействий, СписокДопМеню);
   //	
   //   ПоляГруппировок= КомпоновщикНастроек.Настройки.ДоступныеПоляГруппировок.Элементы;
   //   Для Каждого Поле Из ПоляГруппировок Цикл
    	  
      //  Если СокрЛП(Поле.Поле) = "ВременнойИнтервал" Тогда
      //  	  
      //  	  ОбработкаРасшифровки.Расшифровать(Новый ИдентификаторРасшифровкиКомпоновкиДанных(Расшифровка),Поле.Поле);
      //	КонецЕсли;
      //
      //  Если СокрЛП(Поле.Поле) = "ЭлементПланирования" Тогда
      //  	  
      //  	  РасшифровкаЭлементаПланирования= ОбработкаРасшифровки.Расшифровать(Расшифровка,Поле.Поле);
      //	КонецЕсли;
      
      //КонецЦикла;
    
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПутьККартинкам = ОбщиеФункции.НастройкаПользователя("ПутьККартинкам");
	
КонецПроцедуры
