Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос(
	
	КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() + ";
	
	// ДЕНЕЖНЫЕ СРЕДСТВА
	
	|ВЫБРАТЬ
	|	&Период				КАК Период,
	|	&ВидДвиженияПриход	КАК ВидДвижения,
	|	КассаСчет			КАК Касса,
	|	Сумма
	|ИЗ
	|	Документ.КорректировкаДС.Состав
	|ГДЕ
	|	Ссылка = &Ссылка
	|;
	
	// ОБОРОТЫ ДЕНЕЖНЫХ СРЕДСТВ	
	
	|ВЫБРАТЬ
	|	&Период		КАК Период,
	|	КассаСчет	КАК КассаСчет,
	|	Подразделение,
	|	Отдел,
	|	Отдел КАК ЦФУ,
	|	ФизЛицоПартнер,
	|	СтатьяДДС,
	|	Сумма		КАК Сумма,
	|	Сумма		КАК СуммаУпр   
	|ИЗ
	|	Документ.КорректировкаДС.Состав
	|ГДЕ
	|	Ссылка = &Ссылка
	|");
	
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("Период", 			Ссылка.Дата);
	Запрос.УстановитьПараметр("ВидДвиженияПриход", 	ВидДвиженияНакопления.Приход);
	
	Пакет = Запрос.ВыполнитьПакет();
	ПараметрыСистемы = КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[0].Выгрузить());
	
	ДополнительныеСвойства.Вставить("ПараметрыСистемы", 		ПараметрыСистемы);
	ДополнительныеСвойства.Вставить("ДенежныеСредства", 		Пакет[1].Выгрузить());
	ДополнительныеСвойства.Вставить("ОборотыДенежныхСредств", 	Пакет[2].Выгрузить());
	
КонецПроцедуры