
Функция ПолучитьКассуСписания() Экспорт
	
	ТЗ = Состав.Выгрузить(,"КассаСчет");
	ТЗ.Свернуть("КассаСчет");
	
	Возврат ТЗ.ВыгрузитьКолонку("КассаСчет");
	
КонецФункции

Процедура ОбработкаПроведения(Отказ, Режим)
   
	// Подготовка
	
	Заголовок = КонтрольПроведения.ПолучитьСтандарнтыйЗаголовокПриПроведенииДокумента(Ссылка);
	
	Документы[Метаданные().Имя].ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Проведение
	                                     
	ПроведенияДокументов.ПровестиПоВсемРегистрам(Метаданные().Движения, ДополнительныеСвойства, Движения, Отказ);
	
	// Запись
	
	Движения.Записать();
	
	// Контроль
	
	//КонтрольПроведения.ПроверитьПоВсемРегистрам(ЭтотОбъект, Отказ, Заголовок);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Сумма = Состав.Итог("Сумма");
	
КонецПроцедуры
