
&НаСервере
Функция ПолучитьГруппу()
	
	 Возврат Справочники.ФизическиеЛица.НайтиПоНаименованию("Северсталь");
	 
КонецФункции


&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("Группа", ПолучитьГруппу());
	ОткрытьФорму("Справочник.ФизическиеЛица.Форма.ФормаОтветственныхМВЗ", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
КонецПроцедуры
