
Процедура ПриЗаписи(Отказ, Замещение)
	
	Если Количество() Тогда
		
		// Проверим чтобы склад был таможенный
		
		Для Каждого Запись Из ЭтотОбъект Цикл Если Не Запись.Склад.Таможня Тогда ОбщиеФункции.СообщитьТекст(Строка(Запись.Склад) + " не таможенный!"); Отказ = Истина; Прервать; КонецЕсли; КонецЦикла;
		
		// Добавим для сайта
		
		Если 	Не Отказ И Константы.ИнтеграцияССайтом.Получить() И
				Не HTTP.ЗаписатьВсюНоменклатуруДляПередачиНаСайтИзНабора(ЭтотОбъект) Тогда
			Отказ = Истина КонецЕсли; КонецЕсли;
							
КонецПроцедуры
