Процедура ИнициализироватьДополнительныеДанныеДокумента_ст_ант(Ссылка, ДополнительныеСвойства) экспорт
	Запрос = Новый Запрос(
	КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() +  "
				   |;
				   |ВЫБРАТЬ
	               |	СнятиеРезерваЗаказы.ДокументЗаказ
	               |ПОМЕСТИТЬ ЗаказыДляСнятия
	               |ИЗ
	               |	Документ.СнятиеРезерва.Заказы КАК СнятиеРезерваЗаказы
	               |ГДЕ
	               |	СнятиеРезерваЗаказы.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
				   |	&ВидДвиженияРасход КАК ВидДвижения,
				   |	&Период КАК Период,
	               |	ТоварыВРезервеОстатки.Размещение КАК Размещение,
	               |	ТоварыВРезервеОстатки.ДокументРезерва КАК ДокументРезерва,
	               |	ТоварыВРезервеОстатки.Номенклатура КАК Номенклатура,
	               |	СУММА(ТоварыВРезервеОстатки.КоличествоОстаток) КАК Количество
	               |ИЗ
	               |	ЗаказыДляСнятия КАК ЗаказыДляСнятия
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезерве.Остатки КАК ТоварыВРезервеОстатки
	               |		ПО ЗаказыДляСнятия.ДокументЗаказ = ТоварыВРезервеОстатки.ДокументРезерва
				   |
	               |СГРУППИРОВАТЬ ПО
	               |	ТоварыВРезервеОстатки.ДокументРезерва,
	               |	ТоварыВРезервеОстатки.Размещение,
	               |	ТоварыВРезервеОстатки.Номенклатура
				   |");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидДвиженияРасход", ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("Период", Ссылка.Дата);
	Пакет = Запрос.ВыполнитьПакет();
	ДополнительныеСвойства.Вставить("ПараметрыСистемы", КонвертацияТипов.ПолучитьСтрокуИзТаблицыЗначений(Пакет[0].Выгрузить()));
	ДополнительныеСвойства.Вставить("ТоварыВРезерве", Пакет[2].Выгрузить());
	
КонецПроцедуры

Процедура ИницилизироватьДополнительныеДанныеДокумента_ст(Ссылка, ДополнительныеСвойства) экспорт
	      
	//Запрос = Новый Запрос(
	//КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() +  ";
	//
	//// ЗАКАЗЫ ДЛЯ ФИЛЬТРОВ
	//
	//|ВЫБРАТЬ	ДокументЗаказ
	//|ПОМЕСТИТЬ 	Заказы
	//|ИЗ			Документ.СнятиеРезерва.Заказы
	//|ГДЕ		Ссылка = &Ссылка
	//|;

	//// ТОВАРЫ В РЕЗЕРВЕ
	//
	//|ВЫБРАТЬ
	//
	//|	&ВидДвиженияРасход ВидДвижения, &Период Период,
	//|	Размещение, ДокументРезерва, Номенклатура,
	//|	КоличествоОстаток Количество
	//|ИЗ
	//|	РегистрНакопления.ТоварыВРезерве.Остатки(&Период, ДокументРезерва В(ВЫБРАТЬ ДокументЗаказ ИЗ Заказы))
	//|ГДЕ 
	//|	КоличествоОстаток > 0
	//|;
	//
	//// ЗАКАЗЫ ПОКУПАТЕЛЕЙ
	//
	//|ВЫБРАТЬ
	//|	&ВидДвиженияРасход ВидДвижения, &Период Период,
	//|	ЗаказПокупателя, Номенклатура, Цена, Упаковка, Размещение, ПроцентРучнойСкидки, ПроцентАвтоматическойСкидки, СтавкаНДС, Акция,
	//|	КоличествоОстаток Количество, СуммаОстаток Сумма
	//|ИЗ
	//|	РегистрНакопления.ЗаказыПокупателей.Остатки(&Период, ЗаказПокупателя В(ВЫБРАТЬ ДокументЗаказ ИЗ Заказы) И Размещение ССЫЛКА Справочник.Склады И Размещение <> &ПустойСклад)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	&ВидДвиженияПриход ВидДвижения, &Период Период,
	//|	ЗаказПокупателя, Номенклатура, Цена, Упаковка, &ПустойСклад Размещение, ПроцентРучнойСкидки, ПроцентАвтоматическойСкидки, СтавкаНДС, Акция,
	//|	КоличествоОстаток Количество, СуммаОстаток Сумма
	//|ИЗ
	//|	РегистрНакопления.ЗаказыПокупателей.Остатки(&Период, ЗаказПокупателя В(ВЫБРАТЬ ДокументЗаказ ИЗ Заказы) И Размещение ССЫЛКА Справочник.Склады И Размещение <> &ПустойСклад)
	//|;
	//
	//// ИНТЕРНЕТ ЗАКАЗЫ
	//
	//|ВЫБРАТЬ
	//|	&ВидДвиженияРасход ВидДвижения, &Период Период,
	//|	ИнтернетЗаказ, Номенклатура, Цена, Упаковка, Размещение, ПроцентРучнойСкидки, ПроцентАвтоматическойСкидки, СтавкаНДС, Акция,
	//|	КоличествоОстаток Количество, СуммаОстаток Сумма
	//|ИЗ
	//|	РегистрНакопления.ИнтернетЗаказПокупателя.Остатки(&Период, ИнтернетЗаказ В(ВЫБРАТЬ ДокументЗаказ ИЗ Заказы) И Размещение ССЫЛКА Справочник.Склады И Размещение <> &ПустойСклад)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	&ВидДвиженияПриход ВидДвижения, &Период Период,
	//|	ИнтернетЗаказ, Номенклатура, Цена, Упаковка, &ПустойСклад Размещение, ПроцентРучнойСкидки, ПроцентАвтоматическойСкидки, СтавкаНДС, Акция,
	//|	КоличествоОстаток Количество, СуммаОстаток Сумма
	//|ИЗ
	//|	РегистрНакопления.ИнтернетЗаказПокупателя.Остатки(&Период, ИнтернетЗаказ В(ВЫБРАТЬ ДокументЗаказ ИЗ Заказы) И Размещение ССЫЛКА Справочник.Склады И Размещение <> &ПустойСклад)
	//|;
	//
	//// ВНУТРЕННИЕ ЗАКАЗЫ
	//
	//|ВЫБРАТЬ
	//|	&ВидДвиженияРасход ВидДвижения, &Период Период,
	//|	Заказчик, ВнутреннийЗаказ, Номенклатура, Упаковка, Размещение,
	//|	КоличествоОстаток Количество
	//|ИЗ
	//|	РегистрНакопления.ВнутренниеЗаказы.Остатки(&Период, ВнутреннийЗаказ В(ВЫБРАТЬ ДокументЗаказ ИЗ Заказы) И Размещение ССЫЛКА Справочник.Склады И Размещение <> &ПустойСклад)
	//|
	//|ОБЪЕДИНИТЬ ВСЕ
	//|
	//|ВЫБРАТЬ
	//|	&ВидДвиженияПриход ВидДвижения, &Период Период,
	//|	Заказчик, ВнутреннийЗаказ, Номенклатура, Упаковка, &ПустойСклад Размещение,
	//|	КоличествоОстаток Количество
	//|ИЗ
	//|	РегистрНакопления.ВнутренниеЗаказы.Остатки(&Период, ВнутреннийЗаказ В(ВЫБРАТЬ ДокументЗаказ ИЗ Заказы) И Размещение ССЫЛКА Справочник.Склады И Размещение <> &ПустойСклад)
	//|;
	//|");
	//
	//Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	//Запрос.УстановитьПараметр("Период", 			Ссылка.Дата);
	////Запрос.УстановитьПараметр("ПериодНа1Назад", 	Ссылка.Дата - 1); // знаю, плохо
	//Запрос.УстановитьПараметр("ПустойСклад", 		Справочники.Склады.ПустаяСсылка());
	//Запрос.УстановитьПараметр("ВидДвиженияРасход", 	ВидДвиженияНакопления.Расход);
	//Запрос.УстановитьПараметр("ВидДвиженияПриход", 	ВидДвиженияНакопления.Приход);
	//
	//Пакет = Запрос.ВыполнитьПакет();
	//
	//ДополнительныеСвойства.Вставить("ПараметрыСистемы", 		КонвертацияТипов.ПолучитьСтрокуИзТаблицыЗначений(Пакет[0].Выгрузить()));
	//ДополнительныеСвойства.Вставить("ТоварыВРезерве", 			Пакет[2].Выгрузить());
	//ДополнительныеСвойства.Вставить("ЗаказыПокупателей", 		Пакет[3].Выгрузить());
	//ДополнительныеСвойства.Вставить("ИнтернетЗаказПокупателя", 	Пакет[4].Выгрузить());
	//ДополнительныеСвойства.Вставить("ВнутренниеЗаказы", 		Пакет[5].Выгрузить());
	
КонецПроцедуры

Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) экспорт
	      
	Запрос = Новый Запрос(
	КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() +  ";
	
	// ТОВАРЫ В РЕЗЕРВЕ
	
	|ВЫБРАТЬ
	|	&ВидДвиженияРасход ВидДвижения, &Период Период,
	|	Размещение, Заказ ДокументРезерва, Номенклатура,
	|	Количество
	|ИЗ
	|	Документ.СнятиеРезерва.Товары
	|ГДЕ 
	|	Ссылка = &Ссылка
	|;
	
	// ЗАКАЗЫ ПОКУПАТЕЛЕЙ
	
	|ВЫБРАТЬ
	|	&ВидДвиженияПриход ВидДвижения, &Период Период,
	|	Заказ ЗаказПокупателя, Номенклатура, Цена, Упаковка, Размещение, ПроцентРучнойСкидки, ПроцентАвтоматическойСкидки, СтавкаНДС, Акция,
	|	-Количество Количество, -Сумма Сумма
	|ИЗ
	|	Документ.СнятиеРезерва.Товары
	|ГДЕ 
	|	Ссылка = &Ссылка И Заказ ССЫЛКА Документ.ЗаказПокупателя И НЕ Заказ.СпособРазмещенияБезЗаказа
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ВидДвиженияПриход ВидДвижения, &Период Период,
	|	Заказ ЗаказПокупателя, Номенклатура, Цена, Упаковка, &ПустойСклад Размещение, ПроцентРучнойСкидки, ПроцентАвтоматическойСкидки, СтавкаНДС, Акция,
	|	Количество, Сумма
	|ИЗ
	|	Документ.СнятиеРезерва.Товары
	|ГДЕ 
	|	Ссылка = &Ссылка И Заказ ССЫЛКА Документ.ЗаказПокупателя И НЕ Заказ.СпособРазмещенияБезЗаказа
	|;
	
	// ИНТЕРНЕТ ЗАКАЗЫ
	
	|ВЫБРАТЬ
	|	&ВидДвиженияПриход ВидДвижения, &Период Период,
	|	Заказ ИнтернетЗаказ, Номенклатура, Цена, Упаковка, Размещение, ПроцентРучнойСкидки, ПроцентАвтоматическойСкидки, СтавкаНДС, Акция,
	|	-Количество Количество, -Сумма Сумма
	|ИЗ
	|	Документ.СнятиеРезерва.Товары
	|ГДЕ 
	|	Ссылка = &Ссылка И Заказ ССЫЛКА Документ.ИнтернетЗаказПокупателя И НЕ Заказ.СпособРазмещенияБезЗаказа
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ВидДвиженияПриход ВидДвижения, &Период Период,
	|	Заказ ИнтернетЗаказ, Номенклатура, Цена, Упаковка, &ПустойСклад Размещение, ПроцентРучнойСкидки, ПроцентАвтоматическойСкидки, СтавкаНДС, Акция,
	|	Количество, Сумма
	|ИЗ
	|	Документ.СнятиеРезерва.Товары
	|ГДЕ 
	|	Ссылка = &Ссылка И Заказ ССЫЛКА Документ.ИнтернетЗаказПокупателя И НЕ Заказ.СпособРазмещенияБезЗаказа
	|;
	
	// ВНУТРЕННИЕ ЗАКАЗЫ
	
	|ВЫБРАТЬ
	|	&ВидДвиженияПриход ВидДвижения, &Период Период,
	|	Заказчик, Заказ ВнутреннийЗаказ, Номенклатура, Упаковка, Размещение,
	|	-Количество Количество
	|ИЗ
	|	Документ.СнятиеРезерва.Товары
	|ГДЕ 
	|	Ссылка = &Ссылка И Заказ ССЫЛКА Документ.ВнутреннийЗаказ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	&ВидДвиженияПриход ВидДвижения, &Период Период,
	|	Заказчик, Заказ ВнутреннийЗаказ, Номенклатура, Упаковка, &ПустойСклад Размещение,
	|	Количество
	|ИЗ
	|	Документ.СнятиеРезерва.Товары
	|ГДЕ 
	|	Ссылка = &Ссылка И Заказ ССЫЛКА Документ.ВнутреннийЗаказ
	|;
	|");
	
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("Период", 			Ссылка.Дата);
	//Запрос.УстановитьПараметр("ПериодНа1Назад", 	Ссылка.Дата - 1); // знаю, плохо
	Запрос.УстановитьПараметр("ПустойСклад", 		Справочники.Склады.ПустаяСсылка());
	Запрос.УстановитьПараметр("ВидДвиженияРасход", 	ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("ВидДвиженияПриход", 	ВидДвиженияНакопления.Приход);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ДополнительныеСвойства.Вставить("ПараметрыСистемы", 		КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[0].Выгрузить()));
	ДополнительныеСвойства.Вставить("ТоварыВРезерве", 			Пакет[1].Выгрузить());
	ДополнительныеСвойства.Вставить("ЗаказыПокупателей", 		Пакет[2].Выгрузить());
	ДополнительныеСвойства.Вставить("ИнтернетЗаказПокупателя", 	Пакет[3].Выгрузить());
	ДополнительныеСвойства.Вставить("ВнутренниеЗаказы", 		Пакет[4].Выгрузить());
	
КонецПроцедуры