
Функция ПолучитьТекстЗапросаПолученияСпискаРезервируемыхТоваров() Экспорт Возврат ПолучитьТекстЗапросаПолученияСпискаТоваров() КонецФункции
Функция ПолучитьТекстЗапросаПолученияСпискаТоваров() Экспорт
	
	Возврат "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ Номенклатура
	|ИЗ	Документ.СнятиеРезерва.Товары
	|ГДЕ Ссылка = &ДокументСсылка
	|";
	
КонецФункции
Функция ПолучитьТекстЗапросаПолученияСпискаЗаказов() Экспорт
	
	Возврат "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ Заказ
	|ИЗ	Документ.СнятиеРезерва.Товары
	|ГДЕ Ссылка = &ДокументСсылка
	|";
	
КонецФункции



Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Подготовка
	
	Заголовок 		= КонтрольПроведения.ПолучитьСтандарнтыйЗаголовокПриПроведенииДокумента(Ссылка);
	МетаДвижения 	= Метаданные().Движения;
	
	// Соберем данные
	
	Документы[Метаданные().Имя].ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	ПроведенияДокументов.ПровестиПоВсемРегистрам(Метаданные().Движения, ДополнительныеСвойства, Движения, Отказ);
	
	// Запись
	
	Движения.Записать();
	
	// Контроль
	
	КонтрольПроведения.ПроверитьТоварыНаСкладах(ЭтотОбъект,, Отказ, Заголовок, Ссылка);
	КонтрольПроведения.ПроверитьТоварыВРезерве(ЭтотОбъект,, Отказ, Заголовок);
	КонтрольПроведения.ПроверитьВнутреннииЗаказы(ЭтотОбъект, Отказ, Заголовок);
	КонтрольПроведения.ПроверитьТоварыВИнтернетЗаказе(ЭтотОбъект, Отказ, Заголовок);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	// Подготовка

	Заголовок = КонтрольПроведения.ПолучитьСтандарнтыйЗаголовокПриОтменеПроведенияДокумента(Ссылка);
	
	// Запись
	
	ПроведенияДокументов.ОчиститьДвиженияДокумента(Метаданные().Движения, Движения);
	
	// Контроль
	
	КонтрольПроведения.ПроверитьТоварыНаСкладах(ЭтотОбъект,, Отказ, Заголовок, Ссылка);
	КонтрольПроведения.ПроверитьТоварыВРезерве(ЭтотОбъект,, Отказ, Заголовок);
	КонтрольПроведения.ПроверитьВнутреннииЗаказы(ЭтотОбъект, Отказ, Заголовок);
	КонтрольПроведения.ПроверитьТоварыВИнтернетЗаказе(ЭтотОбъект, Отказ, Заголовок);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТипЗнч = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипЗнч = Тип("Структура") Тогда
		
		КонвертацияТипов.ЗаполнитьОбъектПоСтруктуреОснованию(ЭтотОбъект, ДанныеЗаполнения); КонецЕсли;
	
КонецПроцедуры
