
&НаКлиенте
Процедура ПослеВыбораКартинки(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	Если Результат Тогда
		Логотип = Адрес;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	GUID = Объект.Ссылка.УникальныйИдентификатор();
	Логотип = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Логотип");
	
КонецПроцедуры



&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ЭтоАдресВременногоХранилища(Логотип) Тогда
		ТекущийОбъект.Логотип = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Логотип));
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ЛоготипНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	НачатьПомещениеФайла(Новый ОписаниеОповещения("ПослеВыбораКартинки", ЭтотОбъект),,,Истина,УникальныйИдентификатор);

КонецПроцедуры

