
Функция СформироватьНаименование(Объект) Экспорт
	Возврат Строка(Объект.Номинал) + "-" + Формат(Объект.ПорядковыйНомер,"ЧЦ=6; ЧВН=");
КонецФункции

Функция СуммаПоНоминалу(Номинал) Экспорт
	Если Номинал = Перечисления.ПодарочныеКарты_Номинал.н500 Тогда
		Возврат 500;
	ИначеЕсли Номинал = Перечисления.ПодарочныеКарты_Номинал.н1000 Тогда
		Возврат 1000;
	ИначеЕсли Номинал = Перечисления.ПодарочныеКарты_Номинал.н3000 Тогда
		Возврат 3000;
	ИначеЕсли Номинал = Перечисления.ПодарочныеКарты_Номинал.н5000 Тогда
		Возврат 5000;
	ИначеЕсли Номинал = Перечисления.ПодарочныеКарты_Номинал.н10000 Тогда
		Возврат 10000;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

