
&НаСервере
Функция ПоместитьТоварыВРегистрДляПодбора(Таблица, ВыгружаемыеПоля = "Номенклатура, Количество") Экспорт
	
	стрОшибки = "";
	Адрес = ВременнаяТаблица.ПоместитьНоменклатуру(Таблица.Выгрузить(,ВыгружаемыеПоля),,стрОшибки);
	
	Если Адрес = Неопределено Тогда
		ОбщиеФункции.СообщитьТекст(стрОшибки);
	КонецЕсли;
	
	Возврат Адрес;
	
КонецФункции

&НаКлиенте
Процедура Подбор(Форма, Таблица, Параметры = Неопределено) Экспорт
	
	АдресТоваровВРегистре = Форма.ПоместитьТоварыВХранилищеДляПодбора();
	
	Если АдресТоваровВРегистре <> Неопределено Тогда
		
		Если Параметры = Неопределено Тогда
			Параметры = Новый Структура;
		КонецЕсли;
		
		Параметры.Вставить("АдресТоваровВХранилище", АдресТоваровВРегистре);
		
		ФормаПодбора = ПолучитьФорму("Справочник.Номенклатура.Форма.ФормаПодбора", 
										Параметры,
										Таблица
									);
				
		ФормаПодбора.ЗакрыватьПриВыборе = Ложь;
		ФормаПодбора.Открыть();
		
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, Таблица, СтруктураКолонок) Экспорт
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.Номенклатура") Тогда
		
		Номенклатура 	= ВыбранноеЗначение;
		Количество 		= 1;
		
	ИначеЕсли ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		
		Номенклатура 	= ВыбранноеЗначение.Строка.Номенклатура;
		//Количество 		= ВыбранноеЗначение.ЗапрашиваемоеКоличество;
		Количество =1;
	Иначе
		
		Возврат;
		
	КонецЕсли;
	
	Строки = Таблица.НайтиСтроки(Новый Структура("Номенклатура", Номенклатура));
	
	Если Строки.Количество() Тогда
		
		Строка = Строки[0];
		
	Иначе
		
		Строка = Таблица.Добавить();
		Строка.Номенклатура = Номенклатура;
		
	КонецЕсли;
	
	Строка.Количество = Строка.Количество + Количество;
	
	// Изменим строки
	
	Если СтруктураКолонок.ЕстьНоменклатура Тогда
		ФункцииФормДокументов.НоменклатураПриИзменении(
				Таблица, 
				СтруктураКолонок,
				Строка);
	КонецЕсли;
	
	Если СтруктураКолонок.ЕстьКоличество Тогда
		ФункцииФормДокументов.КоличествоПриИзменении(
				Таблица, 
				СтруктураКолонок, 
				Строка);
	КонецЕсли;
	
КонецПроцедуры