Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	Если ТипЗнч(Ссылка.Заказ.ЗаказЧик) = Тип("БизнесПроцессСсылка.СборкаЗаказа") Тогда
		ДокументРезерва = Ссылка.Заказ.ЗаказЧик.Заказ;
	Иначе
		ДокументРезерва = Ссылка.Заказ;
	КонецЕсли;
	
	ЕстьСборкаЗаказа = ТипЗнч(Ссылка.Заказ.Заказчик) = Тип("БизнесПроцессСсылка.СборкаЗаказа");
	
	Запрос = Новый Запрос(
	
	КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() + "
	
	|;
	|ВЫБРАТЬ
	|	Заказ, Заказ.Заказчик Заказчик
	|ИЗ
	|	Документ.КорректировкаВнутреннегоЗаказа
	|ГДЕ
	|	Ссылка = &Ссылка
	|;
	|
	
	// внутренние заказы
	
	|ВЫБРАТЬ
	|	&Период					КАК Период,
	|	&ВидДвиженияПриход 		КАК ВидДвижения,
	|	Ссылка.Заказ			КАК ВнутреннийЗаказ,
	|	Ссылка.Заказ.Заказчик	КАК Заказчик,
	|	Размещение	 			КАК Размещение,
	|	Номенклатура,
	|	Упаковка,
	|	СУММА(Количество) Количество
    |ИЗ
	|	Документ.КорректировкаВнутреннегоЗаказа.Товары
	|
	|ГДЕ
	|	Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Ссылка.Заказ.Заказчик,
	|	Ссылка.Заказ,
	|	Размещение,
	|	Номенклатура,
	|	Упаковка
	|;
	
	// Резервы
	
	|ВЫБРАТЬ
	|	&Период				Период,
	|	&ВидДвиженияПриход 	ВидДвижения,
	|	Размещение 			Размещение,
	|	&ДокументРезерва	ДокументРезерва,
	|	Номенклатура		Номенклатура,
	|	СУММА(Количество * ЕСТЬNULL(Упаковка.Коэффициент,1)) Количество
	|ИЗ
	|	Документ.КорректировкаВнутреннегоЗаказа.Товары
	|
	|ГДЕ
	|	Ссылка = &Ссылка И
	|	НЕ Ссылка.БезДвиженийПоРезерву И
	|	Размещение ССЫЛКА Справочник.Склады И Размещение <> &ПустойСклад
	|
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура,
	|	Упаковка,
	|	Размещение
	|;
		
		// РАЗМЕЩЕНИЕ ЗАКАЗОВ
	
	|ВЫБРАТЬ
	|	&Период				КАК Период,
	|	&ВидДвиженияПриход 	КАК ВидДвижения,
	|	Размещение 			Очередь,
	|	Ссылка.Заказ		Заказ,
	|	Номенклатура,
	|	Упаковка,
	|	СУММА(Количество) Количество
    |ИЗ
	|	Документ.КорректировкаВнутреннегоЗаказа.Товары
	|
	|ГДЕ
	|	Ссылка = &Ссылка И
	|	НЕ Размещение ССЫЛКА Справочник.Склады И Размещение <> Неопределено И ЕСТЬNULL(Размещение, 0) <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	Ссылка.Заказ,
	|	Размещение,
	|	Номенклатура,
	|	Упаковка
	|;
	
	// ОТГРУЖЕННЫЕ ЗАКАЗЫ

	|ВЫБРАТЬ
	|	&Период	Период,
	|	Ссылка.Заказ Заказ,
	|	СУММА(Номенклатура.Вес * ВЫБОР КОГДА Упаковка = &ПустаяУпаковка ТОГДА Количество ИНАЧЕ Количество * Упаковка.Коэффициент КОНЕЦ) 	ВесЗаказа,
	|	СУММА(Номенклатура.Объем * ВЫБОР КОГДА Упаковка = &ПустаяУпаковка ТОГДА Количество ИНАЧЕ Количество * Упаковка.Коэффициент КОНЕЦ) 	ОбъемЗаказа
	|ИЗ
	|	Документ.КорректировкаВнутреннегоЗаказа.Товары
	|ГДЕ
	|	Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Ссылка
	|");
	
	//Запрос.УстановитьПараметр("Область", 			ПараметрыСеанса.ТекущаяОбласть);
	Запрос.УстановитьПараметр("Ссылка", 				Ссылка);
	Запрос.УстановитьПараметр("Период", 				Ссылка.Дата);
	Запрос.УстановитьПараметр("ВидДвиженияПриход", 		ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("ВидДвиженияРасход", 		ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("ПустойСклад", 			Справочники.Склады.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяСборка", 			БизнесПроцессы.СборкаЗаказа.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПустаяУпаковка", 		Справочники.УпаковкиНоменклатуры.ПустаяСсылка());
	Запрос.УстановитьПараметр("ЗаказЧик", 				Ссылка.Заказ.Заказчик);
	Запрос.УстановитьПараметр("ДокументРезерва",		ДокументРезерва);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ДополнительныеСвойства.Вставить("ПараметрыСистемы", КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[0].Выгрузить()));
	ДополнительныеСвойства.Вставить("Шапка", 			КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[1].Выгрузить()));
	ДополнительныеСвойства.Вставить("ВнутренниеЗаказы", Пакет[2].Выгрузить());
	ДополнительныеСвойства.Вставить("ТоварыВРезерве", 	Пакет[3].Выгрузить());
	ДополнительныеСвойства.Вставить("РазмещениеЗаказов",Пакет[4].Выгрузить());
	ДополнительныеСвойства.Вставить("ОтгруженныеЗаказы",Пакет[5].Выгрузить());
		
КонецПроцедуры
