
#Область Экспортные

&НаСервере
Функция ИзменитьНастройкуОтчетаПользователем(Ссылка, Настройка) Экспорт
	
	Возврат Справочники.ОтчетыПользователей.ИзменитьНастройкуОтчетаПользователем(Ссылка, Настройка);
	
КонецФункции

&НаСервере
Процедура ОбновитьHTML() Экспорт
	
	ОтчетыHTML = Справочники.ОтчетыПользователей.ПолучитьHTMLСпискаОтчетов();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНастройкиОтчета(Ссылка) Экспорт
	
	Возврат Новый Структура("ИсточникДанных, АдресНастроек", Ссылка.ИсточникДанных, ПоместитьВоВременноеХранилище(Ссылка.Настройки));
	
КонецФункции

&НаСервере
Функция ПометитьНаУдалениеНаСервере(Ссылка)
	
	Попытка
		
		Ссылка.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
		
	Исключение
		
		ОбщиеФункции.СообщитьТекст(ОписаниеОшибки());
		Возврат Ложь; КонецПопытки;
	
	Возврат Истина;
	
КонецФункции
&НаКлиенте
Процедура ОбработатьПометкуУдаления(Результат, Параметры) Экспорт
	
	Если 	Результат = КодВозвратаДиалога.Да И
			ПометитьНаУдалениеНаСервере(Параметры) Тогда
			
		ОбновитьHTML() КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ПометитьНаУдаление(Ссылка) Экспорт
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ОбработатьПометкуУдаления", ЭтаФорма, Ссылка),"Удалить отчет:" + Ссылка + "?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНовыйКомментарий(Ссылка) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ДекорацияСоздатьОтчетНажатие(Элемент)
	
	ОткрытьФорму("Справочник.ОтчетыПользователей.ФормаОбъекта");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Слежение.Записать("Отчеты пользователя. Открыл список",,ИмяФормы);
	ОбновитьHTML();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетыHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	HTMLОбработкаКлиент.ТекстHTMLПриНажатии(ДанныеСобытия, СтандартнаяОбработка, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	 
	ОбновитьHTML();
	
КонецПроцедуры

&НаКлиенте
Процедура ПростойСправочник(Команда)
	
	ОткрытьФорму("Справочник.ОтчетыПользователей.Форма.ПростойСписок");
	
КонецПроцедуры

