
Процедура ПередЗаписью(Отказ)
	
	Если ПустаяСтрока(Наименование) Тогда
		
		Наименование = СокрЛП(
				ТРег(Фамилия) + " " + 
				ТРег(Имя) + " " + 
				ТРег(Отчество));
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		
		Наименование 	= ДанныеЗаполнения.Наименование;
		ЮрФизЛицо		= Перечисления.ЮрФизЛицо.ФизЛицо;
		ФизЛицо			= ДанныеЗаполнения;
		
		// контактные данные
		
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Представление ИЗ РегистрСведений.ПредставлениеКонтактнойИнформации ГДЕ Объект = &Объект И Вид В ИЕРАРХИИ(&Почта) УПОРЯДОЧИТЬ ПО ЗначениеПоУмолчанию Убыв");
		Запрос.УстановитьПараметр("Почта", Справочники.ВидыКонтактнойИнформации.АдресЭлектроннойПочты);
		Запрос.УстановитьПараметр("Объект", ДанныеЗаполнения);
		
		Выборка = Запрос.Выполнить().Выбрать(); 
		Если Выборка.Следующий() Тогда ЭлектроннаяПочта = Выборка.Представление; КонецЕсли;
	КонецЕсли;
КонецПроцедуры
