
&НаКлиенте
Процедура ОтправитьВСборку(Команда)
	
	Закрыть("ВСборку");
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьЗаказСрезервом(Команда)
	
	Закрыть("Сохранить");
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакупитьЗаказ(Команда)
	Закрыть("СохранитьИЗакупить");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КлючСохраненияПоложенияОкна =  Новый УникальныйИдентификатор;;
	Элементы.ГруппаЗакупить.Видимость = Параметры.ЕстьТоварПодЗаказ = Истина;
	Элементы.ВЗакупке.Видимость = Параметры.ЗакупитьНедостающее = Истина;
	 

КонецПроцедуры
