
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//
	Список.Параметры.УстановитьЗначениеПараметра("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = СобытияКлиент.ИмяПоказаноОповещение() Тогда
		Элементы.События.Обновить(); 
		
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПодпискиНаОповещения(Команда)
	
	ОткрытьФорму("РегистрСведений.ПодпискиНаОповещение.Форма.Настройка");
	
КонецПроцедуры
