
&НаКлиенте
Процедура Подбор(Команда)
	ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора", Новый Структура("МножественныйВыбор", Истина), ЭтаФорма);
	ПодборНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПодборНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") Тогда
		Для Каждого Строка Из ВыбранноеЗначение Цикл
			НоваяСтрока = Объект.Состав.Добавить();
			НоваяСтрока.Контрагент = Строка; КонецЦикла; КонецЕсли;
КонецПроцедуры

  