
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.ФильтрДата = Истина Тогда
		
		ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата");
    	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.БольшеИлиРавно;
    	ЭлементОтбора.ПравоеЗначение = НачалоДня(ТекущаяДата());
    	ЭлементОтбора.Использование = Истина;
	Иначе
		
		Элементы.ФормаАрхив.Видимость = Ложь;
		Элементы.ФормаСоздать.Видимость = Ложь;
		Элементы.ФормаСкопировать.Видимость = Ложь;
		//Элементы.ФормаКоманднаяПанель.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура АрхивНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Архив(Команда)
	
	ОткрытьФорму("РегистрСведений.ОбращенияВТехПоддержку.Форма.ФормаСписка", Новый Структура("ФильтрДата", Ложь),,1,);
		
КонецПроцедуры
