
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Объект.Наименование = "Чуш";
		
	КонецЕсли;
	
	УстановитьОтборДинамическогоСписка();
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборДинамическогоСписка()
	СортировкаЯчеек.Параметры.УстановитьЗначениеПараметра("ИмяПроход",Объект.Проход);
	СортировкаЯчеек.Параметры.УстановитьЗначениеПараметра("ИмяСекция",Объект.Секция);
	СортировкаЯчеек.Параметры.УстановитьЗначениеПараметра("ИмяЯрус",Объект.Ярус);
	СортировкаЯчеек.Параметры.УстановитьЗначениеПараметра("ИмяПоддон",Объект.Поддон);
КонецПроцедуры

&НаСервере
Процедура СоздатьНесуществующиеНаСервере()
	ПроверитьСоздатьПорядок(1,Объект.Проход);
	ПроверитьСоздатьПорядок(2,Объект.Секция);
	ПроверитьСоздатьПорядок(3,Объект.Ярус);
	ПроверитьСоздатьПорядок(4,Объект.Поддон);
	Элементы.СортировкаЯчеек.Обновить();
КонецПроцедуры

&НаСервере
Процедура ПроверитьСоздатьПорядок(ВидЯчейки,Имя)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПорядокЯчеек.Вес
	               |ИЗ
	               |	РегистрСведений.ПорядокЯчеек КАК ПорядокЯчеек
	               |ГДЕ
	               |	ПорядокЯчеек.ВидЯчейки = &ВидЯчейки
	               |	И ПорядокЯчеек.Имя = &Имя";
	Если ЗначениеЗаполнено(Имя) Тогда
		Запрос.УстановитьПараметр("ВидЯчейки",ВидЯчейки);
		Запрос.УстановитьПараметр("Имя",Имя);
		Если Запрос.Выполнить().Пустой() Тогда
			НовЗапись = РегистрыСведений.ПорядокЯчеек.СоздатьМенеджерЗаписи();
			НовЗапись.ВидЯчейки = ВидЯчейки;
			НовЗапись.Имя = Имя;
			НовЗапись.Вес = Прав("000"+Имя,3);
			НовЗапись.Записать();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНесуществующие(Команда)
	СоздатьНесуществующиеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура РеквизитПриИзменении(Элемент)
	УстановитьОтборДинамическогоСписка();
КонецПроцедуры
