


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ДниРезервирования = НаборКонстант.СрокРезервированияТовара;
	ПредупреждатьОСнятииЗа = НаборКонстант.ПредупреждатьОСнятииРезерваЗа;
	СниматьБезПредупрежденияПосле = НаборКонстант.ВклАвтоматическоеСнятиеРезервов;
	///Если резервирование включить то надо заполнить как минимум да параметра
	Если НаборКонстант.ВклАвтоматическоеСнятиеРезервов = Истина тогда
		Если НаборКонстант.СрокРезервированияТовара = 0 Тогда
			Сообщить("Укажите количество дней резервирования!");
			Отказ = истина;
		КонецЕсли;
		///
		Если НаборКонстант.ПредупреждатьОСнятииРезерваЗа = 0 Тогда
			Сообщить("Укажите количество дней перед снятием резерва!");
			Отказ = Истина;
		КонецЕсли;
		///
		Если НаборКонстант.СрокРезервированияТовара < НаборКонстант.ПредупреждатьОСнятииРезерваЗа Тогда
			Сообщить("Количество дней резервирования товара не может быть меньше количества!");
			НаборКонстант.ПредупреждатьОСнятииРезерваЗа = 0;
		    Отказ = Истина;
		КонецЕсли;
		///
		Если НаборКонстант.СниматьРезервыБезПредупрежденияСтарше < НаборКонстант.СрокРезервированияТовара Тогда
			Сообщить("Снятие резервов без предупреждения не может быть меньше количества дней резервирования!");
			НаборКонстант.СниматьРезервыБезПредупрежденияСтарше = 0;
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

