&НаСервере
Функция ПолучитьТоварыДляДокумента(Ссылки, СуммаВклНДС, Организация, Партнер, ТипЦен, Валюта)
	
	//Запрос = Новый Запрос("
	//|ВЫБРАТЬ	
	//|	Ссылка, 
	//|	НомерСтроки, 
	//|	Всего, 
	//|	ВЫБОР КОГДА Ссылка.СуммаВключаетНДС ТОГДА Сумма - СуммаНДС ИНАЧЕ Сумма КОНЕЦ СуммаБезНДС, 
	//|	ВЫБОР 
	//|		КОГДА СтавкаНДС = &Ставка18 ТОГДА 18
	//|		КОГДА СтавкаНДС = &Ставка19 ТОГДА 19
	//|		КОГДА СтавкаНДС = &Ставка20 ТОГДА 20
	//|		КОГДА СтавкаНДС = &Ставка10 ТОГДА 10
	//|	ИНАЧЕ 0 КОНЕЦ СтавкаНДСЧисло,
	//|	Номенклатура, 
	//|	Цена, 
	//|	0 ЦенаРасч,
	//|	Количество, 
	//|	Сумма, 
	//|	СуммаНДС,
	//|	Всего
	//|ИЗ
	//|	Документ.КоммерческоеПредложение.Товары 
	//|
	//|ГДЕ 
	//|	Ссылка В(&Ссылки)
	//|
	//|УПОРЯДОЧИТЬ ПО Ссылка, НомерСтроки
	//|");
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КоммерческоеПредложениеТовары.Ссылка,
	                      |	КоммерческоеПредложениеТовары.НомерСтроки,
	                      |	КоммерческоеПредложениеТовары.Всего,
	                      |	ВЫБОР
	                      |		КОГДА КоммерческоеПредложениеТовары.Ссылка.СуммаВключаетНДС
	                      |			ТОГДА КоммерческоеПредложениеТовары.Сумма - КоммерческоеПредложениеТовары.СуммаНДС
	                      |		ИНАЧЕ КоммерческоеПредложениеТовары.Сумма
	                      |	КОНЕЦ КАК СуммаБезНДС,
	                      |	КоммерческоеПредложениеТовары.Номенклатура,
	                      |	КоммерческоеПредложениеТовары.Цена,
	                      |	0 КАК ЦенаРасч,
	                      |	КоммерческоеПредложениеТовары.Количество,
	                      |	КоммерческоеПредложениеТовары.Сумма,
	                      |	КоммерческоеПредложениеТовары.СуммаНДС,
	                      |	КоммерческоеПредложениеТовары.СтавкаНДС
	                      |ИЗ
	                      |	Документ.КоммерческоеПредложение.Товары КАК КоммерческоеПредложениеТовары
	                      |ГДЕ
	                      |	КоммерческоеПредложениеТовары.Ссылка В(&Ссылки)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	КоммерческоеПредложениеТовары.Ссылка,
	                      |	КоммерческоеПредложениеТовары.НомерСтроки");

	
	//Запрос.УстановитьПараметр("Ставка18", 	Перечисления.СтавкиНДС.НДС18);
	//Запрос.УстановитьПараметр("Ставка19", 	Перечисления.СтавкиНДС.НДС19);
	//Запрос.УстановитьПараметр("Ставка20", 	Перечисления.СтавкиНДС.НДС20);
	//Запрос.УстановитьПараметр("Ставка10", 	Перечисления.СтавкиНДС.НДС10);
	Запрос.УстановитьПараметр("Ссылки", 	Ссылки);
	
	Док1 = Ссылки[0];
	СуммаВклНДС = Док1.СуммаВключаетНДС;
	Организация	= Док1.Организация;
	Партнер		= Док1.Партнер;
	ТипЦен		= Док1.ТипЦен;
	Валюта		= Док1.Валюта;
	
	Товары = КонвертацияТипов.ПолучитьМассивИзТаблицыЗначений(Запрос.Выполнить().Выгрузить());
	
	// Рассчитаем цену
	
	Для Каждого Строка Из Товары Цикл
		Строка.ЦенаРасч = РаботаСНоменклатурой.ПолучитьЦену(Строка.Номенклатура, ТипЦен, Валюта,,Партнер); КонецЦикла;
	
	Возврат Товары;
	
КонецФункции
&НаКлиенте
Функция КолСимвПослеЗапятой(Число)
	
	стр = Формат(Число, "ЧГ=");
	Возврат СтрДлина(стр) - СтрНайти(стр, ",");
	
КонецФункции
&НаКлиенте
Процедура ДобавитьОшибку(Структура, ОпОшибки, КосТовары)
	
	Структура.Вставить("ОписаниеОшибки", ОпОшибки);
	КосТовары.Добавить(Структура);
	
КонецПроцедуры
&НаКлиенте
Функция ВыделитьКосТовары(Товары, СуммаВклНДС)
	
	ТипТовар 	= Тип("СправочникСсылка.Номенклатура");
	КосТовары 	= Новый Массив;
	
	КолСтрок = Товары.Количество();
	Для Ном = 1 ПО КолСтрок Цикл Строка = Товары[КолСтрок - Ном];
		
		// Посчитаем
		СуммаРасч 		= Строка.Цена * Строка.Количество;
		
		//СуммаНДСРасч 	= Окр(?(СуммаВклНДС, 
		//СуммаРасч * Строка.СтавкаНДСЧисло / (100 + Строка.СтавкаНДСЧисло),
		//СуммаРасч * Строка.СтавкаНДСЧисло / 100), КолСимвПослеЗапятой(Строка.СуммаНДС)); 
		
		Если Строка.СтавкаНДС=ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС18") Тогда  СтавкаНДСЧисло=18
		ИначеЕсли  Строка.СтавкаНДС=ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС19") Тогда  СтавкаНДСЧисло=19
		ИначеЕсли  Строка.СтавкаНДС=ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") Тогда  СтавкаНДСЧисло=20
		ИначеЕсли  Строка.СтавкаНДС=ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10") Тогда  СтавкаНДСЧисло=10
		КонецЕсли;
		
		СуммаНДСРасч 	= Окр(?(СуммаВклНДС, 
		СуммаРасч * СтавкаНДСЧисло / (100 + СтавкаНДСЧисло),
		СуммаРасч * СтавкаНДСЧисло / 100), КолСимвПослеЗапятой(Строка.СуммаНДС)); 
		
		ВсегоРасч		= СуммаРасч + ?(СуммаВклНДС, 0, СуммаНДСРасч);
		
		Строка.Вставить("СуммаРасч", 		СуммаРасч);
		Строка.Вставить("СуммаНДСРасч", 	СуммаНДСРасч);
		Строка.Вставить("ВсегоРасч", 		ВсегоРасч);
		
		Если ТипЗнч(Строка.Номенклатура) <> ТипТовар Тогда
			ДобавитьОшибку(Строка, "Строка а не товар", КосТовары);
			Товары.Удалить(КолСтрок - Ном);	// Удалим из товаров
			
		ИначеЕсли Строка.Цена <> Строка.ЦенаРасч Тогда
			ДобавитьОшибку(Строка, "Другая цена", КосТовары);
			
		ИначеЕсли Строка.Сумма <> СуммаРасч Или Строка.СуммаНДС <> СуммаНДСРасч Или Строка.Всего <> ВсегоРасч Тогда
			ДобавитьОшибку(Строка, "Суммы отличаются", КосТовары); КонецЕсли; КонецЦикла;
	
	Возврат КосТовары;
	
КонецФункции

&НаКлиенте
Процедура ЧтоРешилиСКосТоварами(резЗакрытия, ДопПараметры) Экспорт
	
	Если резЗакрытия = Истина Тогда
		ОткрытьФорму("БизнесПроцесс.ЗаявкаПокупателя.ФормаОбъекта", ДопПараметры); КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// Реквизиты шапки берем из первой ссылки
	
	СуммаВклНДС = Истина;
	ТипЦен 		= Неопределено;
	Организация = Неопределено;
	Партнер 	= Неопределено;
	Валюта 		= Неопределено;
	
	Товары 		= ПолучитьТоварыДляДокумента(ПараметрКоманды, СуммаВклНДС, Организация, Партнер, ТипЦен, Валюта);
	КосТовары	= ВыделитьКосТовары(Товары, СуммаВклНДС);
	Параметры	= Новый Структура("Товары, Организация, Партнер, ТипЦен, Валюта", Товары, Организация, Партнер, ТипЦен, Валюта);
	
	Если КосТовары.Количество() Тогда
			ОткрытьФорму("Документ.КоммерческоеПредложение.Форма.ПоказатьНекорректныеТовары", Новый Структура("КосТовары", КосТовары), ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка, Новый ОписаниеОповещения("ЧтоРешилиСКосТоварами", ЭтотОбъект, Параметры)); 
	Иначе	ОткрытьФорму("БизнесПроцесс.ЗаявкаПокупателя.ФормаОбъекта", Параметры); КонецЕсли;
	
КонецПроцедуры
