
&НаСервере
Функция ПолучитьНомер(ЧёртиЧё)
	
	ВОзврат ?(ЧёртиЧё.Метаданные().Реквизиты.Найти("Заказ") = Неопределено, ЧёртиЧё.Номер, ЧёртиЧё.Заказ.Номер);
	
КонецФункции
&НаКлиенте
Процедура Напечатать(Номер)
	
	Табл = Новый ТабличныйДокумент;
	
	Ячейка = Табл.Область("R1C1");
	
	Ячейка.Текст = Номер;
	Ячейка.Шрифт = Новый Шрифт(Новый Шрифт, "Arial", 6);
	
	Табл.ВерхнийКолонтитул.Выводить = Ложь;
	Табл.НижнийКолонтитул.Выводить = Ложь;
	Табл.ПолеСлева 	= 0;
	Табл.ПолеСправа = 0;
	Табл.ПолеСверху = 0;
	Табл.ПолеСнизу 	= 0;
	Табл.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	Табл.МасштабПечати = 1900;
	
	Табл.Напечатать(РежимИспользованияДиалогаПечати.НеИспользовать);
	
КонецПроцедуры
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Для Каждого Строка ИЗ ПараметрКоманды Цикл Напечатать(ПолучитьНомер(Строка)) КонецЦикла;
	ПоказатьОповещениеПользователя("Задание отправлено на принтер",,"Печать номера А4", БиблиотекаКартинок.label);
	
КонецПроцедуры
