&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИдентификаторВызывающейФормы = Параметры.УникальныйИдентификатор;	
КонецПроцедуры


&НаКлиенте
Процедура Прочитать(Команда)
		
	//очищаем таблицу и удаляем колонки 
	Таблица.Очистить();
	УдалитьКолонкиНаСервере();
	//Таблица.Очистить();	
	
	//подключаемся к эксел
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(ИмяФайла);
		Состояние("Обработка файла Microsoft Excel...");
	Исключение
		Сообщить("Ошибка при открытии файла с помощью Excel! Загрузка не будет произведена!");
		Сообщить(ОписаниеОшибки());
		Возврат;
	КонецПопытки;
		
	Попытка 
    	//Открываем необходимый лист
    	Excel.Sheets(1).Select();  // лист 1, по умолчанию  
	Исключение
		//Закрываем Excel
	    Excel.ActiveWorkbook.Close(); 	
		Excel = 0;
		Сообщить("Файл "+Строка(ИмяФайла)+" не соответствует необходимому формату! Первый лист не найден!");
		//ОтменитьТранзакцию();
		Возврат;
	КонецПопытки;	
	

    //Получим количество строк и колонок.
    //В разных версиях Excel получаются по-разному, поэтому сначала определим версию Excel
    Версия = Лев(Excel.Version,Найти(Excel.Version,".")-1);
    Если Версия = "8" тогда
        ФайлСтрок   = Excel.Cells.CurrentRegion.Rows.Count;
        ФайлКолонок = Макс(Excel.Cells.CurrentRegion.Columns.Count, 13);
	Иначе
		ФайлСтрок   = Excel.Cells(1,1).SpecialCells(11).Row;
		ФайлКолонок = Excel.Cells(1,1).SpecialCells(11).Column;   
	Конецесли;
	
	
	//считываем первую строку и генерируем колонки	
	Сч = 1;
	Массив = Новый Массив;
	//Пока ЗначениеЗаполнено(Excel.Cells(1, Сч).Text) ИЛИ Сч = 3  Цикл
	Для Сч = 1 По ФайлКолонок Цикл
		ИмяКолонки = Excel.Cells(1, Сч).Text;
		ИмяБезПробелов = СтрЗаменить(ИмяКолонки," ",""); // убираем из имени колонок пробелы
		Если Сч > 3 И ИмяБезПробелов <> "" Тогда
		
			СписокКодовСкладов.Добавить(ИмяБезПробелов);	
		
		КонецЕсли;
		
		//Таблица.Добавить(ИмяБезПробелов,,ИмяКолонки);		
		Если Сч = 3 Тогда
			ИмяБезПробелов = "_3_";
		КонецЕсли;	
		Если ИмяБезПробелов = "" Тогда
		
			ИмяБезПробелов = СтрЗаменить(Excel.Cells(1, Сч - 1).Text," ","") + "_";
		
		КонецЕсли;
		Если ИмяБезПробелов = "_" Тогда
		
			Продолжить;	
		
		КонецЕсли;
		Массив.Добавить(ИмяБезПробелов);
		//Сч = Сч + 1;
	КонецЦикла;
	КолКолонок = ДобавитьИмяКолонкиНаСервере(Массив);
	
	Для НС = 3 по ФайлСтрок Цикл  // НС указываем с какой строки начинать обработку        
		
		Состояние("Файл "+Строка(ИмяФайла)+": Обрабатывается первый лист "+Строка(Формат(?(ФайлСтрок=0,0,((100*НС)/ФайлСтрок)),"ЧЦ=3; ЧДЦ=0"))+" %");
		
		ОбработкаПрерыванияПользователя(); //указав данный оператор, цикл можно прервать в любой момент нажатие ctrl+break
		
		НоваяСтрока = Таблица.Добавить();		
			
		Для НомерКолонки = 1 по КолКолонок Цикл 
			//заполняем строку значениями
			Если НомерКолонки > 2 Тогда
			    ТекущееЗначение = СокрЛП(Строка(Excel.Cells(НС, НомерКолонки).Value));
			Иначе
				ТекущееЗначение = СокрЛП(Строка(Excel.Cells(НС, НомерКолонки).Text));
			КонецЕсли;
			
			ИмяКолонки = ВернутьИмяКолонки(НомерКолонки-1); 			
			НоваяСтрока[ИмяКолонки] = ТекущееЗначение;				
		КонецЦикла;
		
	КонецЦикла;   
	Excel.Quit();
	//ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиСкладПоКоду(Код)
	Возврат Справочники.Склады.НайтиПоКоду(Код)
КонецФункции // ()



&НаСервере
Процедура УдалитьКолонкиНаСервере()
	ЭлементФормы = Элементы.Найти("Таблица");
	
	Если ЭлементФормы <> Неопределено Тогда
		
		МассивУдаляемыхРеквизитов = Новый Массив;
		РеквизитыТЗ = ПолучитьРеквизиты("Таблица");
		
		Для Каждого Реквизит Из РеквизитыТЗ Цикл
			МассивУдаляемыхРеквизитов.Добавить("Таблица." + Реквизит.Имя);
		КонецЦикла;
		ЭтаФорма.ИзменитьРеквизиты(,МассивУдаляемыхРеквизитов);        
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Функция ВернутьИмяКолонки(сч)
	ТЗ = РеквизитФормыВЗначение("Таблица");
	Возврат ТЗ.Колонки[сч].Имя;		
КонецФункции

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
		//РасширениеПодключено = ПодключитьРасширениеРаботыСФайлами();
		//Если РасширениеПодключено Тогда
			
			Режим = РежимДиалогаВыбораФайла.Открытие;
			ДиалогСохраненияФайла = Новый ДиалогВыбораФайла(Режим);
			ДиалогСохраненияФайла.ПолноеИмяФайла = "";
			//Фильтр	= "Файл Excel (*.xls, *.xlsx)|*.xls, *.xlsx";  
			//ДиалогСохраненияФайла.Фильтр = Фильтр;
			ДиалогСохраненияФайла.Заголовок = НСтр("ru = 'Выберите каталог для сохранения результата'");
			ДиалогСохраненияФайла.Показать(Новый ОписаниеОповещения("ИмяФайлаНачалоВыбораЗавершение", ЭтаФорма, Новый Структура("ДиалогСохраненияФайла", ДиалогСохраненияФайла)));
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаНачалоВыбораЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	ДиалогСохраненияФайла = ДополнительныеПараметры.ДиалогСохраненияФайла;
	
	
	Если (ВыбранныеФайлы <> Неопределено) Тогда
		
		ФайлВыгрузки = ДиалогСохраненияФайла.ПолноеИмяФайла;
		//Если Прав(ФайлВыгрузки,4) <> ".xls" И  Прав(ФайлВыгрузки,4) <> ".xlsx" И Прав(ФайлВыгрузки,1) <> "." Тогда
		//	ФайлВыгрузки = ФайлВыгрузки + ".xlsx";
		//КонецЕсли;
	КонецЕсли;
	
	//КонецЕсли;
	ИмяФайла = ФайлВыгрузки;

КонецПроцедуры


&НаСервере
Функция ДобавитьИмяКолонкиНаСервере(Массив)
	
	МассивДобавляемыхРеквизитов = Новый Массив; 
	
	Для каждого стр из Массив Цикл
		МассивДобавляемыхРеквизитов.Добавить(Новый РеквизитФормы(стр, Новый ОписаниеТипов("Строка"),"Таблица" ,стр)); 
	КонецЦикла;
	
	ИзменитьРеквизиты(МассивДобавляемыхРеквизитов); 
	
	Для каждого стр из Массив Цикл
		ИмяЭлемента = "Таблица" + стр;
		ЭлементФормыРодитель = Элементы.Таблица;
		Если ЭлементФормыРодитель.ПодчиненныеЭлементы.Найти(ИмяЭлемента)<>Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйЭлемент = Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ЭлементФормыРодитель);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		Путь_ = "Таблица" + "." + стр;
		НовыйЭлемент.ПутьКДанным = Путь_;
	КонецЦикла;

	Возврат РеквизитФормыВЗначение("Таблица").Колонки.Количество();
	
КонецФункции

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	ПеренестиВДокумент = Истина;
	АдресТоваровВХранилище = ПоместитьВоВременноеХранилищеНаСервере();
	Закрыть(АдресТоваровВХранилище);
КонецПроцедуры

&НаСервере
Функция ПоместитьВоВременноеХранилищеНаСервере()
	Структура = Новый Структура("СписокКодовСкладов,ТЗ", СписокКодовСкладов, Таблица.Выгрузить());
	Возврат ПоместитьВоВременноеХранилище(Структура, ИдентификаторВызывающейФормы);
КонецФункции

