
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// Вставить содержимое обработчика.
	// ПараметрыФормы = Новый Структура("", );
	// ОткрытьФорму("WSProxy", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Номенклатура") Тогда
	
		ОткрытьФорму("Справочник.КартинкиНоменклатуры.Форма.СписокКартинокПоВладельцу", Новый Структура("Владелец", ПараметрКоманды), ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
		
	Иначе
		
		ПоказатьПредупреждение(,"Не могу определить форму картинок для данного объекта",,"Сообщить!");
		
	КонецЕсли;
	
КонецПроцедуры
