
&НаСервере
Функция ПолучитьВладельца(ПараметрКоманды)
	Возврат ПараметрКоманды.Владелец;
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПараметрыФормы = Новый Структура("Номенклатура, Упаковка", ПолучитьВладельца(ПараметрКоманды), ПараметрКоманды);
	ОткрытьФорму("Справочник.УпаковкиНоменклатуры.Форма.ЦенаУпаковки", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
