
&НаСервере
Процедура РассчитатьНаСервере()
	//Если  НЕ ЗначениеЗаполнено(Период) Тогда
	//	МодульРегламентныхЗаданий.РассчитатьСреднийОстаток();
	//Иначе
	//Запрос = Новый Запрос("ВЫБРАТЬ НАЧАЛОПЕРИОДА(Дата, МЕСЯЦ) НачалоПериода ИЗ РегистрСведений.РабочиеДни ГДЕ Дата МЕЖДУ &НачалоПериода И &КонецПериода СГРУППИРОВАТЬ ПО НАЧАЛОПЕРИОДА(Дата, МЕСЯЦ)");
	//Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	//Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
	//Выборка = Запрос.Выполнить().Выбрать();
	//Пока Выборка.Следующий() Цикл
	//	МодульРегламентныхЗаданий.РассчитатьСреднийОстаток(Выборка.НачалоПериода, КонецМесяца(Выборка.НачалоПериода)); КонецЦикла;
	//КонецЕсли;
	
	МодульРегламентныхЗаданий.РасчетФактическихДанныхБюджетирования(Период.ДатаНачала, Период.ДатаОкончания); //КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Рассчитать(Команда)
	РассчитатьНаСервере();
КонецПроцедуры
