
//Процедура ОбработкаПроведения(Отказ, РежимПроведения)
//	
//	Движения.Взаиморасчеты.Записывать = Истина;

//	Движение = Движения.Взаиморасчеты.Добавить();
//	Движение.ФормаОтношений = Перечисления.ФормаОтношений.Поставщик; 	
//	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
//	Движение.Период =	Дата;
//	Движение.Организация = Организация;
//	Движение.Партнер 	= Партнер;
//	Движение.Контрагент = Контрагент;
//	Движение.Сумма 	= Сумма; 
//	Движение.СуммаУпр = Сумма;
//	
//	Движения.Записать();
//	
//КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Подготовка
	
	Заголовок = КонтрольПроведения.ПолучитьСтандарнтыйЗаголовокПриПроведенииДокумента(Ссылка);
	
	Документы[Метаданные().Имя].ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Проведение
	
	Если Не Отказ Тогда
		ПроведенияДокументов.ПровестиПоВсемРегистрам(Метаданные().Движения, ДополнительныеСвойства, Движения, Отказ);
	КонецЕсли;
	
	// Запись
	
	Движения.Записать();
	
КонецПроцедуры
