
&НаСервере
Функция ТекущийПользователь()

	Возврат ПараметрыСеанса.ТекущийПользователь;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОткрытьФорму("Справочник.ПрофильИнтернетПочты.ФормаСписка", Новый Структура("Отбор", Новый Структура("Владелец", ТекущийПользователь())), ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
