
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Справочник.Номенклатура.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
	Список = Новый СписокЗначений;
	Список.ЗагрузитьЗначения(ПараметрКоманды);
	
	ОткрытьФорму("Документ.Новость.ФормаОбъекта", Новый Структура("Новинки", Список));
	
КонецПроцедуры
