
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если 	ИмяСобытия = СобытияСистемы.Событие_ЗаписанБизнесПроцесс() И
			ТипЗнч(Параметр.Ссылка) = Тип("БизнесПроцессСсылка.ПродажаВРозницу") Тогда
			
		Элементы.Список.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	 //проверим не собирается ли пользователь открыть чужую смену 
	Настройки = ПолучитьНастройкиПользователя();
	КассаПользователяПоУмолчанию = Настройки.КассаПоУмолчанию;
	
Если ЗначениеЗаполнено(КассаПользователяПоУмолчанию) и Элемент.ТекущиеДанные.Касса <> КассаПользователяПоУмолчанию   Тогда 
		Сообщить("Касса выбранной смены отличается от кассы доступной пользователю по умолчанию! Открытие запрещенно.");
        СтандартнаяОбработка = Ложь;		
	 Возврат;
КонецЕсли;
 
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьНастройкиПользователя()
  
	Возврат  Новый Структура("КассаПоУмолчанию",ОбщиеФункции.НастройкаПользователя("ПоУмолчанию_Касса",ПараметрыСеанса.ТекущийПользователь),);
	
КонецФункции

