&НаСервере
Функция Печать(ТабДок, Ссылка)  Экспорт
		
	Макет = БизнесПроцессы.СогласованиеАссортимента.ПолучитьМакет("СогласованиеАссортимента");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОБластьШапка.Параметры.Заголовок = ФормированиеПечатныхФорм.СформироватьЗаголовокДокумента(Новый Структура("Номер, Дата", Ссылка.Номер, Ссылка.Дата), "Коммерческое предложение");
	
	стрКонтрагенты = "";
	Для Каждого Элемент ИЗ Ссылка.Контрагенты Цикл
	 	стрКонтрагенты = стрКонтрагенты + ", " + Строка(Элемент.Контрагент);
	КонецЦикла;
	
	ОбластьШапка.Параметры.Заказчик = Сред(стрКонтрагенты, 2);
	ТабДок.Вывести(ОбластьШапка);
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабДок.Вывести(ОбластьШапкаТаблицы);
	ОбластьСтрокаТаблицы = Макет.ПолучитьОбласть("СтрокаТаблицы");
	ном = 0;
	Для Каждого Строка ИЗ Ссылка.Товары Цикл ном = ном + 1;
		ОбластьСтрокаТаблицы.Параметры.Номер			= ном; 
		ОбластьСтрокаТаблицы.Параметры.Наименование 	= Строка.Номенклатура;
		ОбластьСтрокаТаблицы.Параметры.Артикул 			= Строка.Номенклатура.Артикул;
		ОбластьСтрокаТаблицы.Параметры.Производитель 	= Строка.Номенклатура.Производитель;
		ОбластьСтрокаТаблицы.Параметры.ЕдИзм			= Строка.Номенклатура.ЕдиницаИзмерения;
		ОбластьСтрокаТаблицы.Параметры.Цена 			= Строка.ЦенаСогласования;
		ОбластьСтрокаТаблицы.Параметры.Инициаторы		= Строка.СписокИнициаторов;
	//	ЗаполнитьЗначенияСвойств(ОбластьСтрокаТаблицы, Строка);
		ТабДок.Вывести(ОбластьСтрокаТаблицы);
	КонецЦикла;
	
КонецФункции
