
&НаСервере
Процедура УправлениеВидимостьюДоступностью()
	
	ЕстьЧтото = СвязанныеДокументы.Количество() Или Процессы.Количество();
	
	Элементы.СвязанныеДокументы.Видимость 	= СвязанныеДокументы.Количество();
	Элементы.Процессы.Видимость 			= Процессы.Количество();
	Элементы.СвязанныеЗадачи.Видимость 		= СвязанныеЗадачи.Количество();
	
	Элементы.НадписьНичегоНет.Видимость = Не ЕстьЧтото;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьТекстЗапросаДокументовОплаты()
	
	
	Возврат "
	|ВЫБРАТЬ
	|	Регистратор Документ,
	|	Представление(Регистратор)	Представление,
	|	Период Дата,
	|	ТИПЗНАЧЕНИЯ(Регистратор)	ВидДокумента,
	|	1 Картинка,
	|	Неопределено Склад
	|ИЗ
	|	РегистрНакопления.ДолгиПоОтгрузкам
	|ГДЕ
	|  ВидДвижения=Значение(ВидДвиженияНакопления.Расход)  //оплаты
	|и Сумма>0                                           //и не возврат
	|и Заказ=&Ссылка
	|"
	
	
	//|ВЫБРАТЬ
	//|	Документ,
	//|	Представление(Документ)	Представление,
	//|	Дата,
	//|	ТИПЗНАЧЕНИЯ(Документ)	ВидДокумента,
	//|	1 Картинка
	//|ИЗ
	//|(
	//|ВЫБРАТЬ
	//|	Партнер,
	//|	Заказ,
	//|	Регистратор		 			Документ,
	//|	Период			 			Дата,
	//|	ВидДвижения,
	//|	Сумма
	//|ИЗ
	//|	РегистрНакопления.ДолгиПоОтгрузкам
	//|ГДЕ Партнер=&Партнер
	//|) вт
	//|ГДЕ
	//|  ВидДвижения=Значение(ВидДвиженияНакопления.Расход)  //оплаты
	//|и Сумма>0                                           //и не возврат
	//|и Заказ=&Ссылка
	//|"
	
	//|ВЫБРАТЬ
	//|	ДокументОплаты		 			Документ,
	//|	Представление(ДокументОплаты)	Представление,
	//|	ДокументОплаты.Дата 			Дата,
	//|	ТИПЗНАЧЕНИЯ(ДокументОплаты)		ВидДокумента,
	//|	ВЫБОР 
	//|		КОГДА ДокументОплаты.Проведен 			ТОГДА 1
	//|		КОГДА ДокументОплаты.ПометкаУдаления 	ТОГДА 2
	//|		ИНАЧЕ 0
	//|		КОНЕЦ Картинка
	//|ИЗ
	//|	РегистрНакопления.Оплаты.Обороты(,,, Заказ = &Ссылка)
	//|"
	
КонецФункции

&НаСервере
Функция ПолучитьТекстЗапросаПоДокументу(ИмяДока, текстУсловия, текстПолеСклад = "Неопределено")
	
	Возврат "
	|ВЫБРАТЬ Ссылка Документ, Представление, Дата, """ + ИмяДока + """ ВидДокумента, "+ текстПолеСклад+" Склад,
	
	|			ВЫБОР КОГДА Проведен ТОГДА 1 КОГДА ПометкаУдаления ТОГДА 2 ИНАЧЕ 0 КОНЕЦ Картинка
	|ИЗ			Документ." + ИмяДока + "
	|ГДЕ		" + текстУсловия+?(НеОтображатьПомеченныеНаУдаление," И ПометкаУдаления=Ложь", "");
	
КонецФункции
&НаСервере
Функция ПолучитьТекстЗапросаПоТаблДокумента(ИмяДока, ИмяТаблицы, текстУсловия)
	
	Возврат "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ Ссылка Документ, Ссылка.Представление, Ссылка.Дата Дата, """ + ИмяДока + """ ВидДокумента, Неопределено Склад,
	|			ВЫБОР КОГДА Ссылка.Проведен ТОГДА 1 КОГДА Ссылка.ПометкаУдаления ТОГДА 2 ИНАЧЕ 0 КОНЕЦ Картинка
	|ИЗ			Документ." + ИмяДока + "." + ИмяТаблицы + "
	|ГДЕ		" + текстУсловия;
	
КонецФункции
&НаСервере
Функция ПолучитьТекстЗапросаПоЗадаче(ИмяЗадачи, текстУсловия)
	
	Возврат "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ Ссылка Задача, Дата, """ + ИмяЗадачи + """ ВидЗадачи, Роль, Склад, Исполнитель, БизнесПроцесс, ДатаВыполнения, Параллельная,
	|			ВЫБОР 
	|				КОГДА Выполнена И ПометкаУдаления ТОГДА 3 
	|				КОГДА ПометкаУдаления ТОГДА 2 
	|				КОГДА Выполнена ТОГДА 1 
	|				ИНАЧЕ 0 
	|			КОНЕЦ Картинка
	|ИЗ			Задача." + ИмяЗадачи + "
	|ГДЕ		" + текстУсловия + "
	|		И НЕ ТочкаМаршрута В(&ТочкиМаршрутаИсключения)";
	
КонецФункции
&НаСервере
Функция ПолучитьТекстЗапросаПоПроцессу(ИмПроца, текстУсловия, ТолькоСсылки = Ложь)
	
	Возврат "
	|ВЫБРАТЬ " + ?(ТолькоСсылки,"Ссылка","
	|			Ссылка Процесс, Дата, """ + ИмПроца + """ ВидПроцесса,
	|			ВЫБОР 
	|				КОГДА ПометкаУдаления И Завершен ТОГДА 2 
	|				КОГДА ПометкаУдаления И Стартован ТОГДА 3
	|				КОГДА ПометкаУдаления ТОГДА 5
	|				КОГДА Завершен ТОГДА 1
	|				КОГДА Стартован ТОГДА 0
	|				ИНАЧЕ 4 
	|			КОНЕЦ Картинка") + "
	|ИЗ			БизнесПроцесс." + ИмПроца + "
	|ГДЕ		" + текстУсловия;
	
КонецФункции
&НаСервере
Процедура Обновить()
	
	перем ЗапросЗадач, ЗапросБП, ЗапросДок;
	
	ТипДок = ТипЗнч(Документ);
	
	Если ТипДок = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		
		ЗапросЗадач = Новый Запрос("
		|" + ПолучитьТекстЗапросаПоЗадаче("ЗадачаПользователю", "
		|БизнесПроцесс В(
		|	" + ПолучитьТекстЗапросаПоПроцессу("ЗаявкаПокупателя", "Заказ = &Ссылка", Истина) + "
		|	ОБЪЕДИНИТЬ все
		|	" + ПолучитьТекстЗапросаПоПроцессу("СборкаЗаказа", "Заказ = &Ссылка", Истина) + "
		|	ОБЪЕДИНИТЬ все
		|	" + ПолучитьТекстЗапросаПоПроцессу("СборкаТовара", "Заказ = &Ссылка", Истина) + "
		|	ОБЪЕДИНИТЬ все
		|	" + ПолучитьТекстЗапросаПоПроцессу("ОтменаСборки", "Заказ = &Ссылка", Истина) + "
		|	ОБЪЕДИНИТЬ все
		|	" + ПолучитьТекстЗапросаПоПроцессу("РедактированиеОтгруженногоЗаказа", "Заказ = &Ссылка", Истина) + "
		|	ОБЪЕДИНИТЬ все
		|	" + ПолучитьТекстЗапросаПоПроцессу("ПеремещениеТоваров", "Заказчик = &Ссылка ИЛИ Заказчик В(ВЫБРАТЬ Ссылка ИЗ БизнесПроцесс.СборкаЗаказа ГДЕ Заказ = &Ссылка)", Истина) + "
		|	ОБЪЕДИНИТЬ все
		|	" + ПолучитьТекстЗапросаПоПроцессу("ДоставкаЗаказа", "Заказ = &Ссылка", Истина) + "
		|	)") + "
		|УПОРЯДОЧИТЬ ПО	Дата
		|");
		
		ЗапросБП = Новый Запрос("
		|" + ПолучитьТекстЗапросаПоПроцессу("ЗаявкаПокупателя", "Заказ = &Ссылка") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоПроцессу("СборкаЗаказа", "Заказ = &Ссылка") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоПроцессу("СборкаТовара", "Заказ = &Ссылка") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоПроцессу("ОтменаСборки", "Заказ = &Ссылка") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоПроцессу("РедактированиеОтгруженногоЗаказа", "Заказ = &Ссылка") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоПроцессу("ПеремещениеТоваров", "Заказчик = &Ссылка ИЛИ Заказчик В(ВЫБРАТЬ Ссылка ИЗ БизнесПроцесс.СборкаЗаказа ГДЕ Заказ = &Ссылка)") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоПроцессу("ДоставкаЗаказа", "Заказ = &Ссылка") + "
		|УПОРЯДОЧИТЬ ПО	Дата
		|");
		
		ЗапросДок = Новый Запрос("
		|ВЫБРАТЬ 	Ссылка
		|ПОМЕСТИТЬ	ТаблицаСборок
		|ИЗ 		БизнесПроцесс.СборкаЗаказа
		|ГДЕ		Заказ = &Ссылка
		|;
		|выбрать ссылка Поместить ТаблицаБП_Перемещение из бизнесПроцесс.ПеремещениеТоваров где Заказчик В(ВЫБРАТЬ Ссылка ИЗ ТаблицаСборок)
		|;
		
		|" + ПолучитьТекстЗапросаПоДокументу("ВнутреннийЗаказ", "Заказчик В(ВЫБРАТЬ Ссылка ИЗ ТаблицаСборок)") + "
		|ОБЪЕДИНИТЬ все 
		|" + ПолучитьТекстЗапросаПоДокументу("ЗаказНаПеремещение", "Заказ = &Ссылка") + "
		|ОБЪЕДИНИТЬ все 
		|" + ПолучитьТекстЗапросаПоДокументу("СборкаЗаказа", "Заказ = &Ссылка", "Склад") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоДокументу("ЗаказНаРазборку", "Заказ = &Ссылка", "Склад") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоДокументу("ОтменаСборки", "Заказ = &Ссылка") + "
		|ОБЪЕДИНИТЬ все 
		|" + ПолучитьТекстЗапросаПоДокументу("СборочныйЛист", "Заказ = &Ссылка", "Склад") + "
		|ОБЪЕДИНИТЬ все 
		|" + ПолучитьТекстЗапросаПоДокументу("РазборочныйЛист", "Заказ = &Ссылка", "Склад") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоТаблДокумента("СнятиеРезерва", "Товары", "Заказ = &Ссылка") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоДокументу("РедактированиеОтгруженногоЗаказа", "Заказ = &Ссылка") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоДокументу("РеализацияТоваров", "Заказ = &Ссылка", "Склад") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоДокументу("ВозвратОтПокупателя", "ДокументОтгрузки в (выбрать ссылка из Документ.РеализацияТоваров где Заказ = &Ссылка)", "Склад") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоДокументу("ПередачаТовара", "Заказ = &Ссылка", "Склад") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоДокументу("ВозвратПереданныхТоваров", "Основание в (выбрать ссылка из документ.ПередачаТовара где Заказ = &Ссылка)", "Склад") + "
		|ОБЪЕДИНИТЬ все
		//|" + ПолучитьТекстЗапросаПоДокументу("ПриемТоваров", "Процесс.Заказчик В(ВЫБРАТЬ Ссылка ИЗ ТаблицаСборок)") + "
		|" + ПолучитьТекстЗапросаПоДокументу("ПриемТоваров", "Процесс в (выбрать ссылка из ТаблицаБП_Перемещение)", "СкладПолучатель") + "
		|ОБЪЕДИНИТЬ все
		//|" + ПолучитьТекстЗапросаПоДокументу("ОтгрузкаТоваров", "Процесс.Заказчик В(ВЫБРАТЬ Ссылка ИЗ ТаблицаСборок)") + "
		|" + ПолучитьТекстЗапросаПоДокументу("ОтгрузкаТоваров", "Процесс в (выбрать ссылка из ТаблицаБП_Перемещение)", "СкладОтправитель") + "
		|ОБЪЕДИНИТЬ все
		//|" + ПолучитьТекстЗапросаПоДокументу("ПеремещениеТоваров", "Основание.Заказчик В(ВЫБРАТЬ Ссылка ИЗ ТаблицаСборок)") + "
		|" + ПолучитьТекстЗапросаПоДокументу("ПеремещениеТоваров", "Основание в (выбрать ссылка из ТаблицаБП_Перемещение)", "СкладОтправитель") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоДокументу("КорректировкаЗаказаПокупателя", "Заказ = &Ссылка") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоДокументу("РедактированиеРегистра", "Заказ = &Ссылка") + "
		|ОБЪЕДИНИТЬ все
		//|" + ПолучитьТекстЗапросаПоДокументу("КорректировкаВнутреннегоЗаказа", "Заказ.Заказчик.Заказ = &Ссылка") + "
		|" + ПолучитьТекстЗапросаПоДокументу("КорректировкаВнутреннегоЗаказа", "Заказ в (выбрать ссылка из документ.ВнутреннийЗаказ где Заказчик в (Выбрать ссылка из ТаблицаСборок))") + " //такая конструкция позволяет использовать индексы
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаДокументовОплаты() + "
		|УПОРЯДОЧИТЬ ПО Дата
		|");
		
	ИначеЕсли ТипДок = Тип("ДокументСсылка.ИнтернетЗаказПокупателя") Тогда
		
		ЗапросЗадач = Новый Запрос("
		|" + ПолучитьТекстЗапросаПоЗадаче("ЗадачаПользователю", "
		|БизнесПроцесс В(
		|	" + ПолучитьТекстЗапросаПоПроцессу("ИнтернетЗаявка", "Заказ = &Ссылка", Истина) + "
		|	ОБЪЕДИНИТЬ все
		|	" + ПолучитьТекстЗапросаПоПроцессу("СборкаЗаказа", "Заказ = &Ссылка", Истина) + "
		|	ОБЪЕДИНИТЬ все
		|	" + ПолучитьТекстЗапросаПоПроцессу("СборкаТовара", "Заказ = &Ссылка", Истина) + "
		|	ОБЪЕДИНИТЬ все
		|	" + ПолучитьТекстЗапросаПоПроцессу("ОтменаСборки", "Заказ = &Ссылка", Истина) + "
		|	ОБЪЕДИНИТЬ все
		|	" + ПолучитьТекстЗапросаПоПроцессу("РедактированиеОтгруженногоЗаказа", "Заказ = &Ссылка", Истина) + "
		|	ОБЪЕДИНИТЬ все
		|	" + ПолучитьТекстЗапросаПоПроцессу("ПеремещениеТоваров", "Заказчик = &Ссылка ИЛИ Заказчик В(ВЫБРАТЬ Ссылка ИЗ БизнесПроцесс.СборкаЗаказа ГДЕ Заказ = &Ссылка)", Истина) + "
		|	ОБЪЕДИНИТЬ все
		|	" + ПолучитьТекстЗапросаПоПроцессу("ДоставкаЗаказа", "Заказ = &Ссылка", Истина) + "
		|	)") + "
		|УПОРЯДОЧИТЬ ПО	Дата
		|");
		
		ЗапросБП = Новый Запрос("
		|" + ПолучитьТекстЗапросаПоПроцессу("ИнтернетЗаявка", "Заказ = &Ссылка") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоПроцессу("СборкаЗаказа", "Заказ = &Ссылка") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоПроцессу("СборкаТовара", "Заказ = &Ссылка") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоПроцессу("ОтменаСборки", "Заказ = &Ссылка") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоПроцессу("РедактированиеОтгруженногоЗаказа", "Заказ = &Ссылка") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоПроцессу("ПеремещениеТоваров", "Заказчик = &Ссылка ИЛИ Заказчик В(ВЫБРАТЬ Ссылка ИЗ БизнесПроцесс.СборкаЗаказа ГДЕ Заказ = &Ссылка)") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоПроцессу("ДоставкаЗаказа", "Заказ = &Ссылка") + "
		|УПОРЯДОЧИТЬ ПО	Дата
		|");
		
		ЗапросДок = Новый Запрос("
		|ВЫБРАТЬ 	Ссылка
		|ПОМЕСТИТЬ	ТаблицаСборок
		|ИЗ 		БизнесПроцесс.СборкаЗаказа
		|ГДЕ		Заказ = &Ссылка
		|;
		
		|выбрать ссылка Поместить ТаблицаБП_Перемещение из бизнесПроцесс.ПеремещениеТоваров где Заказчик В(ВЫБРАТЬ Ссылка ИЗ ТаблицаСборок)
		|;
		
		|" + ПолучитьТекстЗапросаПоДокументу("ВнутреннийЗаказ", "Заказчик В(ВЫБРАТЬ Ссылка ИЗ ТаблицаСборок)") + "
		|ОБЪЕДИНИТЬ все 
		|" + ПолучитьТекстЗапросаПоДокументу("ЗаказНаПеремещение", "Заказ = &Ссылка") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоДокументу("СборкаЗаказа", "Заказ = &Ссылка", "Склад") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоДокументу("ЗаказНаРазборку", "Заказ = &Ссылка", "Склад") + "
		//|ОБЪЕДИНИТЬ все
		//|" + ПолучитьТекстЗапросаПоДокументу("ОтменаСборки", "Заказ = &Ссылка") + "
		|ОБЪЕДИНИТЬ все 
		|" + ПолучитьТекстЗапросаПоДокументу("СборочныйЛист", "Заказ = &Ссылка", "Склад") + "
		|ОБЪЕДИНИТЬ все 
		|" + ПолучитьТекстЗапросаПоДокументу("РазборочныйЛист", "Заказ = &Ссылка", "Склад") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоТаблДокумента("СнятиеРезерва", "Товары", "Заказ = &Ссылка") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоДокументу("РедактированиеОтгруженногоЗаказа", "Заказ = &Ссылка") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоДокументу("РеализацияТоваров", "Заказ = &Ссылка", "Склад") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоДокументу("ВозвратОтПокупателя", "ДокументОтгрузки в (выбрать ссылка из Документ.РеализацияТоваров где Заказ = &Ссылка)", "Склад") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоДокументу("ПередачаТовара", "Заказ = &Ссылка", "Склад") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоДокументу("ВозвратПереданныхТоваров", "Основание в (выбрать ссылка из документ.ПередачаТовара где Заказ = &Ссылка)", "Склад") + "
		|ОБЪЕДИНИТЬ все
		//|" + ПолучитьТекстЗапросаПоДокументу("ПриемТоваров", "Процесс.Заказчик В(ВЫБРАТЬ Ссылка ИЗ ТаблицаСборок)") + "
		|" + ПолучитьТекстЗапросаПоДокументу("ПриемТоваров", "Процесс в (выбрать ссылка из ТаблицаБП_Перемещение)", "СкладПолучатель") + "
		|ОБЪЕДИНИТЬ все
		//|" + ПолучитьТекстЗапросаПоДокументу("ОтгрузкаТоваров", "Процесс.Заказчик В(ВЫБРАТЬ Ссылка ИЗ ТаблицаСборок)") + "
		|" + ПолучитьТекстЗапросаПоДокументу("ОтгрузкаТоваров", "Процесс в (выбрать ссылка из ТаблицаБП_Перемещение)", "СкладОтправитель") + "
		|ОБЪЕДИНИТЬ все
		//|" + ПолучитьТекстЗапросаПоДокументу("ПеремещениеТоваров", "Основание.Заказчик В(ВЫБРАТЬ Ссылка ИЗ ТаблицаСборок)") + "
		|" + ПолучитьТекстЗапросаПоДокументу("ПеремещениеТоваров", "Основание в (выбрать ссылка из ТаблицаБП_Перемещение)", "СкладОтправитель") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоДокументу("КорректировкаИнтернетЗаказа", "Заказ = &Ссылка") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоДокументу("РедактированиеРегистра", "Заказ = &Ссылка") + "
		|ОБЪЕДИНИТЬ все
		//|" + ПолучитьТекстЗапросаПоДокументу("КорректировкаВнутреннегоЗаказа", "Заказ.Заказчик.Заказ = &Ссылка") + "
		|" + ПолучитьТекстЗапросаПоДокументу("КорректировкаВнутреннегоЗаказа", "Заказ в (выбрать ссылка из документ.ВнутреннийЗаказ где Заказчик в (Выбрать ссылка из ТаблицаСборок))") + " //такая конструкция дала ускорение в 10 раз!
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаДокументовОплаты() + "
		|УПОРЯДОЧИТЬ ПО Дата
		|");
		
	ИначеЕсли ТипДок = Тип("ДокументСсылка.ВнутреннийЗаказ") Тогда
		
		ЗапросЗадач = Новый Запрос("
		|" + ПолучитьТекстЗапросаПоЗадаче("ЗадачаПользователю","
		|БизнесПроцесс В(
		|" + ПолучитьТекстЗапросаПоПроцессу("ВнутренняяЗаявка", "Заказ = &Ссылка", Истина) + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоПроцессу("СборкаЗаказа", "Заказ = &Ссылка", Истина) + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоПроцессу("СборкаТовара", "Заказ = &Ссылка", Истина) + "
		|ОБЪЕДИНИТЬ все
		|	" + ПолучитьТекстЗапросаПоПроцессу("ОтменаСборки", "Заказ = &Ссылка", Истина) + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоПроцессу("ПеремещениеТоваров", "Заказчик = &Ссылка ИЛИ Заказчик В(ВЫБРАТЬ Ссылка ИЗ БизнесПроцесс.СборкаЗаказа ГДЕ Заказ = &Ссылка)", Истина) + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоПроцессу("ДоставкаЗаказа", "Заказ = &Ссылка", Истина) + "
		|	)") + "
		|УПОРЯДОЧИТЬ ПО	Дата
		|");
		
		ЗапросБП = Новый Запрос("
		|" + ПолучитьТекстЗапросаПоПроцессу("ВнутренняяЗаявка", "Заказ = &Ссылка") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоПроцессу("СборкаЗаказа", "Заказ = &Ссылка") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоПроцессу("СборкаТовара", "Заказ = &Ссылка") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоПроцессу("ОтменаСборки", "Заказ = &Ссылка") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоПроцессу("ПеремещениеТоваров", "Заказчик = &Ссылка ИЛИ Заказчик В(ВЫБРАТЬ Ссылка ИЗ БизнесПроцесс.СборкаЗаказа ГДЕ Заказ = &Ссылка)") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоПроцессу("ДоставкаЗаказа", "Заказ = &Ссылка") + "
		|УПОРЯДОЧИТЬ ПО	Дата
		|");
		
		ЗапросДок = Новый Запрос("
		|ВЫБРАТЬ 	Ссылка
		|ПОМЕСТИТЬ	ТаблицаСборок
		|ИЗ 		БизнесПроцесс.СборкаЗаказа
		|ГДЕ		Заказ = &Ссылка
		|;
		
		|выбрать ссылка Поместить ТаблицаБП_Перемещение из бизнесПроцесс.ПеремещениеТоваров где Заказчик В(ВЫБРАТЬ Ссылка ИЗ ТаблицаСборок)
		|;
		
		|" + ПолучитьТекстЗапросаПоДокументу("ВнутреннийЗаказ", "Заказчик В(ВЫБРАТЬ Ссылка ИЗ ТаблицаСборок)") + "
		|ОБЪЕДИНИТЬ все 
		|" + ПолучитьТекстЗапросаПоДокументу("ЗаказНаПеремещение", "Заказ = &Ссылка") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоДокументу("СборкаЗаказа", "Заказ = &Ссылка", "Склад") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоДокументу("ЗаказНаРазборку", "Заказ = &Ссылка", "Склад") + "
		//|ОБЪЕДИНИТЬ все
		//|" + ПолучитьТекстЗапросаПоДокументу("ОтменаСборки", "Заказ = &Ссылка") + "
		|ОБЪЕДИНИТЬ все 
		|" + ПолучитьТекстЗапросаПоДокументу("СборочныйЛист", "Заказ = &Ссылка", "Склад") + "
		|ОБЪЕДИНИТЬ все 
		|" + ПолучитьТекстЗапросаПоДокументу("РазборочныйЛист", "Заказ = &Ссылка", "Склад") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоТаблДокумента("СнятиеРезерва", "Товары", "Заказ = &Ссылка") + "
		|ОБЪЕДИНИТЬ все
		//|" + ПолучитьТекстЗапросаПоДокументу("ПриемТоваров", "Процесс.Заказчик В(ВЫБРАТЬ Ссылка ИЗ ТаблицаСборок)") + "
		|" + ПолучитьТекстЗапросаПоДокументу("ПриемТоваров", "Процесс в (выбрать ссылка из ТаблицаБП_Перемещение)", "СкладПолучатель") + "
		|ОБЪЕДИНИТЬ все
		//|" + ПолучитьТекстЗапросаПоДокументу("ОтгрузкаТоваров", "Процесс.Заказчик В(ВЫБРАТЬ Ссылка ИЗ ТаблицаСборок)") + "
		|" + ПолучитьТекстЗапросаПоДокументу("ОтгрузкаТоваров", "Процесс в (выбрать ссылка из ТаблицаБП_Перемещение)", "СкладОтправитель") + "
		|ОБЪЕДИНИТЬ все
		//|" + ПолучитьТекстЗапросаПоДокументу("ПеремещениеТоваров", "Основание.Заказчик В(ВЫБРАТЬ Ссылка ИЗ ТаблицаСборок)") + "
		|" + ПолучитьТекстЗапросаПоДокументу("ПеремещениеТоваров", "Основание в (выбрать ссылка из ТаблицаБП_Перемещение)", "СкладОтправитель") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоДокументу("РедактированиеРегистра", "Заказ = &Ссылка") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоДокументу("КорректировкаВнутреннегоЗаказа", "Заказ = &Ссылка") + "
		|УПОРЯДОЧИТЬ ПО Дата
		|");
		
	ИначеЕсли ТипДок = Тип("ДокументСсылка.Инвентаризация") Тогда
		
		ЗапросДок = Новый Запрос("
			|" + ПолучитьТекстЗапросаПоДокументу("ОприходованиеТоваров", "Инвентаризация = &Ссылка") + "
			|ОБЪЕДИНИТЬ все
			|" + ПолучитьТекстЗапросаПоДокументу("СписаниеТоваров", "Инвентаризация = &Ссылка") + "
			|УПОРЯДОЧИТЬ ПО Дата
			|");
			
	ИначеЕсли ТипДок = Тип("БизнесПроцессСсылка.ЯчеестаяИнвентаризация") Тогда
		
		ЗапросЗадач = Новый Запрос("
		|" + ПолучитьТекстЗапросаПоЗадаче("ЗадачаПользователю","
		|Заказ = &Ссылка") + "
		|УПОРЯДОЧИТЬ ПО	Дата
		|");
		
		ЗапросДок = Новый Запрос("
		|" + ПолучитьТекстЗапросаПоДокументу("РедактированиеРегистра", "Процесс = &Ссылка") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоДокументу("Инвентаризация", "Процесс = &Ссылка") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоДокументу("ПеремещениеТоваров", "Процесс = &Ссылка") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоДокументу("ОприходованиеТоваров", "Процесс = &Ссылка") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоДокументу("СписаниеТоваров", "Процесс = &Ссылка") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоДокументу("СнятиеРезерва", "Процесс = &Ссылка") + "
		|УПОРЯДОЧИТЬ ПО Дата
		|");
		
	ИначеЕсли ТипДок = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		ЗапросБП = Новый Запрос("
		|" + ПолучитьТекстЗапросаПоПроцессу("СогласованиеЗаказаПоставщику", "Заказ = &Ссылка") + "
		|УПОРЯДОЧИТЬ ПО	Дата
		|");
		
		ЗапросЗадач = Новый Запрос("
		|" + ПолучитьТекстЗапросаПоЗадаче("ЗадачаПользователю","
		|Заказ = &Ссылка") + "
		|УПОРЯДОЧИТЬ ПО	Дата
		|");
		
		ЗапросДок = Новый Запрос("
		|ВЫБРАТЬ 	Ссылка Документ, Представление(Ссылка) Представление, Ссылка.Дата Дата, ""Инвойс"" ВидДокумента, ВЫБОР КОГДА Ссылка.Проведен ТОГДА 1 КОГДА Ссылка.ПометкаУдаления ТОГДА 2 ИНАЧЕ 0 КОНЕЦ Картинка
		|ИЗ 		Документ.Инвойс.Товары
		|ГДЕ		ЗаказПоставщику = &Ссылка
		|ОБЪЕДИНИТЬ все
		|ВЫБРАТЬ 	Ссылка Документ, Представление(Ссылка) Представление, Ссылка.Дата Дата, ""ПоступлениеТоваров"" ВидДокумента, ВЫБОР КОГДА Ссылка.Проведен ТОГДА 1 КОГДА Ссылка.ПометкаУдаления ТОГДА 2 ИНАЧЕ 0 КОНЕЦ Картинка
		|ИЗ 		Документ.ПоступлениеТоваров.Товары
		|ГДЕ		Заказ = &Ссылка
		|УПОРЯДОЧИТЬ ПО Дата
		|");
		
	ИначеЕсли ТипДок = Тип("ДокументСсылка.Инвойс") Тогда
		
		ЗапросЗадач = Новый Запрос("
		|" + ПолучитьТекстЗапросаПоЗадаче("ЗадачаПользователю", "
		|БизнесПроцесс В(
		|	" + ПолучитьТекстЗапросаПоПроцессу("ЗакупкаИмпорт", "Инвойс = &Ссылка", Истина) + "
		|)") + "
		|УПОРЯДОЧИТЬ ПО	Дата
		|");
		
		ЗапросБП = Новый Запрос("
		|" + ПолучитьТекстЗапросаПоПроцессу("ЗакупкаИмпорт", "Инвойс = &Ссылка") + "
		|УПОРЯДОЧИТЬ ПО	Дата
		|");
		
		ЗапросДок = Новый Запрос("
		|ВЫБРАТЬ 	ЗаказПоставщику Документ, Представление(Ссылка) Представление, ЗаказПоставщику.Дата Дата, ""ЗаказПоставщику"" ВидДокумента, ВЫБОР КОГДА ЗаказПоставщику.Проведен ТОГДА 1 КОГДА ЗаказПоставщику.ПометкаУдаления ТОГДА 2 ИНАЧЕ 0 КОНЕЦ Картинка
		|ИЗ 		Документ.Инвойс.Товары
		|ГДЕ		Ссылка = &Ссылка
		//|СГРУППИРОВАТЬ ПО ЗаказПоставщику
		|ОБЪЕДИНИТЬ все
		|ВЫБРАТЬ 	Ссылка Документ, Представление(Ссылка) Представление, Ссылка.Дата Дата, ""ПоступлениеТоваров"" ВидДокумента, ВЫБОР КОГДА Ссылка.Проведен ТОГДА 1 КОГДА Ссылка.ПометкаУдаления ТОГДА 2 ИНАЧЕ 0 КОНЕЦ Картинка
		|ИЗ 		Документ.ПоступлениеТоваров.Товары
		|ГДЕ		Инвойс = &Ссылка
		|УПОРЯДОЧИТЬ ПО Дата
		|");
		
 	ИначеЕсли ТипДок = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
		
		ЗапросДок = Новый Запрос("
		|ВЫБРАТЬ 	Заказ Документ, Представление(Ссылка) Представление, Заказ.Дата Дата, ""ЗаказПоставщику"" ВидДокумента, ВЫБОР КОГДА Заказ.Проведен ТОГДА 1 КОГДА Заказ.ПометкаУдаления ТОГДА 2 ИНАЧЕ 0 КОНЕЦ Картинка
		|ИЗ 		Документ.ПоступлениеТоваров.Товары
		|ГДЕ		Ссылка = &Ссылка И Заказ <> ЗНАЧЕНИЕ(Документ.ЗаказПоставщику.ПустаяСсылка)
		//|СГРУППИРОВАТЬ ПО Заказ
		|ОБЪЕДИНИТЬ все
		|ВЫБРАТЬ 	Инвойс Документ, Представление(Ссылка) Представление, Инвойс.Дата Дата, ""Инвойс"" ВидДокумента, ВЫБОР КОГДА Инвойс.Проведен ТОГДА 1 КОГДА Инвойс.ПометкаУдаления ТОГДА 2 ИНАЧЕ 0 КОНЕЦ Картинка
		|ИЗ 		Документ.ПоступлениеТоваров.Товары
		|ГДЕ		Ссылка = &Ссылка И Инвойс <> ЗНАЧЕНИЕ(Документ.Инвойс.ПустаяСсылка)
		//|СГРУППИРОВАТЬ ПО Инвойс
		|УПОРЯДОЧИТЬ ПО Дата
		|");

 	ИначеЕсли ТипДок = Тип("ДокументСсылка.ЗаказНаряд") Тогда
		
		ЗапросЗадач = Новый Запрос("
		|" + ПолучитьТекстЗапросаПоЗадаче("ЗадачаПользователю", "
		|БизнесПроцесс В(
		|	" + ПолучитьТекстЗапросаПоПроцессу("РемонтИнструмента", "ЗаказНаряд = &Ссылка", Истина) + "
		|	ОБЪЕДИНИТЬ все
		|	" + ПолучитьТекстЗапросаПоПроцессу("ДоставкаЗаказа", "Заказ = &Ссылка", Истина) + "
		|)") + "
		|УПОРЯДОЧИТЬ ПО	Дата
		|");
		
		
		ЗапросБП = Новый Запрос("
		|" + ПолучитьТекстЗапросаПоПроцессу("РемонтИнструмента", "ЗаказНаряд = &Ссылка") + "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаПоПроцессу("ДоставкаЗаказа", "Заказ = &Ссылка") + "
		|УПОРЯДОЧИТЬ ПО	Дата
		|");
		
		//ЗапросБП = Новый Запрос(ПолучитьТекстЗапросаПоПроцессу("РемонтИнструмента", "ЗаказНаряд = &Ссылка"));


		ЗапросДок = Новый Запрос(ПолучитьТекстЗапросаПоДокументу("РеализацияТоваров", "Заказ = &Ссылка")+ "
		|ОБЪЕДИНИТЬ все
		|" + ПолучитьТекстЗапросаДокументовОплаты() + "
		|УПОРЯДОЧИТЬ ПО Дата
		|");
		

	ИначеЕсли ТипДок = Тип("БизнесПроцессСсылка.РемонтИнструмента") Тогда
		
		ЗапросЗадач = Новый Запрос("
		|" + ПолучитьТекстЗапросаПоЗадаче("ЗадачаПользователю","
		|БизнесПроцесс = &Ссылка") + "
		|УПОРЯДОЧИТЬ ПО	Дата
		|");
		
		ЗапросБП = Новый Запрос(ПолучитьТекстЗапросаПоПроцессу("РемонтИнструмента", "Ссылка = &Ссылка"));
		
	ИначеЕсли ТипДок = Тип("БизнесПроцессСсылка.СогласованиеАссортимента") Тогда
		
		ЗапросЗадач = Новый Запрос("
		|" + ПолучитьТекстЗапросаПоЗадаче("ЗадачаПользователю","
		|БизнесПроцесс = &Ссылка") + "
		|УПОРЯДОЧИТЬ ПО	Дата
		|");
		
		ЗапросДок = Новый Запрос("
		|ВЫБРАТЬ
		|	Письмо Документ, Представление(Письмо) Представление, Письмо.Дата Дата, ""Письмо"" ВидДокумента, ВЫБОР КОГДА Письмо.Проведен ТОГДА 1 КОГДА Письмо.ПометкаУдаления ТОГДА 2 ИНАЧЕ 0 КОНЕЦ Картинка
		|	ИЗ БизнесПроцесс.СогласованиеАссортимента ГДЕ Ссылка = &Ссылка И Письмо <> ЗНАЧЕНИЕ(Документ.Письмо.ПустаяСсылка)
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	ДокументСогласование Документ, Представление(ДокументСогласование) Представление, ДокументСогласование.Дата Дата, ""СогласованиеАссортимента"" ВидДокумента, ВЫБОР КОГДА ДокументСогласование.Проведен ТОГДА 1 КОГДА ДокументСогласование.ПометкаУдаления ТОГДА 2 ИНАЧЕ 0 КОНЕЦ Картинка
		|	ИЗ БизнесПроцесс.СогласованиеАссортимента ГДЕ Ссылка = &Ссылка И ДокументСогласование <> ЗНАЧЕНИЕ(Документ.СогласованиеАссортимента.ПустаяСсылка)
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	УстановкаЦен Документ, Представление(УстановкаЦен) Представление, УстановкаЦен.Дата Дата, ""УстановкаЦенНоменклатуры"" ВидДокумента, ВЫБОР КОГДА УстановкаЦен.Проведен ТОГДА 1 КОГДА УстановкаЦен.ПометкаУдаления ТОГДА 2 ИНАЧЕ 0 КОНЕЦ Картинка
		|	ИЗ БизнесПроцесс.СогласованиеАссортимента ГДЕ Ссылка = &Ссылка И УстановкаЦен <> ЗНАЧЕНИЕ(Документ.УстановкаЦенНоменклатуры.ПустаяСсылка)
		|УПОРЯДОЧИТЬ ПО Дата
		|");

	Иначе
		
		ОбщиеФункции.СообщитьТекст("Нет данных для загрузки связанных документов для типа " + ТипДок);
		Возврат;
		
	КонецЕсли;
	
	ТочкиМаршрутаИсключения = Новый Массив;
	
	//ТочкиМаршрутаИсключения.Добавить(БизнесПроцессы.СборкаЗаказа.ТочкиМаршрута.Переместить);
	//ТочкиМаршрутаИсключения.Добавить(БизнесПроцессы.СборкаЗаказа.ТочкиМаршрута.ПереместитьКогдаСобран);
	//ТочкиМаршрутаИсключения.Добавить(БизнесПроцессы.СборкаЗаказа.ТочкиМаршрута.ВложеннаяСборка);
	//ТочкиМаршрутаИсключения.Добавить(БизнесПроцессы.СборкаЗаказа.ТочкиМаршрута.ВложеннаяСборка2);
	//ТочкиМаршрутаИсключения.Добавить(БизнесПроцессы.СборкаЗаказа.ТочкиМаршрута.Переместить2);
	//ТочкиМаршрутаИсключения.Добавить(БизнесПроцессы.СборкаЗаказа.ТочкиМаршрута.ВложеннаяСборка1);
	ТочкиМаршрутаИсключения.Добавить(БизнесПроцессы.ПеремещениеТоваров.ТочкиМаршрута.СобратьТовар);
	ТочкиМаршрутаИсключения.Добавить(БизнесПроцессы.ЗаявкаПокупателя.ТочкиМаршрута.ПеремещениеТоваров);
	ТочкиМаршрутаИсключения.Добавить(БизнесПроцессы.ЗаявкаПокупателя.ТочкиМаршрута.СборкаЗаказа);
	ТочкиМаршрутаИсключения.Добавить(БизнесПроцессы.ЗаявкаПокупателя.ТочкиМаршрута.ОтменаСборки);
	ТочкиМаршрутаИсключения.Добавить(БизнесПроцессы.ИнтернетЗаявка.ТочкиМаршрута.СборкаЗаказа);
	ТочкиМаршрутаИсключения.Добавить(БизнесПроцессы.ВнутренняяЗаявка.ТочкиМаршрута.СборкаЗаказа);
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЗапросЗадач <> Неопределено Тогда
		//ВоткнутьВЗапрос_РАЗРЕШЕННЫЕ_ВНачало(ЗапросЗадач);
		ЗапросЗадач.УстановитьПараметр("Ссылка", Документ);
		ЗапросЗадач.УстановитьПараметр("ТочкиМаршрутаИсключения", ТочкиМаршрутаИсключения);
		СвязанныеЗадачи.Загрузить(ЗапросЗадач.Выполнить().Выгрузить());
	КонецЕсли;
	
	Если ЗапросБП <> Неопределено Тогда
		//ВоткнутьВЗапрос_РАЗРЕШЕННЫЕ_ВНачало(ЗапросБП);
		ЗапросБП.УстановитьПараметр("Ссылка", Документ);
		Процессы.Загрузить(ЗапросБП.Выполнить().Выгрузить());
	КонецЕсли;
	
	Если ЗапросДок <> Неопределено Тогда
		//ВоткнутьВЗапрос_РАЗРЕШЕННЫЕ_ВНачало(ЗапросДок);
		ЗапросДок.УстановитьПараметр("Ссылка", Документ);
		СвязанныеДокументы.Загрузить(ЗапросДок.Выполнить().Выгрузить());
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры

&НаСервере
Процедура ВоткнутьВЗапрос_РАЗРЕШЕННЫЕ_ВНачало(Запрос)
	
	// Воткнем конструкцию по правам РАЗРЕШЕННЫЕ
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ" + Сред(Запрос.Текст, Найти(Запрос.Текст, "ВЫБРАТЬ") + 7);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТипДок = ТипЗнч(Параметры.Документ);
	
	Если 	ТипДок = Тип("БизнесПроцессСсылка.ЗаявкаПокупателя") Или
			ТипДок = Тип("БизнесПроцессСсылка.ВнутренняяЗаявка") Или 
			ТипДок = Тип("БизнесПроцессСсылка.ИнтернетЗаявка") Или 
			ТипДок = Тип("БизнесПроцессСсылка.СборкаЗаказа") Или
			ТипДок = Тип("ДокументСсылка.РеализацияТоваров") Или
			ТипДок = Тип("ДокументСсылка.ПередачаТовара") Тогда
			
		Документ = Параметры.Документ.Заказ;
		
	ИначеЕсли 	ТипДок = Тип("БизнесПроцессСсылка.РемонтИнструмента") Тогда

		Документ = ?(Параметры.Документ.ЗаказНаряд.Пустая(), Параметры.Документ, Параметры.Документ.ЗаказНаряд);
		
	ИначеЕсли
		  ТипДок = Тип("ДокументСсылка.Инвентаризация") И НЕ Параметры.Документ.Процесс.Пустая() Тогда
		  
		 Документ 	= Параметры.Документ.Процесс; 
	 ИначеЕсли 
		 ТипДок = Тип("БизнесПроцессСсылка.ЗакупкаИмпорт") Или
		 ТипДок = Тип("ДокументСсылка.ПоступлениеТоваров") Или
		 ТипДок = Тип("ДокументСсылка.РасчетСебестоимости") Тогда
		 
		 Документ = Параметры.Документ.Инвойс;
		 
	Иначе
		
		Документ 	= Параметры.Документ;
		
	КонецЕсли;
	
	Заголовок 	= "Связи: " + Документ;
	Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура Обновить1(Команда)
	
	Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура СвязанныеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.СвязанныеДокументы.ТекущиеДанные;
	ПоказатьЗначение(,ТекДанные.Документ);
	
	//ПравильныйВид = СтрЗаменить(ТекДанные.ВидДокумента, " ", "");
	//ОткрытьФорму("Документ." + ПравильныйВид + ".ФормаОбъекта", Новый Структура("Ключ", ТекДанные.Документ));
	
КонецПроцедуры
&НаКлиенте
Процедура ПроцессыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.Процессы.ТекущиеДанные;
	ОткрытьФорму("БизнесПроцесс." + ТекДанные.ВидПроцесса +".ФормаОбъекта", Новый Структура("Ключ", ТекДанные.Процесс));
	
КонецПроцедуры
&НаКлиенте
Процедура СвязанныеЗадачиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	ТекДанные = Элементы.СвязанныеЗадачи.ТекущиеДанные;
	ОткрытьФорму("Задача." + ТекДанные.ВидЗадачи +".ФормаОбъекта", Новый Структура("Ключ", ТекДанные.Задача));

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = СобытияСистемы.Событие_ЗаписанаЗадача() Тогда
		Обновить();
	КонецЕсли;
	
КонецПроцедуры


//&НаКлиенте
//Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
//	
//	Если ИмяСобытия = СобытияСистемы.Событие_ЗаписанаЗадача() И ТипЗнч(Документ) = Тип("БизнесПроцессСсылка.РемонтИнструмента") Тогда
//		
//		БизнесПроцессЗадачи = Неопределено;
//		Если Параметр.Свойство("БизнесПроцесс", БизнесПроцессЗадачи) Тогда
//						
//			Если БизнесПроцессЗадачи = Документ Тогда
//				
//				Обновить();
//				
//			КонецЕсли;
//		КонецЕсли;
//				
//	КонецЕсли;

//КонецПроцедуры

