
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ЭтоАдресВременногоХранилища(ДанныеЗаполнения) Тогда
		
		Массив = ПолучитьИзВременногоХранилища(ДанныеЗаполнения);
		Для Каждого Адресат Из Массив Цикл Адресация.Добавить().Адресат = Адресат КонецЦикла; 
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ПользователиИнтернет") Тогда
		
		Адресация.Добавить().Адресат = ДанныеЗаполнения; КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если Ответственный.Пустая() Тогда Ответственный = ПараметрыСеанса.ТекущийПользователь КонецЕсли;
	Если ДатаСоздания = '00010101' Тогда ДатаСоздания = ТекущаяДата() КонецЕсли;
	
	стрАдресаты = СтрСоединить(Адресация.ВыгрузитьКолонку("Адресат"), ";");
	
КонецПроцедуры
