
Функция ВходящееСообщениеpost(Запрос)
	
	Rest.ЛогЗапроса(Запрос,,РегистрыСведений.ЛогBotKot);
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	Если Запрос.ПараметрыURL["keyBot"] = BotKot.Ключ() Тогда
	
		Если BotKot.ПолученоВходящееСообщение(Запрос) Тогда
			Ответ.УстановитьТелоИзСтроки("ok");
		Иначе
			Ответ.УстановитьТелоИзСтроки("error");
			Ответ.КодСостояния = 500; КонецЕсли;
	Иначе
		
		Ответ.КодСостояния = 401;
		Ответ.УстановитьТелоИзСтроки("key error"); КонецЕсли;
	
	Rest.ЛогОтвета(Ответ,,РегистрыСведений.ЛогBotKot);
	
	Возврат Ответ;
	
КонецФункции

Функция ВходящееСообщениеget(Запрос)
	
	Rest.ЛогЗапроса(Запрос,,РегистрыСведений.ЛогBotKot);
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	Если Запрос.ПараметрыURL["keyBot"] = BotKot.Ключ() Тогда
		стрОшибки = "";
		Если BotKot.ПолученоВходящееСообщение(Запрос,  стрОшибки) Тогда
			Ответ.УстановитьТелоИзСтроки("ok");
		Иначе
			Ответ.УстановитьТелоИзСтроки("error: " + стрОшибки);
			Ответ.КодСостояния = 500;КонецЕсли;
	Иначе
		Ответ.УстановитьТелоИзСтроки("bot key not autorization");
		Ответ.КодСостояния = 401; КонецЕсли;
	
	Rest.ЛогОтвета(Ответ,,РегистрыСведений.ЛогBotKot);
	
	Возврат Ответ;
	
КонецФункции
