
&НаСервере
Функция ПолучитьСхемуНаСервере(БПСсылка, Заголовок)
	
	Заголовок = "Схема №" + БПСсылка.Номер + " от " + Формат(БПСсылка.Дата, "ДЛФ=DT");
	
	Возврат БПСсылка.ПолучитьОбъект().ПолучитьКартуМаршрута();
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Заголовок = "";
	Схема = ПолучитьСхемуНаСервере(ПараметрКоманды, Заголовок);
	
	ОткрытьФорму("ОбщаяФорма.СхемаБП", 
					Новый Структура("Схема, Заголовок", 
							Схема, Заголовок));
		
КонецПроцедуры
