

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для Каждого ТекСтрока Из Состав Цикл 
		Если ТекСтрока.Импорт И ТекСтрока.Растаможка = 0 Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "В строке " 
								+ Формат(ТекСтрока.НомерСтроки, "ЧГ=0") 
								+ " для импорта не указано количество дней растаможки";
			Сообщение.Поле = "Состав[" + Формат(ТекСтрока.НомерСтроки - 1, "ЧГ=0") + "].Растаможка";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
		КонецЕсли;
		
		Если ТекСтрока.Москва = 0 
				И ТекСтрока.Мурманск = 0 
				И ТекСтрока.НижнийНовгород = 0 
				И ТекСтрока.Новокузнецк = 0
				И ТекСтрока.СанктПетербург = 0
				И ТекСтрока.Хабаровск = 0 Тогда
			Отказ = Истина;
			Сообщить("Не указано количество дней поставки ни для одного филиала!");
		КонецЕсли;
		
		Если ТекСтрока.СпособДоставки <> Перечисления.ВариантДоставки.ДоставкаДоСкладаПоставщиком И не ЗначениеЗаполнено(ТекСтрока.ВремяЗабора) Тогда 
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "В строке " 
								+ Формат(ТекСтрока.НомерСтроки, "ЧГ=0") 
								+ " не указано время забора";
			Сообщение.Поле = "Состав[" + Формат(ТекСтрока.НомерСтроки - 1, "ЧГ=0") + "].ВремяЗабора";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ)
	
	Отказ = УжеЕстьЛогСпецификация();
	
	Если Отказ Тогда 
		Сообщить("Нельзя создавать более одной логистической спецификации!");
	КонецЕсли;
	
КонецПроцедуры

Функция УжеЕстьЛогСпецификация()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЛогистическиеСпецификации.Ссылка
	|ИЗ
	|	Справочник.ЛогистическиеСпецификации КАК ЛогистическиеСпецификации
	|ГДЕ
	|	НЕ ЛогистическиеСпецификации.ПометкаУдаления
	|	И ЛогистическиеСпецификации.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Результат = Запрос.Выполнить();
	
	Возврат Не Результат.Пустой();
	
КонецФункции

