
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДок = Новый ТабличныйДокумент;

	Печать(ТабДок, ПараметрКоманды);

	ФункцииФормДокументов.УстановитьНастройкиТабличногоДокумента(ТабДок);
	
	Если НЕ ЕстьЗащита() Тогда
		ТабДок.Защита = Ложь;
	    ТабДок.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
	ТабДок.Показать();
	
КонецПроцедуры

&НаСервере
Функция ЕстьЗащита()
	Возврат НЕ (РольДоступна("ПолныеПрава") ИЛИ РольДоступна("УправлятьЗаказНарядом"))
КонецФункции

&НаСервере
Процедура Печать(ТабДок, ПараметрКоманды)
	
	Инд = -1;
	Для Каждого Ссылка Из ПараметрКоманды Цикл Инд = Инд + 1;
		
		Если Инд Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		Заказ = Ссылка;
		Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.РеализацияТоваров") Тогда
			Заказ =  Ссылка.Заказ; КонецЕсли;
		
		Если ТипЗнч(Заказ) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
			Документы.ЗаказНаряд.Печать_ЗаказНаряд(ТабДок, Заказ) КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры