&НаСервере
Функция ПолучитьБПСборкаЗаказа(СсылкаЗадачи)
	
	Запрос = Новый Запрос(" 
	|ВЫБРАТЬ
	|	Ссылка
	|ИЗ
	|	БизнесПроцесс.СборкаЗаказа КАК БП
	|ГДЕ
	|	ВедущаяЗадача = &СсылкаЗадачи
	|");
	
	Запрос.УстановитьПараметр("СсылкаЗадачи", СсылкаЗадачи);
	РезультатЗапроса =  Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат БизнесПроцессы.СборкаЗаказа.ПустаяСсылка();
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
	 	Выборка.Следующий();
		Возврат Выборка.Ссылка;
	КонецЕсли;

КонецФункции

&НаСервере
Функция ПолучитьИмяФормыЗадачи(Ключ)
	
	МетаПроцесс = Объект.БизнесПроцесс.Метаданные();
	Ключ 		= Параметры.Ключ;
	
	Если МетаПроцесс.Имя = "ЗадачаРазработчику" Тогда
		
		Ключ = Параметры.Ключ.БизнесПроцесс;
		Возврат "БизнесПроцесс.ЗадачаРазработчику.Форма.ФормаВыполненияЗадачи";
		
	ИначеЕсли Объект.ТочкаМаршрута.Вид = ВидТочкиМаршрутаБизнесПроцесса.ВложенныйБизнесПроцесс Тогда
		
		Если Объект.ТочкаМаршрута.Имя = "СборкаЗаказа" Тогда 
			
			Ключ = ПолучитьБПСборкаЗаказа(Параметры.Ключ.Ссылка);
			Возврат "БизнесПроцесс." + Объект.ТочкаМаршрута.Имя + ".Форма.ФормаБизнесПроцесса";
			
			
		Иначе 
			
			// Найдем процесс
			
			
			Текст = "";
			
			Для Каждого МетаПроц ИЗ Метаданные.БизнесПроцессы Цикл
				
				Текст = Текст + ?(Текст = "","","ОБЪЕДИНИТЬ ВСЕ") + "
				|ВЫБРАТЬ """ + МетаПроц.Имя + """ ИмяПроцесса, Ссылка ИЗ БизнесПроцесс." + МетаПроц.Имя + " ГДЕ ВедущаяЗадача = &Задача
				|";
				
			КонецЦикла;
			
			Запрос = Новый Запрос(Текст);
			Запрос.УстановитьПараметр("Задача", Ключ);
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Если Выборка.Следующий() Тогда
				
				ИмяПроца 	= Выборка.ИмяПроцесса;
				Ключ		= Выборка.Ссылка;
				
			Иначе
				
				ИмяПроца = Объект.БизнесПроцесс.Метаданные().Имя;
				
			КонецЕсли;
			
			Возврат "БизнесПроцесс." + ИмяПроца + ".ФормаОбъекта";
			
		КонецЕсли;
		
	ИначеЕсли МетаПроцесс.Имя = "СогласованиеЗаказаПоставщику" Тогда 
		
		Ключ = Параметры.Ключ.Заказ;
		Возврат "Документ.ЗаказПоставщику.ФормаОбъекта";
		
	ИначеЕсли Объект.ТочкаМаршрута.Вид = ВидТочкиМаршрутаБизнесПроцесса.Действие Тогда
		
		// Отрежим цифру справа если она есть
		ИмяЗадачи = Объект.ТочкаМаршрута.Имя;
		
		// Отработаем исключения
		
		Если Найти(ИмяЗадачи, "СкорректироватьЗаказ") Тогда
			
			ИмяЗадачи = "СкорректироватьЗаказ";
			
		ИначеЕсли Прав(ИмяЗадачи, 1) = "1" Тогда
			
			ИмяЗадачи = Лев(ИмяЗадачи, СтрДлина(ИмяЗадачи) - 1);
			
		КонецЕсли;
		
		// Вернем имя
		
		Возврат "БизнесПроцесс." + МетаПроцесс.Имя + ".Форма.Задача_" + ИмяЗадачи;
		

	КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьПараметрыПродажиВРозницу()
	
	//Если 	Не Объект.Выполнена И
	//		Объект.ТочкаМаршрута = БизнесПроцессы.ПродажаВРозницу.ТочкиМаршрута.ЗакрытиеСмены Тогда
	//		
	//	Возврат Новый Структура("ИмяФормы, Параметры",
	//						"Документ.ЧекККМ.ФормаОбъекта", 
	//						Новый Структура("Процесс",Объект.БизнесПроцесс));
	//Иначе
							
		Возврат Новый Структура("ИмяФормы, Параметры",
							"БизнесПроцесс.ПродажаВРозницу.ФормаОбъекта", 
							Новый Структура("Ключ",Объект.БизнесПроцесс));
	//КонецЕсли;
	
КонецФункции

&НаСервере
Функция ПолучитьПараметрыДляИмпорта()
	
	Если Объект.ТочкаМаршрута = БизнесПроцессы.ЗакупкаИмпорт.ТочкиМаршрута.ЗаполнитьИнвойс Тогда
		Возврат Новый Структура ("ИмяФормы, Параметры", "Документ.Инвойс.Форма.ФормаДокументаБП", Новый Структура("Страница, Процесс, Ключ", 1, Объект.БизнесПроцесс, Объект.БизнесПроцесс.Инвойс));
	ИначеЕсли
		Объект.ТочкаМаршрута = БизнесПроцессы.ЗакупкаИмпорт.ТочкиМаршрута.ЗаполнитьПакингЛист Тогда
		Возврат Новый Структура ("ИмяФормы, Параметры", "Документ.Инвойс.Форма.ФормаДокументаБП", Новый Структура("Страница, Процесс, Ключ", 2, Объект.БизнесПроцесс, Объект.БизнесПроцесс.Инвойс));
	ИначеЕсли
		Объект.ТочкаМаршрута = БизнесПроцессы.ЗакупкаИмпорт.ТочкиМаршрута.РассчитатьСебестоимость Тогда
		Возврат Новый Структура ("ИмяФормы, Параметры", "Документ.РасчетСебестоимости.ФормаОбъекта", Новый Структура("Основание, Ключ", Объект.БизнесПроцесс.Инвойс, Объект.БизнесПроцесс.РасчетСебестоимости));
	ИначеЕсли
		Объект.ТочкаМаршрута = БизнесПроцессы.ЗакупкаИмпорт.ТочкиМаршрута.ОформитьПоступлениеТоваров Тогда
		Возврат Новый Структура ("ИмяФормы, Параметры", "Документ.ПоступлениеТоваров.ФормаОбъекта", Новый Структура("Основание, Ключ", Объект.БизнесПроцесс.Инвойс, Объект.БизнесПроцесс.ПоступлениеТоваров));
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Перем Ключ;
	
	Если Не НеОткрыватьДругуюФорму Тогда
		
		Отказ = Истина;
		
		Если ТипЗнч(Объект.БизнесПроцесс) = Тип("БизнесПроцессСсылка.ПродажаВРозницу") Тогда
			
			текПараметры = ПолучитьПараметрыПродажиВРозницу();
			ОткрытьФорму(текПараметры.ИмяФормы, текПараметры.Параметры, ВладелецФормы,,Окно);
		ИначеЕсли
			ТипЗнч(Объект.БизнесПроцесс) = Тип("БизнесПроцессСсылка.ЗакупкаИмпорт") Тогда
			текПараметры = ПолучитьПараметрыДляИмпорта();
			ОткрытьФорму(текПараметры.ИмяФормы,  текПараметры.Параметры, ВладелецФормы,, Окно);

		ИначеЕсли
			ТипЗнч(Объект.БизнесПроцесс) = Тип("БизнесПроцессСсылка.СогласованиеЗаказаПоставщику") Тогда
			
			ИмяОткрФормы = ПолучитьимяФормыЗадачи(Ключ);
		 	ОткрытьФорму(ИмяОткрФормы, Новый Структура("Ключ, Задача, Процесс, ТочкаМаршрута", Ключ, Объект.Ссылка, Объект.БизнесПроцесс, Объект.ТочкаМаршрута), ВладелецФормы,, Окно);
		Иначе	

			ИмяОткрФормы = ПолучитьимяФормыЗадачи(Ключ);
		 	ОткрытьФорму(ИмяОткрФормы, Новый Структура("Ключ", Ключ), ВладелецФормы,, Окно);
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НеОткрыватьДругуюФорму = ЭтаФОрма.Параметры.НеОткрыватьДругуюФорму = Истина;	
	
КонецПроцедуры
