
&НаСервере
Функция ПолучитьТекстОбъектов(НаборОбъектов)
	
	//СтруктураОбъектов = 
	//
	//Для Каждого Объект Из НаборОбъектов Цикл
	//	
	//	
	//	
	//КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
	//Текст = JS.ПолучитьСкриптДереваСтруктурыПоТексту(
	//
	//ПолучитьТекстОбъектов(ПараметрКоманды);
	//
	//Для Каждого Ссылка Из ПараметрКоманды Цикл
	//
	//	ПолучитьТабличныйДокумент(Ссылка).Показать("Сборочный лист");
	//	
	//КонецЦикла;
	//
	//HTML = Новый ФорматированныйДокумент;
	//HTML.УстановитьHTML(Текст);
	//
	//ИмяФайла = ПолучитьИмяВременногоФайла(".html");
	//
	//HTML.Записать(ИмяФайла);
	//
	//КомандаСистемы(ИмяФайла);
		
КонецПроцедуры
