Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
		
	Запрос = Новый Запрос(
	
	КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() + "
														
	|;
	|ВЫБРАТЬ
	|   &Период,
	|	&ВидДвижения,
	|	УстановкаЛимитов.Инициатор,
	|	УстановкаЛимитов.Сумма
	|ИЗ
	|	Документ.УстановкаЛимитов.Лимиты КАК УстановкаЛимитов
	|ГДЕ
	|   УстановкаЛимитов.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Приход);	
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("Период", Ссылка.Дата);
	
	Пакет = Запрос.ВыполнитьПакет();
		
	ДополнительныеСвойства.Вставить("ПараметрыСистемы", КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[0].Выгрузить()));
	ДополнительныеСвойства.Вставить("Лимиты", Пакет[1].Выгрузить());		
КонецПроцедуры
