

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Документы[Метаданные().Имя].ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	ПроведенияДокументов.ПровестиПоВсемРегистрам(Метаданные().Движения, ДополнительныеСвойства, Движения, Отказ);
	
	Движения.Записать();
	
	КонтрольПроведения.ПроверитьЛимиты(ЭтотОбъект, Лимиты.ВыгрузитьКолонку("Инициатор"), Отказ);
	
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Движения.Лимиты.Очистить();
	Движения.Записать();
	
	КонтрольПроведения.ПроверитьЛимиты(ЭтотОбъект, Лимиты.ВыгрузитьКолонку("Инициатор"), Отказ);
	
	
КонецПроцедуры

