
&НаКлиенте
Процедура Запомнить(Команда)
	ЗапомнитьЛиц();	
КонецПроцедуры

&НаСервере
Процедура ЗапомнитьЛиц()
	
	Набор = РегистрыСведений.ДоверенныеЛицаПользователя.СоздатьНаборЗаписей();
	Набор.Отбор.Пользователь.Установить(Пользователь);
	
	Набор.Прочитать();
	Набор.Очистить();
	
	Набор.Загрузить(ДовернныеЛица.Выгрузить());
	
	Набор.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЛиц()
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Пользователь,
	|	ДоверенноеЛицо,
	|	ВидитСписокМоихЗадач
	|ИЗ
	|	РегистрСведений.ДоверенныеЛицаПользователя
	|ГДЕ Пользователь = &Пользователь
	|");
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Рез = Запрос.Выполнить();
	
	Если НЕ Рез.Пустой() Тогда
		ДовернныеЛица.Загрузить(Рез.Выгрузить());
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Пользователь = ПараметрыСеанса.ТекущийПользователь;
	
	ЗаполнитьЛиц();
	
	Элементы.Пользователь.КнопкаВыбора = РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ПолныеПраваВОбласти");
	
КонецПроцедуры

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	ДовернныеЛица.Очистить();
	ЗаполнитьЛиц();
КонецПроцедуры

&НаКлиенте
Процедура ЗапомнитьИЗакрыть(Команда)
	ЗапомнитьЛиц();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ДоверенноеЛицоПриИзменении(Элемент)
	
КонецПроцедуры

&НаКлиенте
Процедура ДовернныеЛицаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	Если НоваяСтрока Тогда
		Элементы.ДовернныеЛица.ТекущиеДанные.Пользователь = Пользователь;
	КонецЕсли;
КонецПроцедуры
