
&НаКлиенте
Процедура ДополнительныеРеквизиты(Команда)
	
	ФункцииФормДокументов.ОткрытьОбщиеРеквизиты(ЭтаФорма);
	
КонецПроцедуры


&НаСервере
Функция ПолучитьОстатки(Кассы)
	
	Запрос = Новый Запрос(СтрШаблон("ВЫБРАТЬ Касса, СуммаОстаток Сумма ИЗ РегистрНакопления.ДенежныеСредства.Остатки(%1, Касса В(&Кассы))", ?(Объект.Ссылка.Пустая(), "","&Дата")));
	Запрос.УстановитьПараметр("Дата", 	Объект.Дата);
	Запрос.УстановитьПараметр("Кассы", 	Кассы);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

&НаСервере
Функция ПолучитьОстатокКассы(Касса)
	
	Ост = ПолучитьОстатки(Касса);
	текСтрока = Ост.Найти(Касса, "Касса");
	Возврат ?(текСтрока = Неопределено, 0, текСтрока.Сумма);
	
КонецФункции

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОстаткиКассы = ПолучитьОстатки(ТекущийОбъект.Состав.Выгрузить().ВыгрузитьКолонку("КассаСчет"));
	
	// Получим остатки
	
	Для КАждого Строка ИЗ Объект.Состав Цикл
		текСтрока = ОстаткиКассы.Найти(Строка.КассаСчет, "Касса");
		Если текСтрока <> Неопределено Тогда
			Строка.Остаток 		= текСтрока.Сумма; 
			Строка.Результат 	= текСтрока.Сумма + Строка.Сумма;  КонецЕсли; КонецЦикла;
	
КонецПроцедуры
&НаКлиенте
Процедура СоставПриИзменении(Элемент)
	
	текДанные = Элементы.Состав.ТекущиеДанные;
	Если текДанные <> Неопределено Тогда
		текДанные.Остаток 	= ПолучитьОстатокКассы(текДанные.КассаСчет); 
		текДанные.Результат = текДанные.Остаток + текДанные.Сумма; КонецЕсли;
	
КонецПроцедуры
