
Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт

	Запрос = Новый Запрос(
	
	КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() + "
	|;
	
	// УСТАНОВКА ЦЕН
	
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДатаОбнуления КАК Период,
	|	Номенклатура, Упаковка, ТипЦен
	|ИЗ
	|	Документ.ОбнулениеЦен.Товары Тов
	|
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Документ.ОбнулениеЦен.ТипыЦен Цены
	|ПО
	|	Тов.Ссылка = Цены.Ссылка
	|
	|ГДЕ
	|	Тов.Ссылка = &Ссылка
	|");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Пакет = Запрос.ВыполнитьПакет();
	
	ДополнительныеСвойства.Вставить("ЦеныНоменклатуры", Пакет[1].Выгрузить());
	
КонецПроцедуры
