
Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос(
	
	// ПАРАМЕТРЫ СИСТЕМЫ
	
	КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() + "
	|;
	
	// ШАПКА
	
	|ВЫБРАТЬ
	|	Заказ, Склад
	|ИЗ
	|	Документ.РазборочныйЛист
	|ГДЕ
	|	Ссылка = &Ссылка
	|;
	
	// ТОВАРЫ В ЯЧЕЙКАХ
	
	|ВЫБРАТЬ
	|	&Период 			Период, 
	|	&ВидДвиженияПриход  ВидДвижения,
	|	Номенклатура, 
	|	Ячейка , 
	|	Сборщик,
	|	Количество
	|ИЗ
	|	Документ.РазборочныйЛист.Товары
	|
	|ГДЕ	Ссылка = &Ссылка 
	|		И Ячейка <> &ПустаяЯчейка 
	|;
	

	// ТОВАРЫ СОБРАННЫЕ
	
	|ВЫБРАТЬ
	|	&Период				КАК Период,
	|	&ВидДвиженияРасход	КАК ВидДвижения,
	|	СборочныйЛист 		КАК СборочныйЛист,
	|	Ссылка.Склад		КАК Склад,
	|	Ссылка.Заказ		КАК Заказ,
	|	Номенклатура	    КАК Номенклатура,
	|	Упаковка			КАК Упаковка,
	|	Сборщик,
	|	Количество			Количество
	|ИЗ
	|	Документ.РазборочныйЛист.Товары
	|
	|ГДЕ
	|	Ссылка = &Ссылка И Количество > 0 
	|
	|;
	
	// РЕЗЕРВ ТОВАРОВ
	
	|ВЫБРАТЬ
	|	&Период				КАК Период,
	|	&ВидДвиженияРасход	КАК ВидДвижения,
	|	Ссылка.Склад		КАК Размещение,
	|	Ссылка.Заказ		КАК ДокументРезерва,
	|	Номенклатура	    КАК Номенклатура,
	|	Количество			КАК Количество
	|ИЗ
	|	Документ.РазборочныйЛист.Товары
	|
	|ГДЕ
	|	Ссылка = &Ссылка И Количество > 0
	|
	|
	|;
	
	// СБОРЩИК ТОВАРА
	
	|ВЫБРАТЬ
	|	&Период				КАК Период,
	|	Сборщик				КАК Сборщик,
	|	Ссылка.Заказ		КАК Заказ,
	|	СборочныйЛист 		КАК СборочныйЛист,
	|	Номенклатура		КАК Номенклатура,
	|	Упаковка			КАК Упаковка,
	|	Ссылка.Склад		КАК Склад,
	|   Ячейка,		
	|	Количество			КАК Количество
	|ИЗ
	|	Документ.РазборочныйЛист.Товары
	|
	|ГДЕ
	|	Ссылка = &Ссылка 
	|
	|;
	
	// Заказы на разборку
	
	|ВЫБРАТЬ
	|	&Период				КАК Период,
	|	&ВидДвиженияРасход	КАК ВидДвижения,
	|	СборочныйЛист 		КАК СборочныйЛист,
	|	Ссылка.Склад		КАК Склад,
	|	Ссылка.Заказ		КАК Заказ,
	|	Номенклатура	    КАК Номенклатура,
	|	Упаковка			КАК Упаковка,
	|	Сборщик,
	|	Количество			Количество
	|ИЗ
	|	Документ.РазборочныйЛист.Товары
	|
	|ГДЕ
	|	Ссылка = &Ссылка И Количество > 0 
	|
	|;
	
	
	|");
	
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("Период", 			Ссылка.Дата);
	Запрос.УстановитьПараметр("ВидДвиженияПриход", 	ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("ВидДвиженияРасход", 	ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("ПустаяЯчейка", 		Справочники.Ячейки.ПустаяСсылка());
	Запрос.УстановитьПараметр("ЯчейкаНеНайдено", 	Ссылка.Склад.ЯчейкаНеНайдено);
	Запрос.УстановитьПараметр("ПустаяУпаковка", 	Справочники.УпаковкиНоменклатуры.ПустаяСсылка());
	Запрос.УстановитьПараметр("ЗаказПотеряшек", 	Константы.ЗаказРезервПотеряшек.Получить());
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ДополнительныеСвойства.Вставить("ПараметрыСистемы", 		КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[0].Выгрузить()));
	ДополнительныеСвойства.Вставить("Шапка", 					КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[1].Выгрузить()));
	ДополнительныеСвойства.Вставить("ТоварыВЯчейках", 				Пакет[2].Выгрузить());
	ДополнительныеСвойства.Вставить("ТоварыСобранные", 				Пакет[3].Выгрузить());
	ДополнительныеСвойства.Вставить("ТоварыВРезерве", 				Пакет[4].Выгрузить());
	ДополнительныеСвойства.Вставить("СборщикЗаказа", 				Пакет[5].Выгрузить());
	ДополнительныеСвойства.Вставить("ЗаказыНаРазборку", 			Пакет[6].Выгрузить());
	
КонецПроцедуры

