

&НаСервере
Процедура ПроставитьЗначениИзПараметров(Имена, текПараметры)
	
	Имена = КонвертацияТипов.ПолучитьМассивИзСтроки(Имена);
	Для Каждого Имя Из Имена Цикл Если текПараметры.Свойство(Имя) И ЗначениеЗаполнено(текПараметры[Имя]) Тогда Запись[Имя] = текПараметры[Имя] КонецЕсли; КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПроставитьЗначениИзПараметров("СсылкаНаОбъект, Проект, ИмяРеквизита, НомерСтрокиОбъекта", Параметры);
	Заголовок = Запись.СсылкаНаОбъект;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Перем Текст, Вложения;
	
	ТекущийОбъект.Пользователь 	= ПараметрыСеанса.ТекущийПользователь;
	ТекущийОбъект.Период 		= ТекущаяДата();
	
	// Запихаем комментарий
	
	Комментарий.ПолучитьHTML(Текст, Вложения);
	
	ТекущийОбъект.Комментарий	= Текст;
	ТекущийОбъект.Вложения		= Новый ХранилищеЗначения(Вложения);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОповеститьОЗаписиНового(Запись.СсылкаНаОбъект);
	
КонецПроцедуры
