
Функция ИницилизироватьСохранение(Форма, ИмяОбъект = "Объект") Экспорт
	
	// Иницилизирует автосохранение а также проверяет были ли в прошлом сохранения этой формы
	//
	// Возвращает 	ИСТИНА если были востановлены прошлые данные,
	//			 	ЛОЖЬ в остальных случаях
	
	ПроизошлоВостановление = Ложь;
	Ссылка = Форма[ИмяОбъект].Ссылка;
	
	// Для начала проверим возможно уже у нас есть автосохранение атой формы в базе и его надо загрузить в документ
	
	Если АвтосохранениеСервер.ЕстьДамп(Ссылка, Форма.ИмяФормы) Тогда
		
		 ПроизошлоВостановление = Вопрос("Обнаружено некорректное закрытие формы,
						|попытаться востановить автоматически сохраненные данные формы?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да КонецЕсли;
		
	// Запускаем обработчик сохранения хлама формы
	
	Интервал = АвтосохранениеСервер.ПолучитьИнтервал();
	Если Интервал Тогда 
		Форма.ПодключитьОбработчикОжидания("Автосохранение", Интервал); КонецЕсли;
		//Если Не Ссылка.Пустая() Тогда 
		//	ПоказатьОповещениеПользователя("Автосохранение каждые " + Интервал + "(сек)", ПолучитьНавигационнуюСсылку(Ссылка), Строка(Ссылка), БиблиотекаКартинок.Сохранить); КонецЕсли; КонецЕсли;
	
	Возврат ПроизошлоВостановление;
	
КонецФункции

Процедура ПроизошлоАвтосохранение(СохранениеПроизошло, ЕстьДамп, Ссылка) Экспорт
	
	Если СохранениеПроизошло И Не ЕстьДамп Тогда
		ПоказатьОповещениеПользователя("Автосохранение запущено", ПолучитьНавигационнуюСсылку(Ссылка), ?(Ссылка.Пустая(),"новый документ", Строка(Ссылка)), БиблиотекаКартинок.Сохранить) КонецЕсли;
		
КонецПроцедуры

Процедура ОткрываетсяПодбор(ПараметрыПодбора, Ссылка, Форма, Дамп) Экспорт
	
	// Добавим дамп
	
	ПараметрыПодбора.Вставить("АвтосохранениеДамп", Дамп);
	ПараметрыПодбора.Вставить("ДокументСсылка", 	Ссылка);
	ПараметрыПодбора.Вставить("ИмяФормы", 			Форма.ИмяФормы);
	
	// Отключим обработчик, т.к. 
	
	Форма.ОтключитьОбработчикОжидания("Автосохранение");
	
КонецПроцедуры
Процедура ЗакрытПодбор(Форма) Экспорт
	
	// Заного запускаем обработчик
	
	Интервал = АвтосохранениеСервер.ПолучитьИнтервал();
	
	Если Интервал Тогда // подключим
		
		// Подключим обработчик
		
		Форма.ПодключитьОбработчикОжидания("Автосохранение", Интервал) КонецЕсли;
	
КонецПроцедуры
