&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ТабДок = Новый ТабличныйДокумент;
	Печать(ТабДок, ПараметрКоманды);

	ФункцииФормДокументов.УстановитьНастройкиТабличногоДокумента(ТабДок);
	
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Истина;
	//ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабДок.АвтоМасштаб = Истина;
	
	ТабДок.Показать();

КонецПроцедуры

&НаСервере
Процедура Печать(ТабДок, ПараметрКоманды)
	СоСрокомДоставки = Истина;
	Инд = -1;
	Для Каждого Ссылка Из ПараметрКоманды Цикл Инд = Инд + 1;
		
		Если Инд Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		  
		Если ТипЗнч(Ссылка) = Тип("БизнесПроцессСсылка.ЗаявкаПокупателя") Тогда
			Документы.ЗаказПокупателя.Печать_СчетЗаказ(ТабДок, Ссылка.Заказ, "Заказ",,,, СоСрокомДоставки);
		ИначеЕсли
			ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			Документы.ЗаказПокупателя.Печать_СчетЗаказ(ТабДок, Ссылка, "Заказ",,,, СоСрокомДоставки);
		ИначеЕсли
			ТипЗнч(Ссылка) = Тип("ДокументСсылка.ИнтернетЗаказПокупателя") Тогда
			Документы.ЗаказПокупателя.Печать_СчетЗаказ(ТабДок, Ссылка, "Заказ",,,,СоСрокомДоставки, "ИнтернетЗаказПокупателя");
		ИначеЕсли
			ТипЗнч(Ссылка) = Тип("БизнесПроцессСсылка.ИнтернетЗаявка") Тогда
			Документы.ЗаказПокупателя.Печать_СчетЗаказ(ТабДок, Ссылка.Заказ, "Заказ",,,,СоСрокомДоставки, "ИнтернетЗаказПокупателя");
        КонецЕсли;

		
	КонецЦикла;
		
КонецПроцедуры