
&НаСервере
// Функция проверяет является ли партнер группой.
//
// Параметры:
//	Партнер - СправочникСсылка.Партнеры - Партнер
//
// Возвращаемое значение:
//	Булево - Признак что партнер является группой
//
Функция ЭтоГруппаПартнеров(Партнер)
	
	//Возврат Партнер.ЭтоГруппа;
	
КонецФункции // ЭтоГруппаПартнеров

&НаСервере
Функция ПолучитьПартнераИзСсылки(Ссылка)
	
	МетаДок = Ссылка.Метаданные();
	
	Запрос = Новый Запрос("ВЫБРАТЬ Партнер ИЗ Документ." + МетаДок.Имя + " ГДЕ Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Партнер;
		
	Иначе
		
		Возврат Справочники.Партнеры.ПустаяСсылка();
		
	КонецЕсли;
	
КонецФункции
&НаКлиенте
// Процедура - обработчик события "ОбработкаКоманды".
//
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Партнер = ПолучитьПартнераИзСсылки(ПараметрКоманды);
	//КонецЕсли;
	
	ОткрытьФорму(	"ОбщаяФорма.НастроенныйОтчет",
					Новый Структура("ИмяОтчета, ИмяМакета, Отборы, ЗаголовокОкна",
						"РасчетыСПартнерами",
						"ОсновнаяСхемаКомпоновкиДанных",
						Новый Структура("Партнер", 
											Партнер),
						"Движения товара"),
					ПараметрыВыполненияКоманды.Источник,
					ПараметрыВыполненияКоманды.Уникальность,
					ПараметрыВыполненияКоманды.Окно);
	
	//ПараметрыФормы = Новый Структура("Отбор, ФиксированныеНастройки, КлючНазначенияИспользования, КлючВарианта, СформироватьПриОткрытии");
	//ПараметрыФормы.СформироватьПриОткрытии = Истина;
	//
	//Если ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
	//	ПараметрыФормы.Отбор = Новый Структура("Заказ", ПараметрКоманды);
	//	ПараметрыФормы.КлючНазначенияИспользования = "ЗаказКлиента";
	//	ПараметрыФормы.КлючВарианта = "РасчетыСКлиентами";
	//	
	//ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
	//	ПараметрыФормы.Отбор = Новый Структура("Заказ", ПараметрКоманды);
	//	ПараметрыФормы.КлючНазначенияИспользования = "ЗаказПоставщику";
	//	ПараметрыФормы.КлючВарианта = "РасчетыСПоставщиками";
	//	
	//ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Контрагенты") Тогда
	//	ПараметрыФормы.Отбор = Новый Структура("Контрагент", ПараметрКоманды);
	//	ПараметрыФормы.КлючНазначенияИспользования = "Контрагент";
	//	ПараметрыФормы.КлючВарианта = "РасчетыСПартнерами";
	//	
	//ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Партнеры") Тогда
	//	
	//	Если ЭтоГруппаПартнеров(ПараметрКоманды) Тогда
	//		ФиксированныеНастройки = Новый НастройкиКомпоновкиДанных();
	//		ЭлементОтбора = ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//		ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Партнер");
	//		ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВИерархии;
	//		ЭлементОтбора.ПравоеЗначение = ПараметрКоманды;
	//		ПараметрыФормы.ФиксированныеНастройки = ФиксированныеНастройки;
	//		ПараметрыФормы.КлючНазначенияИспользования = "ГруппаПартнеров";
	//		
	//	Иначе
	//		ПараметрыФормы.Отбор = Новый Структура("Партнер", ПараметрКоманды);
	//		ПараметрыФормы.КлючНазначенияИспользования = "Партнер";
	//		
	//	КонецЕсли;
	//		
	//	ПараметрыФормы.КлючВарианта = "РасчетыСПартнерами";
	//	
	//ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.СегментыПартнеров") Тогда
	//	
	//	МассивПартнеров = СегментыСервер.ПолучитьМассивЭлементов(ПараметрКоманды);
	//	
	//	ФиксированныеНастройки = Новый НастройкиКомпоновкиДанных();
	//	ЭлементОтбора = ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Партнер");
	//	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
	//	
	//	СписокПартнеров = Новый СписокЗначений;
	//	СписокПартнеров.ЗагрузитьЗначения(МассивПартнеров);
	//	
	//	ЭлементОтбора.ПравоеЗначение = СписокПартнеров;
	//	ПараметрыФормы.ФиксированныеНастройки = ФиксированныеНастройки;
	//	
	//	ПараметрыФормы.КлючНазначенияИспользования = "СегментПартнеров";
	//	ПараметрыФормы.КлючВарианта = "РасчетыСПартнерами";
	//	
	//КонецЕсли;
	//	
	//ОткрытьФорму("Отчет.РасчетыСПартнерами.Форма",
	//	ПараметрыФормы,
	//	ПараметрыВыполненияКоманды.Источник,
	//	ПараметрыВыполненияКоманды.Уникальность,
	//	ПараметрыВыполненияКоманды.Окно
	//);
	
КонецПроцедуры // ОбработкаКоманды()
