
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
			////СКД=ПолучитьМакет("СхемаМенеджера"); 
			////Настройки = ; 
			////
			//
			//СхемаКомпоновкиДанных = Отчеты.ОстаткиЯчеек.ПолучитьМакет("ДвижениеПоЯчейкам");
			//
			////Отчет.КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(Схема));
			////Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Схема.НастройкиПоУмолчанию);
			//
			////КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных; 
			////МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, Настройки, ДанныеРасшифровки); 
			////
			////Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(
			////	.ВариантыНастроек[0]);
			//
			// //Из схемы возьмем настройки по умолчанию
			//Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;

			////Помещаем в переменную данные о расшифровке данных
			////ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;

			////Формируем макет, с помощью компоновщика макета
			//КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

			////Передаем в макет компоновки схему, настройки и данные расшифровки
			////МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,Настройки, ДанныеРасшифровки);
			//МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных);

			////Выполним компоновку с помощью процессора компоновки
			//ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
			////ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,ДанныеРасшифровки);
			//ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);

			////Очищаем поле табличного документа
			////Результат = ЭлементыФормы.Результат;
			////Результат.Очистить();

			////Выводим результат в табличный документ
			//ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
			//ПроцессорВывода.УстановитьДокумент(Результат);

			//ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
			
	//Получаем схему из макета
	СхемаКомпоновкиДанных = Отчеты.ОстаткиЯчеек.ПолучитьМакет("ДвижениеПоЯчейкам");

	//Из схемы возьмем настройки по умолчанию
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;

	//Помещаем в переменную данные о расшифровке данных
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;

	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,ДанныеРасшифровки);
	
	//Очищаем поле табличного документа
	//Результат = ЭлементыФормы.Результат;
	Результат.Очистить();

	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(Результат);

	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
			
КонецПроцедуры
