
Функция ПолучитьТекстПомощиРедактированияВыражения()
	
	Возврат "
	| ТаблицаДанных 	- таблица с данными MySQL
	| ТаблицаПоиска 	- таблица значений с загруженными до данного поля, реквизитами поиска
	|			- ИмяПоля	- имя поля в MySQL в которое передается значение
	|			- Значение	- выражение на языке MySQL с соблюдением синтаксиса MySQL
	| ТаблицаПолей 		- таблица значений с загруженными до данного поля, значниями полей
	|			- ИмяПоля	- имя поля в MySQL по которому осуществляется поиск
	|			- Значение	- выражение на языке MySQL с соблюдением синтаксиса MySQL для 
	|							определения значения поиска
	| Выборка			- выборка запроса с данными 1С
	| Действие 	- строка (только чтение), производимое действие над базой SQL, может принимать
	|				следующие значения:
	|					- UPDATE, INSERT, DELETE
	| стрОшибки - текст который рекомендуеться заполнить если произойдет ошибка
	|
	|	Для того чтобы вставить новые значения в таблицу полей нужно добавить
	|в ТаблицуПолей строку и присвоить им значения
	|
	|";
	
КонецФункции

&НаКлиенте
Процедура ОписаниеСтрокТипОбъектаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОтборМетаданных = Новый СписокЗначений;
	ОтборМетаданных.Добавить("Справочники");
	
	ДанныеВыбора = ОткрытьФорму("ОбщаяФорма.ВыборОбъектовМетаданных", 
	                  Новый Структура("ВыбранныеМетаданные, УникальныйИдентификаторИсточник", ОтборМетаданных , УникальныйИдентификатор));
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОбъектаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОтборМетаданных = Новый СписокЗначений;
	ОтборМетаданных.Добавить("Справочники");
	ОтборМетаданных.Добавить("Документы");
	ОтборМетаданных.Добавить("РегистрыСведений");
	
	ОткрытьФорму("ОбщаяФорма.ВыборОбъектовМетаданных", 
	                  Новый Структура("ВыбранныеМетаданные, УникальныйИдентификаторИсточник", ОтборМетаданных , УникальныйИдентификатор), Элемент);
		
КонецПроцедуры

&НаКлиенте
Процедура ВидОбъектаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если 	ТипЗнч(ВыбранноеЗначение) = Тип("СписокЗначений") И
			ВыбранноеЗначение.Количество() Тогда
			
		Объект.ВидОбъекта = ВыбранноеЗначение[0].Значение;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСтруктуру(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ВыражениеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.ОписаниеСтрок.ТекущиеДанные;
	
	ОткрытьФорму("ОбщаяФорма.РедактированияВыражения", 
	                  Новый Структура("Выражение, ТекстПомощи", 
					  	 ТекДанные.Выражение, 
						 ПолучитьТекстПомощиРедактированияВыражения()), 
					Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыражениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если 	ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда
		
		ТекДанные = Элементы.ОписаниеСтрок.ТекущиеДанные;
		ТекДанные.Выражение = ВыбранноеЗначение;
		
	КонецЕсли;
	
КонецПроцедуры
