
//&НаКлиенте
//Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
//	
//	Перем ДокСсылка;
//	
//	СписокМашин = ЗагрузкаВАвтомобильЗаказов.ПолучитьСписокАвтомобилейДляЗагрузки();
//	ВыбрЭлемент = СписокМашин.ВыбратьЭлемент("Кого отправляем?");
//	
//	Если ВыбрЭлемент <> Неопределено Тогда стрСообщения = "";
//		Если ЗагрузкаВАвтомобильЗаказов.ОчиститьМашину(ВыбрЭлемент.Значение, Истина, ДокСсылка) Тогда
//			
//			СобытияСистемы.ОповеститьОИзмененииЗагрузкиАвтомобиля(ВыбрЭлемент.Значение);
//			ПоказатьОповещениеПользователя("Заказы отправлены", ПолучитьНавигационнуюСсылку(ДокСсылка), ВыбрЭлемент.Значение, БиблиотекаКартинок.ЗагрузкаЗаказа_Отправка) КонецЕсли;КонецЕсли;
//	
//КонецПроцедуры


&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	СписокМашин = ЗагрузкаВАвтомобильЗаказов.ПолучитьСписокАвтомобилейДляЗагрузки();
	СписокМашин.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ПослеВыбораЭлемента", ЭтотОбъект, ПараметрКоманды),"Кого отправляем?");
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЭлемента(ВыбранныйЭлемент, СписокПараметров) Экспорт
	Перем ДокСсылка;
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Если ЗагрузкаВАвтомобильЗаказов.ОчиститьМашину(ВыбранныйЭлемент.Значение, Истина, ДокСсылка) Тогда
		СобытияСистемы.ОповеститьОИзмененииЗагрузкиАвтомобиля(ВыбранныйЭлемент.Значение);
		ПоказатьОповещениеПользователя("Заказы отправлены", ПолучитьНавигационнуюСсылку(ДокСсылка), ВыбранныйЭлемент.Значение, БиблиотекаКартинок.ЗагрузкаЗаказа_Отправка);
	КонецЕсли;
КонецПроцедуры
