
&НаКлиенте
Процедура ДополнительныеРеквизиты(Команда)
		ФункцииФормДокументов.ОткрытьОбщиеРеквизиты(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьРасшифровкуСуммы(Команда)
	ЗаполнитьРасшифровкуСуммыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасшифровкуСуммыНаСервере()
	
	Объект.РасшифровкаСуммы.Загрузить(Документы.ОплатаИмпорт.ЗаполнитьРасшифровкуСуммы(Объект.Дата, Объект.Сумма, Объект.СуммаУпр));		
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОплатыВручнуюНаСервере(стрВозврТабл)
	
	Объект.РасшифровкаСуммы.Очистить();
	Объект.РасшифровкаСуммы.Загрузить(ЗначениеИзСтрокиВнутр(стрВозврТабл));
	Коэффициент = Объект.СуммаУпр/Объект.Сумма; 
	Для Каждого Строка Из Объект.РасшифровкаСуммы Цикл
		Строка.СуммаУпр = Коэффициент*Строка.Сумма; КонецЦикла; 	
	
КонецПроцедуры
&НаКлиенте
Процедура ЗаполнитьВручную(Команда)
	

	стрВозврТабл = ОткрытьФорму("Документ.ОплатаИмпорт.Форма.ФормаЗаполненияРасшифровки", 
			Новый Структура("ДокументОплаты, Сумма", 
					Объект.Ссылка, 
					Объект.Сумма),,,,,Новый ОписаниеОповещения("ОбработкаЗаполненияВручную",ЭтаФОрма,));

КонецПроцедуры
&НаКлиенте
Процедура ОбработкаЗаполненияВручную(Результат, Параметры) Экспорт
	Если Результат <> Неопределено Тогда
		ЗаполнитьОплатыВручнуюНаСервере(Результат);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура РасшифровкаСуммыСуммаПриИзменении(Элемент)
	ТекДанные = Элементы.РасшифровкаСуммы.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		текДанные.СуммаУпр = текДанные.Сумма*Объект.СуммаУпр/Объект.Сумма; КонецЕсли; 
КонецПроцедуры
