//СИНТАКСИС
//        daСклонение(Выражение, Падеж, Род, Режим, ФорматнаяСтрока);
//            Выражение      - склоняемое выражение
//            Падеж          - падеж склонения, буква или цифра: "И" = 1, "Р" = 2, "В" = 3, "Д" = 4, "Т" = 5, "П" = 6
//            Род          - род склоняемого выражения, буква или цифра: "М" = 1, "Ж" = 2, "С" = 3, "Н" = 4
//            Режим         - режим работы функции, определяется типом склоняемого выражения
//            ФорматнаяСтрока - определяет формат и регистр выводимого результата
//
//СКЛОНЕНИЕ ФИО
//запуск выполняется в режиме "ФИО" или с пустым режимом, в таком случае - режим "ФИО" установится по умолчанию:
//        daСклонение("Пухов Федор Николаевич", "Р", "М", "ФИО")    = "Пухова Федора Николаевича"
//        daСклонение("Пухова Ольга Сергеевна", "Д")                 = "Пуховой Ольге Сергеевне"
//порядок символов "Ф", "И", "О" в параметре режима определяет порядок частей ФИО в склоняемом выражении, т.к. фамилия, имя и отчество склоняются по разным правилам
//        daСклонение("Мария Ивановна Кожедуб", "Т", , "ИОФ")     = "Марией Ивановной Кожедуб"
//        daСклонение("В. Тёркин", "П", , "ИФ")                     = "В. Тёркине"
//        daСклонение("Тихончук", "Р", "Ж", "Ф")                     = "Тихончук"
//форматная строка может содержать ключевые слова "Фамилия", "Имя", "Отчество" или сокращения "Ф", "И", "О", их регистр определяет регистр выводимого результата
//        daСклонение("Чапаев Василий Иванович", "Р", , , "Имя Отчество Фамилия")     = "Василия Ивановича Чапаева"
//        daСклонение("Чапаев Василий Иванович", "Д", , , "Фамилия И. О.")             = "Чапаеву В. И."
//        daСклонение("Чапаев Василий Иванович", "И", , , "отчество: Имя - ФАМИЛИЯ")     = "иванович: Василий - ЧАПАЕВ"
//
//ОПРЕДЕЛЕНИЕ РОДА
//если с параметром Род передать переменную со значением "?", в нее вернется род в случае успеха или останется "?" в случае неудачи
//        ПоискРода = "?"; Результат = daСклонение("Лукашенко Александр Григорьевич", "Р", ПоискРода); Сообщить(ПоискРода); //"М"
//        ПоискРода = "?"; Результат = daСклонение("Лукашенко А. Г.", "Р", ПоискРода); Сообщить(ПоискРода); //"?"
//
//СКЛОНЕНИЕ ПРОФЕССИЙ
//запуск выполняется в режиме "Д":
//        daСклонение("Ведущий программист 1С и консультант по ЗиК", "Р", , "Д") = "Ведущего программиста 1С и консультанта по ЗиК"
//в этом и остальных режимах форматная строка определяет регистр слов результата и задается при помощи литер, если литера не задана - остается исходный регистр,
//А - первая буква первого слова, Б - первая буква остальных слов, В - все остальные буквы всех слов, Г - специально для аббревиатур:
//        daСклонение("Ведущий программист 1С и Консультант по ЗиК", "Р", , "Д", "АБВГ")     = "ВЕДУЩЕГО ПРОГРАММИСТА 1С И КОНСУЛЬТАНТА ПО ЗИК"
//        daСклонение("Ведущий программист 1С и Консультант по ЗиК", "Р", , "Д", "абвг")     = "ведущего программиста 1с и консультанта по зик"
//        daСклонение("Ведущий программист 1С и Консультант по ЗиК", "Р", , "Д", "АБ")     = "Ведущего Программиста 1С и Консультанта По ЗиК"
//        daСклонение("Ведущий программист 1С и Консультант по ЗиК", "Р", , "Д", "Абв")     = "Ведущего программиста 1С и консультанта по ЗиК"
//
//СКЛОНЕНИЕ СУЩЕСТВИТЕЛЬНЫХ, ПРИЛАГАТЕЛЬНЫХ, ГЛАГОЛОВ, ГЕОГРАФИЧЕСКИХ НАИМЕНОВАНИЙ
//запуск выполняется в режиме "В":
//        daСклонение("Генеральная доверенность", "Р", , "В")            = "Генеральной доверенности"
//        daСклонение("Санкт-Петербург", "П", , "В")                    = "Санкт-Петербурге"
//в этом режиме возможно склонение в форме множественного числа, для этого в параметре Род указывается "Н" (мНожественный):
//        daСклонение("Устав", "И", "Н", "В")                            = "Уставы"
//        daСклонение("Генеральная доверенность", "Р", "Н", "В")        = "Генеральных доверенностей"
//возможно склонение глаголов по родам и по числам, исходный глагол может быть в форме любого рода и числа, но в настоящем времени:
//        daСклонение("Подготовили", "И", "Ж", "В")                    = "Подготовила"
//        daСклонение("Утвердило ответственное лицо", "И", "Н", "В")    = "Утвердили ответственные лица"
//
//СКЛОНЕНИЕ ЧИСЕЛ, ВАЛЮТ, ЕДИНИЦ ИЗМЕРЕНИЯ
//запуск выполняется в режиме "Ч", возможно склонение по родам:
//        daСклонение("Двадцать один", "И", "С", "Ч")                = "Двадцать одно"
//        daСклонение("Двадцать один", "Р", "Ж", "Ч")                = "Двадцати одной"
//параметр Выражение может иметь тип "Число":
//        daСклонение(21, "И", "С", "Ч")                            = "Двадцать одно"
//        daСклонение(21, "Р", "Ж", "Ч")                            = "Двадцати одной"
//возможно склонение сочетания числа и исчислимого (валюты, единицы измерения, прочих существительных)
//        daСклонение("32 доска", "Р", , "Ч")                        = "Тридцати двух досок"
//исчислимое должно быть в начальной форме (именительный падеж, единственное число):
//        daСклонение("23 австралийский доллар", "Р", , "Ч")        = "Двадцати трех австралийских долларов"
//исключение для популярных валют, они могут быть в формате встроенной функции ЧислоПрописью()- "5 рублей", "13 долларов"):
//        daСклонение("14 рублей 88 копеек", "Р", , "Ч", "абв")    = "четырнадцати рублей восьмидесяти восьми копеек"
//если перед словом поставить символ "\", данное слово не будет изменено:
//        daСклонение("51 рубль \81 копейка", "Р", , "Ч")            = "Пятидесяти одного рубля 81 копейки"
//если перед числом поставить символ "^", данное слово будет склоняться без преобразования в пропись:
//        daСклонение("^25 страница", "П", , "Ч")                    = "25-ти страницах"
//для получения формы винительного падежа одушевленных существительных, используется специальный падеж "О" (винительный Одушевленный):
//        daСклонение("41 мешок", "В", , "Ч")                        = "Сорок один мешок"
//        daСклонение("41 маляр", "О", , "Ч")                        = "Сорок одного маляра"
//
Функция daСклонение(Выражение, Падеж = "И", Род = "", Режим = "ФИО", ФорматнаяСтрока = "") Экспорт
	
	Если Падеж = "Р" или Падеж = 2 Тогда
		ИсключениеСклонения = ПроверитьИсключенияСклоненийПоПадежам(Выражение);
		Если ИсключениеСклонения <> Неопределено Тогда
			Возврат ИсключениеСклонения;			
		КонецЕсли;		
	КонецЕсли;	
	
    Версия = "17.06.2015";
    
    //ТАБЛИЦЫ ПРАВИЛ СКЛОНЕНИЯ
    //в колонке "Окончания" указывается перечень окончаний, для которых действует данное правило, разделитель "/", в конце также ставится разделитель
    //алгоритм ищет строки с окончаниями последовательно, при совпадении останавливается, поэтому более узкое правило ("РВИН") должно следовать выше, чем широкое ("ИН")
    //если окончание не найдено в таблице правил - такое слово не склоняется
    //колонка "Обрезка" определяет, сколько символов с конца слова обрезать, перед добавлением окончания из колонки падежа ("Р", "Д", "В", "Т", "П")
    ПравилаФ = //Фамилия
    //Род;    Окончания;                                            Обрезка;    Р;        Д;        В;        Т;        П;        Комментарий   
    //символ "*" перед окончанием означает, что данное окончание сравнивается не с концом слова, а с целым словом ("*ГРИН" сработает только на Грин, а "ГРИН" - и на "Грин", и на "Багрин")
    "М-;    *ГРИН/*ЧАПЛИН/РВИН/*БИН/;                            0;            а;        у;        а;        ом;        е;        Грин, Дарвин, Чаплин - исключения, чтобы пройти тест gramota.ru )
    //в колонке "Род" указывается один литерал рода ("М", "Ж", "С"), если окончание позволяет однозначно определить род ("Петров" - "М", "Ильина" - "Ж")
    |Ж;        ЕВА/ЁВА/ИНА/ОВА/ЫНА/;                                1;            ой;        ой;        у;        ой;        ой;
    |М;        ЕВ/ЁВ/ИН/ОВ/ЫН/;                                    0;            а;        у;        а;        ым;        е;
    |М;        ЧИЙ/ШИЙ/ЩИЙ/;                                        2;            его;    ему;    его;    им;        ем;        Осадчий, Старший, Вещий
    |Ж;        ЧАЯ/ШАЯ/ЩАЯ/;                                        2;            ей;        ей;        ую;        ей;        ей;     Осадчая, Старшая, Вещая
    |Ж;        АЯ/;                                                2;            ой;        ой;        ую;        ой;        ой;     Крутая
    |Ж;        ЯЯ/;                                                2;            ей;        ей;        юю;        ей;        ей;     Верхняя
    //"М-" в колонке "Род" означает, что по окончанию род не определить, но правило действует  только для рода "М" ("Воробей" склоняется только для "М", для "Ж" - не склоняется)
    |М-;    *ВОРОБЕЙ/*СОЛОВЕЙ/;                                    2;            ья;        ью;        ья;        ьем;    ье;        Воробей, Соловей
    |М-;    *ЛЕВ/;                                                2;            ьва;    ьву;    ьва;    ьвом;    ьве;    Лев
    |М-;    *КИЙ/*БОКИЙ/;                                        1;            я;        ю;        я;        ем;        е;        Кий
    |М-;    ЦОЙ/ВИЙ/СОЙ/ЕЙ/АЙ/УЙ/;                                1;            я;        ю;        я;        ем;        е;        Цой, Гелетей, Лузай
    |М;        ГОЙ/КОЙ/ХОЙ/ШОЙ/;                                    2;            ого;    ому;    ого;    им;        ом;     Плохой, Большой
    |М;        ЧОЙ/ЩОЙ/;                                            2;            его;    ему;    его;    им;        ом;     
    |М;        ОЙ/ЫЙ/;                                                2;            ого;    ому;    ого;    ым;        ом;     Крутой, Мудрый
    |М;        ГИЙ/КИЙ/;                                            2;            ого;    ому;    ого;    им;        ом;
    |М-;    ИЙ/;                                                1;            я;        ю;        я;        ем;        и;        Шарий
    |М-;    КАШ/;                                                0;            а;        у;        а;        ом;        е;      Лукаш
    |М-;    ЬМИЧ/;                                                0;            а;        у;        а;        ом;        е;      Кузьмич
    |М-;    ИЧ/Ш/;                                                0;            а;        у;        а;        ем;        е;      Митрич, Гаспажиньш, Милош, Хараш, Черныш
    |М-;    АК/АН/ЕР/ИР/ЙН/НГ/ОН/ОР/УК/ЯК/ЯН/БИХ/РИХ/;            0;            а;        у;        а;      ом;     е;                   
    //колонка "Род" пустая, если по окончанию род не определить, но правило склонения одинаковое для "М" и "Ж ("Живаго", "Лисица")
    |;        АГО/ИА/НКО/ОВО/ОТО/ЦКО/ЫХ/ЮДО/ОЛЯ/ЬДА/ИХ/ЫХ/УА/;    0;            ;        ;        ;          ;         ;                   
    //символ "+" перед окончанием означает, что данное правило действует для не последней части составного слова (в "Абдул-Шах" часть "Абдул" не склоняется, а если "Абдул" - отдельное слово, то склоняется)
    |;        +ВАН/+АБДУЛ/+БЕЛИЦ/+ГАСАН/+ДЮССАР/+ДЮМОН/+КНИППЕР/+КОРВИН/  0;    ;        ;        ;          ;         ;        
    |;        +КАРА/+САЕД/+БОНЧ/+ШОЛОМ/+ПРИЗВАН/+МЕЛИК/*ТЕР/*ВАР/*ФОН/;    0;    ;        ;        ;          ;         ;        
    |;        *ДЮМА/*ТОМА/*ДЕГА/*ЛЮКА/*ФЕРМА/*ГАМАРРА/;           0;            ;        ;        ;          ;         ;        
    |;        *ПЕТИПА/*ШАНДРА/*СКАЛЯ/*КАРУАНА/;                    0;            ;        ;        ;          ;         ;        
    |М-;    ИЯ/;                                                1;            и;        и;        ю;        ей;        и;      Берия             
    |М-;    ОЯ/;                                                1;            и;        е;        ю;        ей;        е;        
    |;        НЖА/;                                                1;            и;        е;        у;        ей;        е;        Стринжа
    |;        ЖА/;                                                1;            и;        е;        у;        ой;        е;        Ганжа
    |;        ГА/КА/УЛЕША/ВАША/ХА/;                                1;            и;        е;        у;        ой;        е;        Кулеша/Кулешой
    |;        Я/;                                                    1;            и;        е;        ю;        ей;        е;        Разиня
    |;        ЙА/ЧА/ША/ЩА/;                                        1;            и;        е;        у;        ей;        е;        Олеша/Олешей, Мойа
    |;        ЦА/;                                                1;            ы;        е;        у;        ей;        е;        Лисица
    |;        А/;                                                    1;            ы;        е;        у;        ой;        е;                   
    |М-;    ЕНЬ/;                                                3;            ня;        ню;        ня;        нем;    не;        Камень
    |М-;    Ь/;                                                    1;            я;        ю;        я;        ем;        е;        Даль
    |М-;    ЁК/;                                                2;            ька;    ьку;    ька;    ьком;    ьке;    Королёк
    |М-;    БЛОК/;                                                0;            а;        у;        а;        ом;        е;      Блок
    |М-;    ОК/;                                                2;            ка;        ку;        ка;        ком;    ке;        Миненок, Кисляченок
    |М-;    ИЕЦ/;                                                2;            йца;    йцу;    йца;    йцем;    йце;    Коломиец
    |М-;    ПАЛЕЦ/;                                                2;            ьца;    ьцу;    ьца;    ьцем;    ьце;    Долгопалец
    |М-;    ЛЕЦ/;                                                2;            ьца;    ьцу;    ьца;    ьцом;    ьце;    Стрелец
    |М-;    ЧЕЦ/;                                                0;            а;        у;        а;        ом;        е;        Чайчец
    |М-;    АВЕЦ/ЖЕЦ/;                                            2;            ца;        цу;        ца;        цем;    це;        Переяславец, Запорожец
    |М-;    ОВЕЦ/БЕЦ/АМЕЦ/НЕЦ/ТЕЦ/;                                2;            ца;        цу;        ца;        цом;    це;        Горовец
    |М-;    ШВЕЦ/;                                                0;            а;        у;        а;        ом;        е;        Швец
    |М-;    Ц/;                                                    0;            а;        у;        а;        ем;        е;        Кац, Бэц
    |М-;    ЁЛ/;                                                2;            ла;        лу;        ла;        лом;    ле;        Козёл
    |М-;    ДЖ/ИЖ/ОЖ/РЖ/ЙЧ/;                                    0;            а;        у;        а;        ем;        е;        Джордж, Лейч
    |М-;    Б/В/Г/Д/Ж/З/К/Л/М/Н/П/Р/С/Т/Ф/Х/Ч/Ш/Щ/;                0;            а;        у;        а;        ом;        е;        Заканчивается на согласную";
    
    ПравилаИ = //Имя
    //Род;    Окончания;                                            Обрезка;    Р;        Д;        В;        Т;        П;        Комментарий   
    "Ж;        *ИЯ/;                                                1;            и;        е;        ю;        ей;        е;        Ия
    |Ж;        ИЯ/;                                                1;            и;        и;        ю;        ей;        и;        Мария
    |;        ГА/КА/ХА/;                                            1;            и;        е;        у;        ой;        е;        Ольга, Серега, Лука, Лика, Хоха
    |;        ЖА/ЙА/ЧА/ША/ЩА/;                                    1;            и;        е;        у;        ей;        е;        Миша, Маша
    |;        ЦА/;                                                1;            ы;        е;        у;        ей;        е;      Маца
    |Ж;        НА/ВЕРА/;                                            1;            ы;        е;        у;        ой;        е;      Инна, Нина, Ирина, Вера
    |Ж;        А/;                                                    1;            ы;        е;        у;        ой;        е;      Тома (женские на -а чаще)
    |М;        *ШОТА/;                                                0;            ;        ;        ;        ;        ;        Шота
    |М;        А/ЛО/;                                                1;            ы;        е;        у;        ой;        е;      Дима, Гаврило
    |М;        *ИЛЬЯ/*ИЛИЯ/;                                        1;            и;        е;        ю;        ей;        е;        Илья
    |Ж-;    Я/;                                                    1;            и;        е;        ю;        ей;        е;        Дуня
    |М-;    Я/;                                                    1;            и;        е;        ю;        ей;        е;        Гия
    |М;        РЬ/;                                                1;            я;        ю;        я;        ем;        е;        Игорь
    |Ж;        *ЛЮБОВЬ/*АГАРЬ/*РАХИЛЬ/*РУФЬ/*СУЛАМИФЬ/*ЭСФИРЬ/;    1;            и;        и;        ь;        ью;        и;        Любовь
    |Ж;        *ЮДИФЬ/*РАШЕЛЬ/*НИНЕЛЬ/*ИЗАБЕЛЬ/*ИСАБЕЛЬ/;            1;            и;        и;        ь;        ью;        и;        Любовь
    |М-;    Ь/;                                                    1;            я;        ю;        я;        ем;        е;        Олесь
    |М;        *ПАВЕЛ/;                                            2;            ла;        лу;        ла;        лом;    ле;        Павел
    |М;        *ЛЕВ/;                                                2;            ьва;    ьву;    ьва;    ьвом;    ьве;    Лев
    |М;        ИЙ/;                                                1;            я;        ю;        я;        ем;        и;        Василий
    |М;        Й/;                                                    1;            я;        ю;        я;        ем;        е;        Гай
    |М;        ЁТР/;                                                3;            етра;    етру;    етра;    етром;    етре;    Пётр
    |М;        +АХМАД/+АБДУЛ/+ГАСАН/+САЛИМ/+САИД/;                    0;            ;        ;        ;        ;        ;        Салим-Гирей
    |М;        ДЖ/;                                                0;            а;        у;        а;        ем;        е;        Джордж
    |М;        Б/В/Г/Д/Ж/З/К/Л/М/Н/П/Р/С/Т/Ф/Х/Ц/Ч/Ш/Щ/;            0;            а;        у;        а;        ом;        е;        Заканчивается на согласную";
    
    ПравилаО = //Отчество
    //Род;    Окончания;                                            Обрезка;    Р;        Д;        В;        Т;        П;        Комментарий   
    "М;        *ИЛЬИЧ/*КУЗЬМИЧ/*ЛУКИЧ/*ФОМИЧ/;                        0;            а;        у;        а;        ом;        е;        Ильичом, Кузьмичом (после шипящих под ударением!)
    |М;        ИЧ/;                                                0;            а;        у;        а;        ем;        е;
    |Ж;        НА/;                                                1;            ы;        е;        у;        ой;        е;
    |М;        ОГЛЫ/УЛЫ/УУЛУ/;                                        0;            ;        ;        ;        ;        ;       Оглы, Улы, Уулу
    |Ж;        ЫЗЫ/ИЗИ/;                                            0;            ;        ;        ;        ;        ;        Кызы, Гызы, Кизи
    |;        *ИБН/;                                                0;            ;        ;        ;        ;        ;        ибн
    |;        +Б/+В/+Г/+Д/+Ж/+З/+К/+Л/+М/+Н/+П/+Р/+С/+Т/+Ф/+Х/+Ц/+Ч/+Ш/+Щ/;0;    ;        ;        ;        ;        ;        Заканчивается на согласную - восточные отчества - не последняя часть слова
    |;        Б/В/Г/Д/Ж/З/К/Л/М/Н/П/Р/С/Т/Ф/Х/Ц/Ч/Ш/Щ/;            0;            а;        у;        а;        ом;        е;        Заканчивается на согласную - восточные отчества";
    
    ПравилаД = //Должность
    //Род;    Окончания;                                            Тег;    Обрезка;    Р;        Д;        В;        Т;        П;        
    "М;        *ВЕНТИЛЕВОЙ/*РУЛЕВОЙ/*ДВЕРЕВОЙ/*ПЕЧЕВОЙ/*КОВШЕВОЙ/;                                            ;        2;            ого;    ому;    ого;    ым;        ом;
    |М;        *ЛЮКОВОЙ/*СКИПОВОЙ/*МИКСЕРОВОЙ/*СТВОЛОВОЙ/*ГОРНОВОЙ/*ПОСТОВОЙ/*ВЕРХОВОЙ/*РАЗЪЕЗДНОЙ/*ПОРТНОЙ/;    ;    2;            ого;    ому;    ого;    ым;        ом;
    |М;        *БИРЖЕВОЙ/*ПОЛЕВОЙ/*ПУТЕВОЙ/*ЛИЦЕВОЙ/*ЗУБНОЙ/*ПОЕЗДНОЙ/*РЕЧНОЙ/*РУЧНОЙ/*ВТОРОЙ/;                    К;        2;            ого;    ому;    ого;    ым;        ом;
    |М;        *ПРАВОВОЙ/*БЕРЕГОВОЙ/*ТРУДОВОЙ/*СУДОВОЙ/*ГРУЗОВОЙ/*МИРОВОЙ/*ЛЕНТОВОЙ/*БОРТОВОЙ/*МОСТОВОЙ/*СТРАХОВОЙ/;К;        2;            ого;    ому;    ого;    ым;        ом;
    |М;        *ЗАВОДСКОЙ/*ГОРОДСКОЙ/*МОРСКОЙ/;                                                                    К;        2;            ого;    ому;    ого;    им;        ом;
    |М;        ЖИЙ/ЧИЙ/ШИЙ/ЩИЙ/;                                    ;        2;            его;    ему;    его;    им;        ем;        
    |М;        СКИЙ/;                                                ;        2;            ого;    ому;    ого;    им;        ом;        
    |М;        ЫЙ/;                                                ;        2;            ого;    ому;    ого;    ым;        ом;        
    |Ж;        ЖАЯ/ЧАЯ/ШАЯ/ЩАЯ/;                                    ;        2;            ей;        ей;        ую;        ей;        ей;        
    |Ж;        ЯЯ/;                                                ;        2;            ей;        ей;        юю;        ей;        ей;        
    |Ж;        АЯ/;                                                ;        2;            ой;        ой;        ую;        ой;        ой;        
    |;        Е/И/Ы/Ю/;                                            П;        0;            ;        ;        ;        ;        ;        
    |;        ЗАВ/ЗАМ/НАЧ/;                                        П;        0;            ;        ;        ;        ;        ;        
    |;        ОЙ/;                                                П;        0;            ;        ;        ;        ;        ;        
    |;        *ОВЕЦ/;                                                ;        0;            ;        ;        ;        ;        ;        
    |;        ДЬЯ/;                                                ;        1;            и;        е;        ю;        ей;        е;      
    |;        АРЬ/;                                                ;        1;            я;        ю;        я;        ем;        е;        
    |;        ИСТ/;                                                ;        0;            а;        у;        а;        ом;        е;        
    |Ж;        ЙКА/ИСТКА/ША/ТАРКА/ЕРКА/ЯРКА/ЕНКА/ЧИХА/ЖКА/;        ;        1;            и;        е;        у;        ой;        е;        
    |Ж;        ИЦА/;                                                ;        1;            ы;        е;        у;        ей;        е;      
    |Ж;        НЯ/ВЕЯ/НЬЯ/;                                        ;        1;            и;        е;        ю;        ей;        е;      
    |Ж;        СЕСТРА/ССА/;                                        ;        1;            ы;        е;        у;        ой;        е;      
    |Ж;        ДЕЛЬ/;                                                ;        1;            и;        и;        ь;        ью;        и;      
    |М;        ГЛАВА/ШИНА/;                                        ;        1;            ы;        е;        у;        ой;        е;      
    |М;        КАЛЬ/ГАЛЬ/ИТЕЛЬ/АТЕЛЬ/ОТЕЛЬ/ЕРЬ/;                    ;        1;            я;        ю;        я;        ем;        е;        
    |М;        АЧЕЙ/КЕЙ/ДЖЕЙ/;                                        ;        1;            я;        ю;        я;        ем;        е;        
    |М;        ЛИСТ/;                                                ;        0;            а;        у;        а;        ом;        е;        
    |М;        ЗНЕЦ/ТЕЦ/;                                            ;        0;            а;        у;        а;        ом;        е;        
    |М;        АВЕЦ/ЕБЕЦ/ЕВЕЦ/ОВЕЦ/ЖЕЦ/РЕЦ/СЕЦ/НЕЦ/;                ;        2;            ца;        цу;        ца;        цом;    це;        
    |М;        ОЕЦ/;                                                ;        2;            йца;    йцу;    йца;    йцом;    йце;    
    |М;        ИЕЦ/;                                                ;        2;            йца;    йцу;    йца;    йцем;    йце;    
    |М;        ПОСОЛ/;                                                ;        2;            ла;        лу;        ла;        лом;    ле;        
    |М;        РЕЛОК/;                                                ;        2;            ка;        ку;        ка;        ком;    ке;        
    |М;        РОНОМ/АНАТОМ/;                                        ;        0;            а;        у;        а;        ом;        е;        
    |М;        ОРУБ/ДУВ/КЛАД/ВЕД/ЕВОД/ОВОД/ОХОД/ЛАЗ/ВАЛ/ДЕЛ/СОЛ/ОКОЛ/КОП/ВАР/ОПАР/ВЕС/МЕС/НОС/ТЕС/;        ;    0;    а;        у;        а;        ом;        е;
    |М;        ЛОПРАВ/ТОПРАВ/РИВОД/ЫБАК/ЕГАР/АТУР/ТРОС/ИЛОТ/ПЕРТ/НАСТ/НТЕРН/АТЛЕТ/ХОДОК/ГРОК/ОБОЛ/;        ;    0;    а;        у;        а;        ом;        е;
    |М;        РАБ/ТАВ/МАТ/ГОГ/ЛОГ/ПЕД/РОЖ/ЗАК/СУЛ/ОНАЛ/ЕРСАЛ/ЛЕН/МЕН/ЬОН/ОУН/;                            ;    0;    а;        у;        а;        ом;        е;
    |М;        БАТ/ДАТ/КАТ/ПАТ/ТАТ/ЕКТ/ИСТ/ОСТ/АНТ/ГЕНТ/ДЕНТ/РЕНТ/СТЕНТ/ЦЕНТ/ОНТ/;                            ;    0;    а;        у;        а;        ом;        е;
    |М;        НАР/САР/ТАР/ЦАР/ЧАР/АТР/ИТР/СТР/;                                                            ;    0;    а;        у;        а;        ом;        е;
    |М;        АЕР/ВЕР/ГЕР/ДЕР/ЖЕР/ЗЕР/ЙЕР/КЕР/ЛЕР/НЕР/ПЕР/РЕР/СЕР/ХЕР/ЧЕР/ШЕР/ЮЕР/;                        ;    0;    а;        у;        а;        ом;        е;
    |М;        ЕМЕР/ИМЕР/РМЕР/ЮМЕР/АЛЬЕР/ЕЛЬЕР/РЬЕР/ЁР/;                                                    ;    0;    а;        у;        а;        ом;        е;
    |М;        ДИТЕР/КТЕР/ЛТЕР/ЙТЕР/НТЕР/ОТЕР/ПТЕР/СТЕР/УТЕР/ФТЕР/ХТЕР/;                                    ;    0;    а;        у;        а;        ом;        е;
    |М;        ДОР/ЗОР/ИОР/РОР/СОР/ТОР/ФОР/ЦОР/АТОР/ИТОР/КТОР/НТОР/;                                        ;    0;    а;        у;        а;        ом;        е;
    |М;        ВИК/ЗИК/МИК/НИК/ГРАФИК/ЧИК/ШИК/ЩИК/ИРИК/ОРИК/ТРИК/ГИСТИК/ТИСТИК/УСТИК/АТИК/ЕТИК/ИТИК/ПТИК/;    ;    0;    а;        у;        а;        ом;        е;
    |М;        ИВ/РГ/ИД/ЯК/АН/ГУН/ИР/ЭР/ЮР/ЯР/УС/ВТ/ЬТ/АФ/СОФ/ТУХ/ЮХ/АЧ/;                                    ;    0;    а;        у;        а;        ом;        е;";
    
    ПравилаЧ = //Числительное
    //Род;    Окончания;                                Тег;    Обрезка;    И;            Р;            Д;            В;            Т;            П;            О;        Комментарий   
    "М;        *ОДИН/*ОДНА/*ОДНО/;                        1;        2;            ин;            ного;        ному;        ин;            ним;        ном;        ного;    Один
    |С;        *ОДИН/*ОДНА/*ОДНО/;                        1;        2;            но;            ного;        ному;        но;            ним;        ном;        ного;    Одно
    |Ж;        *ОДИН/*ОДНА/*ОДНО/;                        1;        2;            на;            ной;        ной;        ну;            ной;        ной;        ну;        Одна
    |М;        *ДВА/*ДВЕ/;                                2;        1;            а;            ух;            ум;            а;            умя;        ух;            ух;        Два, Две
    |С;        *ДВА/*ДВЕ/;                                2;        1;            а;            ух;            ум;            а;            умя;        ух;            ух;        Два, Две
    |Ж;        *ДВА/*ДВЕ/;                                2;        1;            е;            ух;            ум;            е;            умя;        ух;            ух;        Два, Две
    |;        *ТРИ/;                                    2;        1;            и;            ех;            ем;            и;            емя;        ех;            ех;        Три
    |;        *ЧЕТЫРЕ/;                                2;        1;            е;            ех;            ем;            е;            ьмя;        ех;            ех;        Четыре
    |;        *ВОСЕМЬ/;                                ;        3;            емь;        ьми;        ьми;        емь;        емью;        ьми;        емь;    Восемь
    |;        *ПЯТЬ/*ШЕСТЬ/*СЕМЬ/*ДЕВЯТЬ/*ДЕСЯТЬ/ДЦАТЬ/;    ;    1;            ь;            и;            и;            ь;            ью;            и;            ь;        Пять, Шесть, Семь, Десять и др.
    |;        *СОРОК/;                                ;        0;            ;            а;            а;            ;            а;            а;            ;        Сорок
    |;        *ВОСЕМЬДЕСЯТ/;                            ;        8;            емьдесят;    ьмидесяти;    ьмидесяти;    емьдесят;    емьюдесятью;ьмидесяти;    емьдесят;Восемьдесят
    |;        ЬДЕСЯТ/;                                ;        6;            ьдесят;        идесяти;    идесяти;    ьдесят;        ьюдесятью;    идесяти;     ьдесят;    Пятьдесят и др.
    |;        *СТО/*ДЕВЯНОСТО/;                        ;        1;            о;            а;            а;            о;            а;            а;             о;        Девяносто, Сто
    |;        *ДВЕСТИ/;                                ;        4;            ести;        ухсот;        умстам;        ести;        умястами;    ухстах;        ести;    Двести
    |;        *ТРИСТА/;                                ;        4;            иста;        ехсот;        емстам;        иста;        емястами;    ехстах;        иста;    Триста
    |;        *ЧЕТЫРЕСТА/;                            ;        4;            еста;        ехсот;        емстам;        еста;        ьмястами;    ехстах;        еста;    Четыреста
    |;        *ВОСЕМЬСОТ/;                            ;        6;            емьсот;        ьмисот;        ьмистам;    емьсот;        емьюстами;    ьмистах;    емьсот;    Восемьсот
    |;        ЬСОТ/;                                    ;        4;            ьсот;        исот;        истам;        ьсот;        ьюстами;     истах;        ьсот;    Пятьсот, Шестьсот, Семьсот, Девятьсот
    |;        *НОЛЬ/*НУЛЬ/;                            ;        1;            ь;            я;            ю;            ь;            ем;            е;            ь;        Ноль, Нуль
    |М;        1/;                                        1;        0;            -ин;        -го;        -му;        -ин;        -им;        -ом;        -го;    
    |С;        1/;                                        1;        0;            -но;        -го;        -му;        -ин;        -им;        -ом;        -го;    
    |Ж;        1/;                                        1;        0;            -на;        -ой;        -ой;        -ну;        -ой;        -ой;        -ну;        
    |М;        2/;                                        2;        0;            -а;            -ух;        -ум;        -а;            -мя;        -ух;        -ух;    
    |С;        2/;                                        2;        0;            -а;            -ух;        -ум;        -а;            -мя;        -ух;        -ух;
    |Ж;        2/;                                        2;        0;            -е;            -ух;        -ум;        -е;            -мя;        -ух;        -ух;
    |;        3/;                                        2;        0;            -и;            -ех;        -ем;        -и;            -мя;        -ех;        -ех;    
    |;        4/;                                        2;        0;            -ре;        -х;            -ем;        -ре;        -мя;        -ех;        -ех;    
    |;        5/6/9/10/11/12/13/14/15/16/17/18/19/20/30/;;    0;            -ть;        -ти;        -ти;        -ть;        -тью;        -ти;        -ть;    
    |;        7/8/;                                    ;        0;            -мь;        -ми;        -ми;        -мь;        -мью;        -ми;        -мь;    
    |;        40/;                                    ;        0;            -к;            -ка;        -ка;        -к;            -ка;        -ка;        -к;        
    |;        50/60/70/80/;                            ;        0;            -т;            -ти;        -ти;        -т;            -тью;        -ти;        -т;        
    |;        90/;                                    ;        0;            -сто;        -та;        -та;        -сто;        -та;        -та;        -сто;    
    |;        100/;                                    ;        0;            ;            -та;        -та;        ;            -та;        -та;        ;    
    |;        200/;                                    ;        0;            -и;            -сот;        -стам;        -и;            -стами;        -стах;      -и;    
    |;        300/400/;                                ;        0;            -а;            -сот;        -стам;        -а;            -стами;        -стах;      -а;        
    |;        500/600/700/800/900/;                    ;        0;            -сот;        -сот;        -стам;        -сот;        -стами;        -стах;      -сот;    
    |;        *0/;                                    ;        0;            -ль;        -ля;        -лю;        -ль;        -ем;        -ле;        -ль;    
    |;        0/;                                        ;        0;            ;            ;            ;            ;            ;            ;            ;";
    
    ПравилаВ = //Выражение
    //Род;    Окончания;                                    Обрезка;    И;                Р;                Д;                В;                Т;                П;                О;                
    "С;        ЕНИЕ/;                                        1;            е/я;            я/й;            ю/ям;            е/я;            ем/ями;            и/ях;            е/й;            
    //"Р" в колонке "Род" означает, слово родоизменяемое, и порядок окончания в списке определяет род слова
    |Р;        КИЙ/КАЯ/КОЕ/КИЕ/;                            2;            ий/ая/ое/ие;    ого/ой/ого/их;    ому/ой/ому/им;    ий/ую/ое/ие;    им/ой/им/ими;    ом/ой/ом/их;    ого/ую/ое/их;    
    |Р;        НИЙ/НЯЯ/НЕЕ/НИЕ/;                            2;            ий/яя/ее/ие;    его/ей/его/их;    ему/ей/ему/им;    ий/юю/ее/ие;    им/ей/им/ими;    ем/ей/ем/их;    его/юю/ое/их;    
    |Р;        ЩИЙ/ЩАЯ/ЩЕЕ/ЩИЕ/;                            2;            ий/ая/ее/ие;    его/ей/его/их;    ему/ей/ему/им;    ий/ую/ее/ие;    им/ей/им/ими;    ем/ей/ем/их;    его/ую/ое/их;    
    |Р;        ШИЙ/ШАЯ/ШОЕ/ШИЕ/;                            2;            ий/ая/ее/ие;    его/ей/его/их;    ему/ей/ему/им;    ий/ую/ее/ие;    им/ей/им/ими;    ем/ей/ем/их;    его/ую/ое/их;    
    |Р;        ЫЙ/АЯ/ОЕ/ЫЕ/;                                2;            ый/ая/ое/ые;    ого/ой/ого/ых;    ому/ой/ому/ым;    ый/ую/ое/ые;    ым/ой/ым/ыми;    ом/ой/ом/ых;    ого/ую/ое/ых;    
    |Р;        ЧЕЛ/ЧЛА/ЧЛО/ЧЛИ/;                            2;            ел/ла/ло/ли;    ел/ла/ло/ли;    ел/ла/ло/ли;    ел/ла/ло/ли;    ел/ла/ло/ли;    ел/ла/ло/ли;    ел/ла/ло/ли;    
    |Р;        АЛ/АЛА/АЛО/АЛИ/;                            0111;        /а/о/и;            /а/о/и;            /а/о/и;            /а/о/и;            /а/о/и;            /а/о/и;            /а/о/и;            
    |Р;        ИЛ/ИЛА/ИЛО/ИЛИ/;                            0111;        /а/о/и;            /а/о/и;            /а/о/и;            /а/о/и;            /а/о/и;            /а/о/и;            /а/о/и;            
    |Р;        ЕЛ/ЕЛА/ЕЛО/ЕЛИ/;                            0111;        /а/о/и;            /а/о/и;            /а/о/и;            /а/о/и;            /а/о/и;            /а/о/и;            /а/о/и;            
    |Ж;        *ТЫСЯЧА/*ТЫСЯЧИ/*ТЫСЯЧ/;                        110;        а/и;            и/;                е/ам;            у/и;            ей/ами;            е/ах;            у/и;            
    |М;        ЛЛИОН/ЛЛИОНА/ЛЛИОНОВ/ЛЛИАРД/ЛЛИАРДА/ЛЛИАРДОВ/;012012;    /ы;                а/ов;            у/ам;            /ы;                ом/ами;            е/ах;            /ы;                
    |;        *САНКТ/*УСТЬ/*ЙОШКАР/*НА/;                    0;            /;                /;                /;                /;                /;                /;                /;                
    |;        *СТЕРЛИНГОВ/;                                0;            /;                /;                /;                /;                /;                /;                /;                
    |М;        ОВЕК/;                                        0;            /и;                а/;                у/ам;            а/;                ом/ами;            е/ах;            а/;                
    |М;        ЕЦ/;                                        2;            ец/цы;            ца/цов;            цу/цам;            ец/цы;            цом/цами;        це/цах;            ца/цов;            
    |М;        ЕНЬ/;                                        3;            ень/ни;            ня/ней;            ню/ням;            ень/ни;            нем/нями;        не/нях;            ня/ней;            
    |М;        ШОК/;                                        2;            ок/ки;            ка/ков;            ку/кам;            ок/ки;            ком/ками;        ке/ках;            ка/ков;            
    |М;        *ДОЛЛАР/*ДОЛЛАРА/*ДОЛЛАРОВ/;                012;        /ы;                а/ов;            у/ам;            /ы;                ом/ами;            е/ах;            а/ов;            
    |М;        ЦЕНТ/ЦЕНТА/ЦЕНТОВ/;                            012;        /ы;                а/ов;            у/ам;            /ы;                ом/ами;            е/ах;            а/ов;            
    |М;        *РУБЛЬ/*РУБЛЯ/*РУБЛЕЙ/;                        112;        ь/и;            я/ей;            ю/ям;            ь/и;            ем/ями;            е/ях;            я/ей;            
    |Ж;        *КОПЕЙКА/*КОПЕЙКИ/*КОПЕЕК/;                    332;        йка/йки;        йки/ек;            йке/йкам;        йку/йки;        йкой/йками;        йке/йках;        йку/ек;            
    |М;        Б/В/Д/З/Л/М/Н/П/Р/С/Т/Ф/Ц/;                    0;            /ы;                а/ов;            у/ам;            /ы;                ом/ами;            е/ах;            а/ов;            
    |М;        Г/К/Х/;                                        0;            /и;                а/ов;            у/ам;            /и;                ом/ами;            е/ах;            а/ов;            
    |М;        Ж/Ч/Ш/Щ/;                                    0;            /и;                а/ей;            у/ам;            /и;                ем/ами;            е/ах;            а/ей;            
    |М;        Й/;                                            1;            й/и;            я/ев;            ю/ям;            й/и;            ем/ями;            е/ях;            я/ев;            
    |Ж;        Ь/;                                            1;            ь/и;            и/ей;            и/ям;            ь/и;            ью/ями;            и/ях;            и/ей;            
    |М;        Ь/;                                            1;            ь/и;            я/ей;            ю/ям;            ь/и;            ем/ями;            е/ях;            я/ей;            
    |Ж;        ЛЯ/;                                        2;            ля/ли;            ли/ель;            ле/лям;            лю/ли;            лей/лями;        ле/лях;            лю/ли;            
    |Ж;        ХНЯ/;                                        2;            ня/ни;            ни/онь;            не/ням;            ню/ни;            ней/нями;        не/нях;            ню/ни;            
    |Ж;        РЯ/НЯ/;                                        1;            я/и;            и/ей;            е/ям;            ю/и;            ей/ями;             е/ях;            ю/ей;            
    |Ж;        СКА/МКА/НКА/;                                2;            ка/ки;            ки/ок;            ке/кам;            ку/ки;            кой/ками;        ке/ках;            ку/ок;            
    |Ж;        ЖА/ЙА/ЧА/ША/ЩА/;                            1;            а/и;            и/;                е/ам;            у/и;            ей/ами;            е/ах;            у/;                
    |Ж;        ГА/КА/ХА/;                                    1;            а/и;            и/;                е/ам;            у/и;            ой/ами;            е/ах;            у/;                
    |Ж;        ЦА/;                                        1;            а/ы;            ы/;                е/ам;            у/ы;            ей/ами;            е/ах;            у/;                
    |Ж;        ВНА/;                                        2;            на/ны;            ны/ен;            не/нам;            ну/ны;            ной/нами;        не/нах;            ну/ен;            
    |Ж;        А/;                                            1;            а/ы;            ы/;                е/ам;            у/ы;            ой/ами;            е/ах;            у/;                
    |С;        *ЕВРО/;                                        0;            /;                /;                /;                /;                /;                /;                /;                
    |С;        КО/;                                        1;            о/а;            а/ов;            у/ам;            о/а;            ом/ами;            е/ах;            о/;                
    |С;        О/;                                            1;            о/а;            а/;                у/ам;            о/а;            ом/ами;            е/ах;            о/;                
    |С;        Е/;                                            1;            е/я;            я/й;            ю/ям;            е/я;            ем/ями;            и/ях;            е/й;            ";
    
    Параметр0 = Выражение;
    Параметр1 = Падеж;
    Параметр2 = Род;
    Параметр3 = Режим;
    Параметр4 = ФорматнаяСтрока;
    
    Если Параметр0 = "РазделитьСтроку" Тогда
        
        ПозРазделителя = Найти(Параметр1, Параметр2); Режим = Сред(Параметр1, ПозРазделителя + СтрДлина(Параметр2)); Возврат Лев(Параметр1, ПозРазделителя - 1);
        
    ИначеЕсли Параметр0 = "ВМассивБезРазделителей" Тогда
        
        МассивСтрок = Новый Массив(); Пока ИСТИНА Цикл Поз = Найти(Параметр1, Параметр2); Если Поз = 0 Тогда МассивСтрок.Добавить(Параметр1); Возврат МассивСтрок;    КонецЕсли;    МассивСтрок.Добавить(СокрЛП(Лев(Параметр1, Поз - 1))); Параметр1 = СокрЛП(Сред(Параметр1, Поз + СтрДлина(Параметр2))); КонецЦикла; Возврат МассивСтрок;
        
    ИначеЕсли Параметр0 = "ВМассивСРазделителями" Тогда
        
        МассивСтрок = Новый Массив(); КолРазделителей = СтрДлина(Параметр2);    Пока ИСТИНА Цикл МинПозРазделителя = 10000; Для ИндРазделителя = 1 По КолРазделителей Цикл ПозРазделителя = Найти(Параметр1, Сред(Параметр2, ИндРазделителя, 1)); Если ПозРазделителя > 0 Тогда МинПозРазделителя = Мин(МинПозРазделителя, ПозРазделителя); КонецЕсли; КонецЦикла; Если МинПозРазделителя = 10000 Тогда МассивСтрок.Добавить(Параметр1); Возврат МассивСтрок; КонецЕсли; МассивСтрок.Добавить(Лев(Параметр1, МинПозРазделителя - 1)); Для Поз = МинПозРазделителя По СтрДлина(Параметр1) + 1 Цикл ТекСимвол = Сред(Параметр1, Поз, 1); Если Найти(Параметр2, ТекСимвол) = 0 ИЛИ Поз = СтрДлина(Параметр1) + 1 Тогда МассивСтрок.Добавить(Сред(Параметр1, МинПозРазделителя, Поз - МинПозРазделителя)); Параметр1 = Сред(Параметр1, Поз); Прервать; КонецЕсли; КонецЦикла; КонецЦикла; 
        
    ИначеЕсли Параметр0 = "ПривестиПоДлинеИРегистру" Тогда
        
        ИсходнаяСтрока     = Параметр1;
        Образец             = Параметр2;
        
        Результат = ?(Лев(Образец, 1) = "-", Лев(ИсходнаяСтрока, 1), ?(Лев(Образец, 1) <> НРег(Лев(Образец, 1)), ВРег(Лев(ИсходнаяСтрока, 1)), НРег(Лев(ИсходнаяСтрока, 1))));
        Если НЕ Сред(Образец, 2, 1) = "" Тогда
            Результат = Результат + ?(Сред(Образец, 2, 1) = "-", Сред(ИсходнаяСтрока, 2), ?(Сред(Образец, 2, 1) <> НРег(Сред(Образец, 2, 1)), ВРег(Сред(ИсходнаяСтрока, 2)), НРег(Сред(ИсходнаяСтрока, 2))));
        КонецЕсли;

        Возврат Результат;
        
    ИначеЕсли Параметр0 = "ПросклонятьСлово" Тогда
        
        СтрокаСлово    = Параметр3; 
        
        Если СтрокаСлово.Склонение = "-" ИЛИ СтрокаСлово.Склонение = "!" Тогда 
            Возврат "";
        КонецЕсли;
        
        ИсходнаяСтрока = СтрокаСлово.Значение;
        Метод = ?(Найти("ФИО", СтрокаСлово.Субметод) > 0, "ФИО", СтрокаСлово.Субметод);
        СтрокаПадежи    = ?(Найти("ЧВ", Метод) > 0, "ИРДВТПО", "РДВТП");
        
        ПраваяЧасть = "";
        
        ТаблицаПравила = Вычислить("Правила" + СтрокаСлово.Субметод);
        Для НомСтр = 1 По СтрЧислоСтрок(ТаблицаПравила) Цикл
            
            СтрокаПравила = СтрПолучитьСтроку(ТаблицаПравила, НомСтр);
            
            Если Найти(СтрокаПравила, ВРег(Прав(ИсходнаяСтрока, 1)) + "/") = 0 Тогда Продолжить; КонецЕсли; 
            
            РодПравила = СокрЛП(daСклонение("РазделитьСтроку", СтрокаПравила, ";", ПраваяЧасть)); 
            Если (Найти(" МЖС", Род) > 1 И НЕ ПустаяСтрока(РодПравила) И Найти(РодПравила, Род) = 0 И РодПравила <> "Р") Тогда Продолжить; КонецЕсли;
            
            ЛеваяЧасть = daСклонение("РазделитьСтроку", ПраваяЧасть, ";", ПраваяЧасть);
            МассивОкончания = daСклонение("ВМассивБезРазделителей", СокрЛП(ЛеваяЧасть), "/");
            Для Инд = 0 По МассивОкончания.ВГраница() - 1 Цикл
                
                СтрокаОкончание = МассивОкончания[Инд];
                
                Если НЕ ((ВРег(Прав(ИсходнаяСтрока, СтрДлина(СтрокаОкончание))) = ВРег(СтрокаОкончание)) 
                    ИЛИ (Лев(СтрокаОкончание, 1) = "*" И ВРег(ИсходнаяСтрока) = ВРег(Сред(СтрокаОкончание, 2)))
                    ИЛИ (Лев(СтрокаОкончание, 1) = "+" И ВРег(Прав(ИсходнаяСтрока, СтрДлина(СтрокаОкончание) - 1)) = Сред(ВРег(СтрокаОкончание), 2) И СтрокаСлово.Тег = "Н")) Тогда 
                    Продолжить;
                КонецЕсли;
                
                Если Метод = "Д" ИЛИ Метод = "Ч" Тогда 
                    ТегПравило = СокрЛП(daСклонение("РазделитьСтроку", ПраваяЧасть, ";", ПраваяЧасть));
                    ТегПравило = ?(Метод = "Ч" И СтрДлина(ТегПравило) = 0, Сред("51222", Найти("1234", Прав(ИсходнаяСтрока, 1)) + 1, 1), ТегПравило); 
                    
                    Если СтрДлина(ТегПравило) > 0 И ПустаяСтрока(СтрокаСлово.Тег) Тогда
                        СтрокаСлово.Тег = ТегПравило;
                        СтрокаСлово.Склонение = ?(ТегПравило = "П", "!", СтрокаСлово.Склонение); 
                        Возврат "";
                    КонецЕсли;
                КонецЕсли;
                
                Если РодПравила = "Р" Тогда 
                    РодНайденный = Сред("МЖСН", Инд + 1, 1);
                    СтрокаСлово.Тег = "Р"; 
                Иначе
                    РодНайденный = ?(СтрДлина(РодПравила) = 1, РодПравила, "");
                КонецЕсли;
                
                СтрокаСлово.Род = РодНайденный;
                
                Если Метод = "ФИО" И ПустаяСтрока(Род) И ПустаяСтрока(РодНайденный) Тогда 
                    Возврат ""; 
                КонецЕсли;
                
                Если Метод = "В" И СтрокаСлово.Склонение = "?" Тогда 
                    СтрокаСлово.Склонение = "";
                    Возврат ""; 
                КонецЕсли;
                
                Если Найти(СтрокаПадежи, Падеж) = 0 Тогда 
                    СтрокаСлово.Склонение = "!";
                    Возврат "";
                КонецЕсли;
                
                Обрезка = СокрЛП(daСклонение("РазделитьСтроку", ПраваяЧасть, ";", ПраваяЧасть));
                Обрезка = Число(?(СтрДлина(Обрезка) = 1, Обрезка, Сред(Обрезка, Инд + 1, 1)));
                
                МассивСклонения = daСклонение("ВМассивБезРазделителей", СокрЛП(ПраваяЧасть), ";");
                Окончание = СокрЛП(МассивСклонения[Найти(СтрокаПадежи, Падеж) - 1]);
                Если Метод = "В" Тогда 
                    МассивОкончания = daСклонение("ВМассивБезРазделителей", Окончание, "/");
                    ИндОкончания = Число(Сред(?(РодПравила = "Р", "00123", "00001"), Найти("МЖСН", ?(ПустаяСтрока(Род), РодНайденный, Род)) + 1, 1));
                    Окончание = МассивОкончания[ИндОкончания];
                КонецЕсли;
                СтрокаСлово.Значение = Лев(ИсходнаяСтрока, СтрДлина(ИсходнаяСтрока) - Обрезка) + daСклонение("ПривестиПоДлинеИРегистру", Окончание, Прав(ИсходнаяСтрока, 1) + Прав(ИсходнаяСтрока, 1)); 
                СтрокаСлово.Склонение = "!";
                Возврат "";
                
            КонецЦикла;
            
        КонецЦикла;
        
        Если Метод = "Ч" Тогда
            СтрокаСлово.Субметод = "В"; 
            СтрокаСлово.Склонение = "?";
            Возврат daСклонение("ПросклонятьСлово", Падеж, "", СтрокаСлово);
        Иначе
            СтрокаСлово.Склонение = "!"; 
            Возврат  ""; 
        КонецЕсли;
        
    ИначеЕсли Параметр0 = "ПроверкаТипов" Тогда
        
        ИсходнаяСтрока     = Параметр1;
        
        СтруктураТипы = Новый Структура("ЕстьЦифры, ЕстьНеЦифры, ЕстьВРег, ЕстьНРег, Аббревиатура", Ложь, Ложь, Ложь, Ложь, Ложь);
        СтрокаЦифры                 = "0123456789";
        СтрокаЦифрыИРазделители     = "0123456789. "; 
        КолНРег = 0;
        
        Для Поз = 1 По СтрДлина(ИсходнаяСтрока) Цикл
            ТекСимвол = Сред(ИсходнаяСтрока, Поз, 1);
            СтруктураТипы.ЕстьЦифры     = СтруктураТипы.ЕстьЦифры ИЛИ Найти(СтрокаЦифры, ТекСимвол) > 0;
            СтруктураТипы.ЕстьНеЦифры     = СтруктураТипы.ЕстьНеЦифры ИЛИ Найти(СтрокаЦифрыИРазделители, ТекСимвол) = 0;
            СтруктураТипы.ЕстьВРег     = СтруктураТипы.ЕстьВРег ИЛИ ТекСимвол <> НРег(ТекСимвол);
            СтруктураТипы.ЕстьНРег     = СтруктураТипы.ЕстьНРег ИЛИ ТекСимвол <> ВРег(ТекСимвол);
            КолНРег = КолНРег + (ТекСимвол <> ВРег(ТекСимвол));
        КонецЦикла; 
        
        СтруктураТипы.Аббревиатура = СтруктураТипы.ЕстьНеЦифры И (КолНРег < Макс(СтрДлина(ИсходнаяСтрока) - 1, 2) ИЛИ СтруктураТипы.ЕстьЦифры);
        
        Возврат СтруктураТипы;
        
    ИначеЕсли Параметр0 = "?" Тогда 
        
        Возврат Версия;
        
    КонецЕсли;
    
    РежимЗапуска = ?(ПустаяСтрока(Режим), "ФИО", ВРег(СокрЛП(Режим))); 
    
    Если Найти("ФИО", Лев(РежимЗапуска, 1)) > 0 Тогда
        РегистрыШаблона     = Новый Структура("ФАМИЛИЯ, ИМЯ, ОТЧЕСТВО, Ф, И, О", , , , "--", "--", "--"); 
        Метод                 = "ФИО";
    ИначеЕсли Найти("ДЧВ", РежимЗапуска) > 0 Тогда
        РегистрыШаблона     = Новый Структура("А, Б, В, Г", "-", "-", "-", "-"); 
        Метод                 = РежимЗапуска;
    Иначе
        Возврат "<неправильный режим!!!>";
    КонецЕсли;
    Разделители = " -+.,()/"""; 
    
    МакросИзШаблона = ФорматнаяСтрока;
    Если НЕ ПустаяСтрока(ФорматнаяСтрока) Тогда
        
        Для Каждого ЭлементРегистрыШаблона Из РегистрыШаблона Цикл
            Поз = Найти(ВРег(МакросИзШаблона), ЭлементРегистрыШаблона.Ключ);
            Если Поз = 0 Тогда
                Продолжить;
            КонецЕсли;
            
            СимволМакроса         = Лев(ЭлементРегистрыШаблона.Ключ, 1); 
            НайденныйШаблон     = Сред(МакросИзШаблона, Поз, СтрДлина(ЭлементРегистрыШаблона.Ключ)); 
            РегистрыШаблона[СимволМакроса] = НайденныйШаблон; 
            
            Если Метод = "ФИО" Тогда
                ПриведенныйМакрос = "%" + Найти("ФИО", СимволМакроса); 
                МакросИзШаблона = СтрЗаменить(МакросИзШаблона, НайденныйШаблон, ПриведенныйМакрос);
            КонецЕсли;
        КонецЦикла;
        
        Если Метод = "ФИО" Тогда
            Для Ном = 1 По 3 Цикл
                МакросИзШаблона = СтрЗаменить(МакросИзШаблона, "%" + Ном, "%" + Сред("ФИО", Ном, 1));
            КонецЦикла; 
        КонецЕсли;
            
    КонецЕсли;
    
    ТаблицаСлова = Новый ТаблицаЗначений;
    ТаблицаСлова.Колонки.Добавить("Значение");
    ТаблицаСлова.Колонки.Добавить("Субметод");
    ТаблицаСлова.Колонки.Добавить("Род");
    ТаблицаСлова.Колонки.Добавить("Тег");
    ТаблицаСлова.Колонки.Добавить("Регистр");
    ТаблицаСлова.Колонки.Добавить("Склонение");
    ТаблицаСлова.Колонки.Добавить("Порядок", Новый ОписаниеТипов("Число"));
    
    ПадежИтоговый    = Сред("ИИРДВТПОИРДВТПО", Найти("ИРДВТПО1234567", ВРег(Падеж)) + 1, 1); 
    РодИтоговый    = СокрЛП(Сред("  МЖСНМЖСН", Найти("?МЖСН1234", ВРег(Род)) + 1, 1)); 
    МакросПоУмолчанию = "";
    ПозШаблонВход = 1;
    ПозЧастиСтроки = 0;
    СоставноеСлово = Ложь;
    РодСклонения    = ?(Метод = "Ч", "", РодИтоговый); 
    
    МассивЧастиСтроки = daСклонение("ВМассивСРазделителями", Выражение, Разделители);
    Пока ПозЧастиСтроки <= МассивЧастиСтроки.ВГраница() Цикл
        
        ЧастьСтроки = МассивЧастиСтроки[ПозЧастиСтроки];
        
        Если Метод = "ФИО" И НЕ ПустаяСтрока(МакросИзШаблона) И Лев(ЧастьСтроки, 1) = "." И ТаблицаСлова.Количество() > 0 И СтрДлина(ТаблицаСлова[ТаблицаСлова.Количество() - 1].Регистр) > 1 Тогда
            ТаблицаСлова[ТаблицаСлова.Количество() - 1].Тег = "."; 
        КонецЕсли;
            
        Если Найти(Разделители, Лев(ЧастьСтроки, 1)) > 0 ИЛИ (Метод = "ФИО" И ПозШаблонВход > СтрДлина(РежимЗапуска)) Тогда 
            МакросПоУмолчанию = МакросПоУмолчанию + ?(СоставноеСлово, "", ЧастьСтроки); 
        Иначе
            СтрокаСлово = ТаблицаСлова.Добавить();
            
            Если Лев(ЧастьСтроки, 1) = "\" Тогда
                ЧастьСтроки = Сред(ЧастьСтроки, 2);
                СтрокаСлово.Склонение = "-";
            ИначеЕсли Лев(ЧастьСтроки, 1) = "^" Тогда  
                ЧастьСтроки = Сред(ЧастьСтроки, 2);
                СтрокаСлово.Склонение = "+"; 
            КонецЕсли; 
            
            СтруктураТипы = daСклонение("ПроверкаТипов", ЧастьСтроки);
            
            Если Метод = "Ч" И СтрокаСлово.Склонение <> "-" И СтрокаСлово.Склонение <> "+" И СтруктураТипы.ЕстьЦифры И НЕ СтруктураТипы.ЕстьНеЦифры Тогда 
                МассивЧастиСубСтроки = daСклонение("ВМассивСРазделителями", СокрЛП(ЧислоПрописью(ЧастьСтроки, "Л = ruRU", ",,,,,,,,0")), " ");
                МассивЧастиСтроки.Удалить(ПозЧастиСтроки);
                Для ПозЧастиСубСтроки = 0 По МассивЧастиСубСтроки.ВГраница() Цикл
                    МассивЧастиСтроки.Вставить(ПозЧастиСтроки, МассивЧастиСубСтроки[МассивЧастиСубСтроки.ВГраница() - ПозЧастиСубСтроки]);
                КонецЦикла; 
                ЧастьСтроки = МассивЧастиСтроки[ПозЧастиСтроки];
            КонецЕсли;
            
            Если СтрДлина(ЧастьСтроки) <= 1 И НЕ СтруктураТипы.ЕстьЦифры Тогда 
                СтрокаСлово.Склонение = "-";
            КонецЕсли;
            СтрокаСлово.Значение = ЧастьСтроки;
            
            Если Метод = "ФИО" Тогда
                Если ПозЧастиСтроки <= МассивЧастиСтроки.ВГраница() - 2 И МассивЧастиСтроки[ПозЧастиСтроки + 1] = "-" Тогда 
                    СтрокаСлово.Тег = "Н"; 
                    СоставноеСлово = Истина;
                Иначе
                    СоставноеСлово = Ложь;
                КонецЕсли; 
                СимволМакроса = Сред(РежимЗапуска, ПозШаблонВход, 1);
                СтрокаСлово.Регистр = РегистрыШаблона[СимволМакроса];
                СтрокаСлово.Субметод = Сред(РежимЗапуска, ПозШаблонВход, 1); 
                СтрокаСлово.Порядок = Найти("ОФИ", СтрокаСлово.Субметод) * 100 + ПозЧастиСтроки; 
            Иначе
                СтрокаСлово.Субметод = Метод;
                СимволМакроса = "С" + Формат(ПозШаблонВход, "ЧЦ=2; ЧВН="); 
                
                Если Метод = "Ч" И ((ПозЧастиСтроки + 1 <= МассивЧастиСтроки.ВГраница() И Найти("/-.", Лев(МассивЧастиСтроки[ПозЧастиСтроки + 1], 1)) > 0)
                    ИЛИ (ПозЧастиСтроки - 1 >= 0 И Найти("/-.", Лев(МассивЧастиСтроки[ПозЧастиСтроки - 1], 1)) > 0)) Тогда
                    СтруктураТипы.Аббревиатура = Истина; 
                КонецЕсли;
                
                Если СтруктураТипы.Аббревиатура Тогда
                    СтрокаСлово.Регистр = РегистрыШаблона.Г + РегистрыШаблона.Г;
                    СтрокаСлово.Склонение = "-"; 
                Иначе
                    СтрокаСлово.Регистр = ?(ПозШаблонВход = 1, РегистрыШаблона.А, РегистрыШаблона.Б) + РегистрыШаблона.В;
                КонецЕсли;
                
                daСклонение("ПросклонятьСлово", ПадежИтоговый, РодСклонения, СтрокаСлово);
            КонецЕсли;
            
            Если НЕ СоставноеСлово Тогда
                ПозШаблонВход = ПозШаблонВход + 1;
                МакросПоУмолчанию = МакросПоУмолчанию + "%" + СимволМакроса;
            КонецЕсли;
            
        КонецЕсли;
        
        ПозЧастиСтроки = ПозЧастиСтроки + 1;
        
    КонецЦикла;
    
    МакросИзШаблона = ?(Метод = "ФИО" И НЕ ПустаяСтрока(МакросИзШаблона), МакросИзШаблона, МакросПоУмолчанию);
    
    Если Метод = "ФИО" Тогда
        Пока ПозШаблонВход <= СтрДлина(РежимЗапуска) Цикл 
            СтрокаСлово = ТаблицаСлова.Добавить();
            СтрокаСлово.Субметод = Сред(РежимЗапуска, ПозШаблонВход, 1);
            СтрокаСлово.Склонение = "-"; 
            ПозШаблонВход = ПозШаблонВход + 1;
        КонецЦикла;
        ТаблицаСлова.Сортировать("Порядок");
    КонецЕсли;
    
    РодНайденный    = ""; 
    
    Для Каждого СтрокаСлово Из ТаблицаСлова Цикл
        
        ПадежСклонения = ПадежИтоговый;
        
        Если СтрокаСлово.Субметод = "Ч" Тогда 
            
            СледИндекс = ТаблицаСлова.Индекс(СтрокаСлово) + 1;
            РодСклонения = РодИтоговый;
            Если СледИндекс <= ТаблицаСлова.Количество() - 1 И НЕ ПустаяСтрока(ТаблицаСлова[СледИндекс].Род) Тогда
                РодСклонения = ТаблицаСлова[СледИндекс].Род;
            КонецЕсли;
            
        ИначеЕсли СтрокаСлово.Субметод = "В" Тогда 
            
            ТипСклонения = "";
            ПредИндекс = ТаблицаСлова.Индекс(СтрокаСлово) - 1;
            Пока ИСТИНА Цикл 
                Если ПредИндекс < 0 Тогда
                    Прервать;
                ИначеЕсли ТаблицаСлова[ПредИндекс].Субметод = "Ч" Тогда
                    ТипСклонения = ТаблицаСлова[ПредИндекс].Тег; 
                    Прервать;
                Иначе
                    ПредИндекс = ПредИндекс - 1;
                КонецЕсли;
            КонецЦикла;
            
            Если ТипСклонения = "1" Тогда 
                РодСклонения = "";
                ПадежСклонения = ПадежИтоговый;
            ИначеЕсли ТипСклонения = "2" Тогда 
                Если Найти("ИВ", ПадежИтоговый) > 0 Тогда
                    РодСклонения = ?(СтрокаСлово.Тег = "Р", "Н", ""); 
                    ПадежСклонения = "Р";
                Иначе    
                    РодСклонения = "Н";
                    ПадежСклонения = ПадежИтоговый;
                КонецЕсли; 
            ИначеЕсли ТипСклонения = "5" Тогда 
                Если Найти("ИВ", ПадежИтоговый) > 0 Тогда
                    РодСклонения = "Н";
                    ПадежСклонения = "Р";
                Иначе    
                    РодСклонения = "Н";
                    ПадежСклонения = ПадежИтоговый;
                КонецЕсли;
            Иначе 
                РодСклонения = СтрокаСлово.Род; 
                ПадежСклонения = ПадежИтоговый;
            КонецЕсли; 
            
        ИначеЕсли СтрокаСлово.Субметод = "Д" И СтрокаСлово.Тег = "К" Тогда 
            
            ТекИндекс = ТаблицаСлова.Индекс(СтрокаСлово);
            Пока ИСТИНА Цикл 
                СледИндекс = ТекИндекс + 1;
                Если ТекИндекс + 1 > ТаблицаСлова.Количество() - 1 ИЛИ ПустаяСтрока(ТаблицаСлова[ТекИндекс + 1].Тег) Тогда 
                    Прервать;
                Иначе
                    Если ТаблицаСлова[СледИндекс].Тег = "П" Тогда 
                        СтрокаСлово.Склонение = "-"; 
                        Прервать;
                    КонецЕсли; 
                    ТекИндекс = ТекИндекс + 1;
                КонецЕсли; 
            КонецЦикла;
            
        КонецЕсли;
        
        daСклонение("ПросклонятьСлово", ПадежСклонения, РодСклонения, СтрокаСлово);
        
        РодНайденный = ?(НЕ ПустаяСтрока(СтрокаСлово.Род), СтрокаСлово.Род, РодНайденный);
        РодСклонения = ?(Метод = "ФИО" И НЕ ПустаяСтрока(РодНайденный), РодНайденный, РодСклонения); 
        
    КонецЦикла;
    
    Если Род = "?" Тогда 
        Род = ?(ПустаяСтрока(РодНайденный), "?", РодНайденный);
    КонецЕсли; 
    
    РодИтоговый = ?(ПустаяСтрока(РодИтоговый), ?(ПустаяСтрока(РодНайденный), "М", РодНайденный), РодИтоговый); 
    РезультатСклонения = "";
    
    Для Каждого СтрокаСлово Из ТаблицаСлова Цикл
        
        daСклонение("ПросклонятьСлово", ПадежИтоговый, РодИтоговый, СтрокаСлово); 
        СтрокаСлово.Значение = daСклонение("ПривестиПоДлинеИРегистру", СтрокаСлово.Значение, СтрокаСлово.Регистр);
        
        Если СтрокаСлово.Тег = "Н" Тогда 
            РезультатСклонения    = РезультатСклонения + СтрокаСлово.Значение + "-";
            Продолжить;
        КонецЕсли;
        
        РезультатСклонения    = РезультатСклонения + СтрокаСлово.Значение;
        
        Если Метод = "ФИО" Тогда
            ЭлементШаблона = "%" + СтрокаСлово.Субметод;
            Если НЕ ЗначениеЗаполнено(СтрокаСлово.Значение) Тогда 
                Поз = Найти(МакросИзШаблона, ЭлементШаблона);
                ЭлементШаблона = ?(Поз > 1 И Сред(МакросИзШаблона, Поз - 1, 1) = " ", " ", "") + ЭлементШаблона + ?(Поз <> 0 И Сред(МакросИзШаблона, Поз + 2, 1) = ".", ".", ""); 
            КонецЕсли;
            РезультатСклонения    = РезультатСклонения + СтрокаСлово.Тег; 
        Иначе
            ЭлементШаблона = "%С" + Формат(ТаблицаСлова.Индекс(СтрокаСлово) + 1, "ЧЦ=2; ЧВН=");
        КонецЕсли;
        
        МакросИзШаблона = СтрЗаменить(МакросИзШаблона, ЭлементШаблона, РезультатСклонения);
        
        РезультатСклонения = "";
        
    КонецЦикла;
    
    Возврат МакросИзШаблона;
	
КонецФункции


Функция ПроверитьИсключенияСклоненийПоПадежам(СтрокаСклонения)
	
	ИсключениеСклонения = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ИсключенияСклоненийПоПадежам.СтрокаСклонения,
	|	ИсключенияСклоненийПоПадежам.Родительный
	|ИЗ
	|	РегистрСведений.ИсключенияСклоненийПоПадежам КАК ИсключенияСклоненийПоПадежам
	|ГДЕ
	|	ИсключенияСклоненийПоПадежам.СтрокаСклонения ПОДОБНО &СтрокаСклонения";
	
	Запрос.УстановитьПараметр("СтрокаСклонения" , СтрокаСклонения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() <> 0 Тогда
		Выборка.Следующий();
		ИсключениеСклонения = Выборка.Родительный;
	КонецЕсли;
	
	Возврат ИсключениеСклонения;
	
КонецФункции	