Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос(
	
	КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() + "
	
	|;
	|ВЫБРАТЬ 	Заказ, СкладОтправитель, СкладПолучатель
	|ИЗ			Документ.ЗаказНаПеремещение
	|ГДЕ		Ссылка = &Ссылка
	|;
	|
	
	// Заказы на перемещения
	
	|ВЫБРАТЬ
	|	&Период						Период,
	|	&ВидДвиженияПриход 			ВидДвижения,
	|	Ссылка.Заказ				Заказ,
	|	Ссылка.СкладОтправитель		СкладОтправитель,
	|	Номенклатура,
	|	Упаковка,
	|	Количество
    |ИЗ
	|	Документ.ЗаказНаПеремещение.Товары
	|
	|ГДЕ
	|	Ссылка = &Ссылка
	|;
	|");
	
	Запрос.УстановитьПараметр("Ссылка", 				Ссылка);
	Запрос.УстановитьПараметр("Период", 				Ссылка.Дата);
	Запрос.УстановитьПараметр("ВидДвиженияПриход", 		ВидДвиженияНакопления.Приход);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ДополнительныеСвойства.Вставить("ПараметрыСистемы", 	КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[0].Выгрузить()));
	ДополнительныеСвойства.Вставить("Шапка", 				КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[1].Выгрузить()));
	ДополнительныеСвойства.Вставить("ЗаказыНаПеремещения", 	Пакет[2].Выгрузить());
	
КонецПроцедуры
