
// СТАНДАРТНЫЕ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КартинкаВкл 	= ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Картинка_32");
	КартинкаОткл 	= ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Картинка_32_откл");
	
КонецПроцедуры
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьКартинку(КартинкаВкл, 	ТекущийОбъект.Картинка_32);
	ЗаписатьКартинку(КартинкаОткл, 	ТекущийОбъект.Картинка_32_откл);
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьКартинку(Адрес, ХранениеВОбъекте);
	
	Если ЭтоАдресВременногоХранилища(Адрес) Тогда
		ХранениеВОбъекте = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Адрес)); КонецЕсли;
	
КонецПроцедуры


// ДИАЛОГ

&НаКлиенте
Функция ПолучитьДВКартинки()
	
	ДВ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДВ.Фильтр = "прозрачная картинка png|*.png";
	
	Возврат ДВ;
	
КонецФункции
&НаКлиенте
Процедура ВыбранаКартинка(ПомещенныеФайлы, ИмяРеквизита) Экспорт
	
	Если ПомещенныеФайлы <> Неопределено Тогда 
		ЭтаФорма[ИмяРеквизита] = ПомещенныеФайлы[0].Хранение;
		Модифицированность = Истина; КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура КартинкаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	НачатьПомещениеФайлов(Новый ОписаниеОповещения("ВыбранаКартинка", ЭтаФорма, Элемент.Имя),,ПолучитьДВКартинки(), Истина, УникальныйИдентификатор);
	
КонецПроцедуры


&НаСервере
Процедура ДобавитьИзДругойМатрицыНаСервере(Матрица)
	
	Запрос = Новый Запрос("ВЫБРАТЬ ИмяПоля ИЗ Справочник.Матрицы.ОбязательныеРеквизиты ГДЕ Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", Матрица);
	КонвертацияТипов.ДобавитьТаблицуКДругойТаблице(Объект.ОбязательныеРеквизиты, Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры
&НаКлиенте
Процедура ВыбранаМатрицаДляКопирования(ВыбМатрица, ДопПараметры) Экспорт
	
	Если ВыбМатрица <> Неопределено Тогда
		ДобавитьИзДругойМатрицыНаСервере(ВыбМатрица) КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ДобавитьИзДругойМатрицы(Команда)
	
	ОткрытьФорму("Справочник.Матрицы.ФормаВыбора",, ЭтаФорма,,,,Новый ОписаниеОповещения("ВыбранаМатрицаДляКопирования", ЭтаФорма));
	
КонецПроцедуры

