
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Партнер = Параметры.Партнер;
	Организация = Параметры.Организация;
	НаДату = Параметры.НаДату;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Рег.Заказ Заказ,
	|	Регистратор ДокументОплаты,
	|	ЕСТЬNULL(Воз.Ссылка, Неопределено) Возврат,
	|	Сумма(Рег.Сумма) Сумма
	|ИЗ
	|	РегистрНакопления.ДолгиПоОтгрузкам Рег
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Документ.ВозвратОтПокупателя Воз
	|ПО 
	|  Рег.Заказ = Воз.ДокументОтгрузки.Заказ
	|и Рег.ВидДвижения=Значение(ВидДвиженияНакопления.Расход)  //оплаты
	|и Рег.Сумма>0                                           //и не возврат
	|и Рег.Период<=&КонецПериода
	|и Рег.Партнер=&Партнер
	|и Рег.Организация=&Организация
	|и Воз.Проведен
	|и Воз.Дата<=&КонецПериода
	|и Воз.Партнер=&Партнер
	|и Воз.Организация=&Организация
	|
	|Сгруппировать по Рег.Заказ,Рег.Регистратор,Воз.Ссылка
	|");
	
	//|ВЫБРАТЬ
	//|	Рег.Заказ,
	//|	Рег.ДокументОплаты,
	//|	ЕСТЬNULL(Воз.Ссылка, Неопределено) Возврат,
	//|	Рег.СуммаОборот Сумма
	//|ИЗ
	//|	РегистрНакопления.Оплаты.Обороты(,&КонецПериода, Авто, ДокументОплаты.Партнер = &Партнер И ДокументОплаты.Организация = &Организация) Рег
	//|	ЛЕВОЕ СОЕДИНЕНИЕ
	//|		(ВЫБРАТЬ Ссылка, ДокументОтгрузки.Заказ Заказ ИЗ Документ.ВозвратОтПокупателя ГДЕ Партнер = &Партнер И Организация = &Организация) Воз
	//|		ПО Рег.Заказ = Воз.Заказ");
	
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("КонецПериода", НаДату);
	
	Таблица.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры
