
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Контрагент = Параметры.Контрагент;
	Организация = Параметры.Организация;
	НаДату = Параметры.НаДату;
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Рег.Заказ Заказ,
	|	Регистратор ДокументОплаты,
	|	ЕСТЬNULL(Воз.Ссылка, Неопределено) Возврат,
	|	Сумма(Рег.Сумма) Сумма
	|ИЗ
	|	РегистрНакопления.ДолгиПоОтгрузкам Рег
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	Документ.ВозвратОтПокупателя Воз
	|ПО 
	|  Рег.Заказ = Воз.ДокументОтгрузки.Заказ
	|и Рег.ВидДвижения=Значение(ВидДвиженияНакопления.Расход)  //оплаты
	|и Рег.Сумма>0                                           //и не возврат
	|и Рег.Период<=&КонецПериода
	|и Рег.Контрагент=&Контрагент
	|и Рег.Организация=&Организация
	|и Воз.Проведен
	|и Воз.Дата<=&КонецПериода
	|и Воз.Контрагент=&Контрагент
	|и Воз.Организация=&Организация
	|
	|Сгруппировать по Рег.Заказ,Рег.Регистратор,Воз.Ссылка
	|");
	
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("КонецПериода", НаДату);
	
	Таблица.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры
