
Функция ПолучитьВыполнениеЗапроса81(Connector, ТекстЗапроса, ПараметрыПодключения = Неопределено, СтруктураПараметров = Неопределено) Экспорт
	
	Запрос = Connector.NewObject("Запрос", ТекстЗапроса);
		
	Если СтруктураПараметров <> Неопределено Тогда
		Для Каждого Параметр Из СтруктураПараметров Цикл Запрос.УстановитьПараметр(СтрЗаменить(Параметр.Ключ, ".",""), Параметр.Значение); КонецЦикла; КонецЕсли;
		
	Попытка
		Выборка = Запрос.Выполнить();
	Исключение
		стрОшибки = ОписаниеОшибки();
		ОбщиеФункции.СообщитьТекст("Ошибка при выполнении запроса в 81
							|" + стрОшибки);
		Возврат Неопределено; КонецПопытки;
		
	Возврат Выборка;
	
КонецФункции


// ЭКСЕЛЬ

Функция ОткрытьФайлЭкселя(ПолноеИмяФайла, стрОшибки = "") Экспорт
	
	Если ПустаяСтрока(ПолноеИмяФайла) Тогда
		стрОшибки = "Не выбрано имя файла";
		Возврат Неопределено;
	КонецЕсли;
	
	Файл = Новый Файл(ПолноеИмяФайла);
	Если Не Файл.Существует() Тогда
		стрОшибки = "Файл не найден """ + ПолноеИмяФайла + """";
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		//Эксель = ПолучитьCOMОбъект(ПолноеИмяФайла, "Excel.Application");
		Эксель = ПолучитьCOMОбъект(ПолноеИмяФайла);
	Исключение
		стрОшибки = ОписаниеОшибки();
		стрОшибки = "Ошибка при открытии файла экселем
						|" + стрОшибки;
		Возврат Неопределено;
	КонецПопытки;
	
	Возврат Эксель;
	
КонецФункции

Процедура ЗакрытьЭксель(Эксель) Экспорт
	
	Эксель = 0;
	
КонецПроцедуры

Функция ПолучитьКоличествоСтрокВЭкселе(Эксель) Экспорт
	
	//Возврат 
	
КонецФункции
