Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	//Запрос = Новый Запрос(
	//
	//КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() + "
	//
	//|;"
	//|ВЫБРАТЬ
	//|	Заказ
	//|ИЗ
	//|	Документ.РедактированиеОтгруженногоЗаказа
	//|ГДЕ
	//|	Ссылка = &Ссылка
	//|;
	//
	//// ТАБЛИЦА ИЗМЕНЕНИЙ
	//
	//|ВЫБРАТЬ
	//|	ЕСТЬNULL(Стало.Номенклатура, 				Было.НоменклатураБыло) Номенклатура,
	//|	ЕСТЬNULL(Стало.Упаковка, 					Было.УпаковкаБыло) Упаковка,
	//|	ЕСТЬNULL(Стало.Цена, 						Было.ЦенаБыло) Цена,
	//|	ЕСТЬNULL(Стало.Размещение, 					Было.РазмещениеБыло) Размещение,
	//|	ЕСТЬNULL(Стало.ПроцентРучнойСкидки, 		Было.ПроцентРучнойСкидкиБыло) ПроцентРучнойСкидки,
	//|	ЕСТЬNULL(Стало.ПроцентАвтоматическойСкидки, Было.ПроцентАвтоматическойСкидкиБыло) ПроцентАвтоматическойСкидки,
	//|	ЕСТЬNULL(Стало.СтавкаНДС, 					Было.СтавкаНДСБыло) СтавкаНДС,
	//|	СУММА(ЕСТЬNULL(Было.Количество,0) - ЕСТЬNULL(Стало.Количество, 0)) 	Количество,
	//|	СУММА(ЕСТЬNULL(Было.Сумма,0) - ЕСТЬNULL(Стало.Сумма, 0)) 			Сумма
	//|ИЗ
	//|	Документ.РедактированиеОтгруженногоЗаказа.Товары Стало
	//|
	//|ПОЛНОЕ СОЕДИНЕНИЕ
	//|	Документ.РедактированиеОтгруженногоЗаказа.Товары Было
	//|ПО
	//|	Было.Ссылка = &Ссылка И
	//|	Было.Номенклатура = Стало.Номенклатура И
	//|	Было.Упаковка = Стало.Упаковка И
	//|	Было.Цена = Стало.Цена И
	//|	Было.Размещение = Стало.Размещение И
	//|	Было.ПроцентРучнойСкидки = Стало.ПроцентРучнойСкидки И
	//|	Было.ПроцентАвтоматическойСкидки = Стало.ПроцентАвтоматическойСкидки
	//|
	//|ГДЕ
	//|	Ссылка = &Ссылка
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	Ссылка,
	//|	Номенклатура,
	//|	Упаковка,
	//|	Цена,
	//|	Размещение,
	//|	ПроцентРучнойСкидки,
	//|	ПроцентАвтоматическойСкидки,
	//|	СтавкаНДС
	//|ИМЕЮЩИЕ
	//|	СУММА(Количество) <> 0 И
	//|	СУММА(Сумма) <> 0
	//|
	//|;"
	//
	//// ТОВАРЫ В РЕЗЕРВЕ
	//
	//|ВЫБРАТЬ
	//|	&Период				КАК Период,
	//|	ВЫБОР КОГДА Ссылка.ВидДвиженияРасход = ИСТИНА ТОГДА &ВидДвиженияРасход ИНАЧЕ &ВидДвиженияПриход КОНЕЦ ВидДвижения,
	//|	Размещение,
	//|	Ссылка.Заказ		КАК ДокументРезерва,
	//|	Номенклатура,
	//|	Цена,
	//|	ВЫБОР КОГДА Упаковка = &ПустаяУпаковка ТОГДА
	//|		СУММА(Количество)	
	//|	ИНАЧЕ
	//|		СУММА(Количество)*Упаковка.Коэффициент
	//|	КОНЕЦ	            КАК Количество,
	//|	СУММА(Сумма)		КАК Сумма
	//|ИЗ
	//|	Документ.КорректировкаЗаказаПокупателя.Товары
	//|
	//|ГДЕ
	//|	Ссылка = &Ссылка И
	//|	Размещение ССЫЛКА Справочник.Склады  И
	//|	ЕСТЬNULL(Размещение, &ПустойСклад) <> &ПустойСклад
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВЫБОР КОГДА Ссылка.ВидДвиженияРасход = ИСТИНА ТОГДА &ВидДвиженияРасход ИНАЧЕ &ВидДвиженияПриход КОНЕЦ,
	//|	Размещение,
	//|	Номенклатура,
	//|	Упаковка,
	//|	Цена,
	//|	Ссылка.Заказ
	//|;
	//
	//// РАЗМЕЩЕНИЕ ЗАКАЗОВ
	//
	//|ВЫБРАТЬ
	//|	&Период				КАК Период,
	//|	ВЫБОР КОГДА Ссылка.ВидДвиженияРасход = ИСТИНА ТОГДА &ВидДвиженияРасход ИНАЧЕ &ВидДвиженияПриход КОНЕЦ ВидДвижения,
	//|	Размещение 			КАК Очередь,
	//|	Ссылка.Заказ		КАК Заказ,
	//|	Номенклатура,
	//|	Упаковка,
	//|	СУММА(Количество)	КАК Количество,
	//|	СУММА(Сумма)		КАК Сумма
	//|ИЗ
	//|	Документ.КорректировкаЗаказаПокупателя.Товары
	//|
	//|ГДЕ
	//|	Ссылка = &Ссылка И
	//|	НЕ Размещение ССЫЛКА Справочник.Склады И Размещение <> Неопределено И ЕСТЬNULL(Размещение, 0) <> 0
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	ВЫБОР КОГДА Ссылка.ВидДвиженияРасход = ИСТИНА ТОГДА &ВидДвиженияРасход ИНАЧЕ &ВидДвиженияПриход КОНЕЦ,
	//|	Размещение,
	//|	Ссылка.Заказ,
	//|	Номенклатура,
	//|	Упаковка
	//|;
	//
	//// ДОЛГИ ПО ОТГРУЗКАМ
	//
	//|ВЫБРАТЬ 
	//|	ДокументОтгрузки,
	//|	-СуммаОстаток Сумма
	//|ИЗ
	//|	РегистрНакопления.ДолгиПоОтгрузкам.Остатки(&Период, 
	//|									Организация = &Организация И 
	//|									Партнер 	= &Партнер И 
	////|									Контрагент 	= &Контрагент И 
	//|									Заказ 		= НЕОПРЕДЕЛЕНО)
	//|ГДЕ
	//|	СуммаОстаток < 0
	//|;
	//|
	//|ВЫБРАТЬ								// движение по долгу
	//|	&Период				Период,
	//|	&ВидДвиженияПриход	ВидДвижения,
	//|	НЕОПРЕДЕЛЕНО		ДокументОтгрузки,
	//|	Заказ.Организация	Организация,
	//|	Заказ.Партнер		Партнер,
	//|	Заказ.Контрагент	Контрагент,
	//|	Заказ				Заказ,
	//|	Сумма				Сумма
	//|ИЗ
	//|	Документ.КорректировкаЗаказаПокупателя
	//|ГДЕ
	//|	Ссылка = &Ссылка И Сумма <> 0
	//|
	//|");
	//
	//Запрос.УстановитьПараметр("Организация", 			Ссылка.Заказ.Организация);
	//Запрос.УстановитьПараметр("Партнер", 				Ссылка.Заказ.Партнер);
	//Запрос.УстановитьПараметр("Контрагент", 			Ссылка.Заказ.Контрагент);
	//Запрос.УстановитьПараметр("СуммаДокумента", 		Ссылка.Сумма);
	//Запрос.УстановитьПараметр("Заказ", 					Ссылка.Заказ);
	//
	//Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	//Запрос.УстановитьПараметр("Период", 			Ссылка.Дата);
	//Запрос.УстановитьПараметр("ВидДвиженияПриход", 	ВидДвиженияНакопления.Приход);
	//Запрос.УстановитьПараметр("ВидДвиженияРасход", 	ВидДвиженияНакопления.Расход);
	//Запрос.УстановитьПараметр("ПустойСклад", 		Справочники.Склады.ПустаяСсылка());
	//Запрос.УстановитьПараметр("ПустаяУпаковка", 	Справочники.УпаковкиНоменклатуры.ПустаяСсылка());
	//
	//Пакет = Запрос.ВыполнитьПакет();
	//ПараметрыСистемы = КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[0].Выгрузить());
	//
	//ДополнительныеСвойства.Вставить("ПараметрыСистемы", 	ПараметрыСистемы);
	//ДополнительныеСвойства.Вставить("Шапка", 				КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[1].Выгрузить()));
	//ДополнительныеСвойства.Вставить("ЗаказыПокупателей", 	Пакет[2].Выгрузить());
	//ДополнительныеСвойства.Вставить("ТоварыВРезерве", 		Пакет[3].Выгрузить());
	//ДополнительныеСвойства.Вставить("РазмещениеЗаказов", 	Пакет[4].Выгрузить());
	//
	//// Разнесем оплату
	//
	//ДолгиПоОтгрузкам = Пакет[6].Выгрузить();
	//
	//Если ПараметрыСистемы.ДолгиПоОтгрузкамУчитываютАвансы Тогда // уменьшем на аванс сумму
	//	Заказы.РазнестиОплатуАвансовЗаказаПриПроведении(ДолгиПоОтгрузкам, Пакет[5].Выбрать(), Ссылка.Заказ);
	//КонецЕсли;
	//
	//ДополнительныеСвойства.Вставить("ДолгиПоОтгрузкам", ДолгиПоОтгрузкам);
	
КонецПроцедуры
