
Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	ИменаРегистров = Новый Массив;
	ПоВсем=Ложь;
	Если Не ДополнительныеСвойства.Свойство("ИменаРегистров",ИменаРегистров) Тогда
		ПоВсем=Истина;
		ИменаРегистров = Новый Массив;
	КонецЕсли;	
	
	
	ТекстЗапроса=КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() +Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
	"
	|ВЫБРАТЬ
	|	Партнер, Контрагент
	|ИЗ
	|	Документ.ПлатежноеПоручениеИсходящее
	|ГДЕ
	|	Ссылка = &Ссылка
	|;
	|" + 
	РаботаСКурсамиВалют.ПолучитьТекстЗапросаКурсыВалют();
	
	
	Нтаб=Новый Структура;
	ТекНомер=2;	
		
	Если ИменаРегистров.Найти("Взаиморасчеты")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("Взаиморасчеты",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+

		"ВЫБРАТЬ
		|	&Период					КАК Период,
		|	&ВидДвиженияПриход		КАК ВидДвижения,
		|	Док.Организация			КАК Организация,
		|	Док.Партнер				КАК Партнер,
		|	Док.Контрагент			КАК Контрагент,
		|	ВЫБОР 
		|		КОГДА ВидОперации = &ВозвратПокупателя 	ТОГДА ЗНАЧЕНИЕ(Перечисление.ФормаОтношений.Клиент)
		|		КОГДА ВидОперации = &ОплатаПоставщику  ТОГДА ЗНАЧЕНИЕ(Перечисление.ФормаОтношений.Поставщик)
		|		ИНАЧЕ Неопределено
		|	КОНЕЦ 					ФормаОтношений,
		|	Док.Сумма				Сумма, " + 
			РаботаСКурсамиВалют.ПолучитьСуммуУпрВЗапросе("Док.Сумма") + " КАК СуммаУпр
		|
		|ИЗ
		|	Документ.ПлатежноеПоручениеИсходящее Док
		|	ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют ПО ИСТИНА
		|ГДЕ
		|	Док.Ссылка = &Ссылка И Док.ВидОперации В (&ОперацииДляВзаиморасчетов) И НЕ БезВзаиморасчетов"
	КонецЕсли;	
	
	
	Если ИменаРегистров.Найти("ДенежныеСредства")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ДенежныеСредства",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		"ВЫБРАТЬ
		|	&Период						КАК Период,
		|	&ВидДвиженияРасход			КАК ВидДвижения,
		|	БанковскийСчетОрганизации	КАК Касса,
		|	Сумма
		|ИЗ
		|	Документ.ПлатежноеПоручениеИсходящее
		|
		|ГДЕ
		|	Ссылка = &Ссылка"
	КонецЕсли;	
	
	
	Если ИменаРегистров.Найти("ОборотыДенежныхСредств")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ОборотыДенежныхСредств",ТекНомер);
		
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		"ВЫБРАТЬ
		|	&Период								КАК Период,
		|	Док.БанковскийСчетОрганизации		КАК КассаСчет,
		|	Док.СтатьяДвиженияДенежныхСредств   КАК СтатьяДДС,
		|	Подразделение, Отдел, ЦФУ,
		|	ВЫБОР 
		|		КОГДА Док.ФизЛицо = ЗНАЧЕНИЕ(Справочник.ФизическиеЛица.ПустаяСсылка) 
		|		ТОГДА Док.Контрагент							
		|		ИНАЧЕ Док.ФизЛицо				КОНЕЦ ФизЛицоПартнер,
		|	- Док.Сумма						  	КАК	Сумма, 
		|" + РаботаСКурсамиВалют.ПолучитьСуммуУпрВЗапросе("-Док.Сумма") + " КАК СуммаУпр
		|                          
		|ИЗ
		|	Документ.ПлатежноеПоручениеИсходящее Док
		|	ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют ПО ИСТИНА
		|ГДЕ
		|	Ссылка = &Ссылка"
	КонецЕсли;	
	
	
	//Если ИменаРегистров.Найти("Оплаты")<>Неопределено ИЛИ ПоВсем Тогда
	//	ТекНомер=ТекНомер+1;
	//	Нтаб.Вставить("Оплаты",ТекНомер);
	//	
	//	ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
	//	"ВЫБРАТЬ
	//	|	&Период			Период,
	//	|	&Ссылка		ДокументОплаты,
	//	|	Ссылка.Партнер,
	//	|	Ссылка.Организация,
	//	|	Заказ,
	//	|	-СУММА(Сумма) Сумма
	//	|ИЗ
	//	|	Документ.ПлатежноеПоручениеИсходящее.РасшифровкаСуммы
	//	|ГДЕ
	//	|	Ссылка = &Ссылка И &ЭтоВозвратПокупателю И Заказ <> Неопределено //И ДокументОплаты <> Неопределено
	//	|СГРУППИРОВАТЬ ПО
	//	|	Ссылка,
	//	|	Заказ"
	//КонецЕсли;	
	//
	//
	//Если ИменаРегистров.Найти("Авансы")<>Неопределено ИЛИ ПоВсем Тогда
	//	ТекНомер=ТекНомер+1;
	//	Нтаб.Вставить("Авансы",ТекНомер);
	//	
	//	ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
	//	"ВЫБРАТЬ
	//	|	&Период				Период,
	//	|	&ВидДвиженияПриход	ВидДвижения,
	//	|	Ссылка.Организация	Организация,
	//	|	Ссылка.Партнер		Партнер,
	//	|	Ссылка		ДокументОплаты,
	//	|	-СУММА(Сумма)		Сумма
	//	|ИЗ
	//	|	Документ.ПлатежноеПоручениеИсходящее.РасшифровкаСуммы
	//	|ГДЕ
	//	|	Ссылка = &Ссылка И &ЭтоВозвратПокупателю И Заказ = Неопределено //И ДокументОплаты <> Неопределено
	//	|СГРУППИРОВАТЬ ПО Ссылка"
	//КонецЕсли;	
	
	
	//Если ИменаРегистров.Найти("ДолгиКонтрагентов")<>Неопределено ИЛИ ПоВсем Тогда
	//	ТекНомер=ТекНомер+1;
	//	Нтаб.Вставить("ДолгиКонтрагентов",ТекНомер);
	//	
	//	ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
	//	"ВЫБРАТЬ 
	//	|	&ВидОперацииОплата ВидОперации, &ФормаОтношений ФормаОтношений, Док.Организация, Док.Контрагент, Ссылка Документ, Док.Дата Дата, Док.Дата Период,
	//	|	ЕСТЬNULL(СуммаУпрОстаток, 0) + " + РаботаСКурсамиВалют.ПолучитьСуммуУпрВЗапросе("Док.Сумма") + " Сумма
	//	|ИЗ
	//	|	РегистрНакопления.Взаиморасчеты.Остатки(&Период, Организация = &Организация И Контрагент = &Контрагент)
	//	|
	//	|ПРАВОЕ СОЕДИНЕНИЕ
	//	|	(ВЫБРАТЬ Дата, Организация, Контрагент, Ссылка, Сумма ИЗ Документ.ПлатежноеПоручениеИсходящее ГДЕ Ссылка = &Ссылка И НЕ БезВзаиморасчетов) Док
	//	|ПО ИСТИНА
	//	|
	//	|ЛЕВОЕ СОЕДИНЕНИЕ КурсыВалют ПО ИСТИНА"
	//КонецЕсли;	
	
	
	Если ИменаРегистров.Найти("ДолгиПоОтгрузкам")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ДолгиПоОтгрузкам",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		"ВЫБРАТЬ
		|	&Период				Период,
		|	&ВидДвиженияРасход 	ВидДвижения,
		|	Док.Организация КАК Организация,
		|	Док.Партнер КАК Партнер,
		|	Док.Контрагент КАК Контрагент,
		|	Расшифровка.Заказ КАК Заказ,
		|	Расшифровка.ДокументОтгрузки	КАК ДокументОтгрузки,
		|	-ЕСТЬNULL(Расшифровка.Сумма, Док.Сумма) КАК Сумма
		|ИЗ
		|	Документ.ПлатежноеПоручениеИсходящее КАК Док
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			Расшифровка.Заказ КАК Заказ,
		|			Расшифровка.ДокументОтгрузки КАК ДокументОтгрузки,
		|			Расшифровка.Сумма КАК Сумма
		|		ИЗ
		|			Документ.ПлатежноеПоручениеИсходящее.РасшифровкаСуммы КАК Расшифровка
		|		ГДЕ
		|			Расшифровка.Ссылка = &Ссылка) КАК Расшифровка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	Док.Ссылка = &Ссылка
		|	И Док.ВидОперации = &ВозвратПокупателя"
	КонецЕсли;	
	
	
	Если ИменаРегистров.Найти("ДолгиПоЗаказам")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ДолгиПоЗаказам",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		"ВЫБРАТЬ
		|	&Период				Период,
		|	&ВидДвиженияРасход 	ВидДвижения,
		|	Док.Организация 				КАК Организация,
		|	Док.Партнер 					КАК Партнер,
		|	Док.Контрагент 					КАК Контрагент,
		|	&Менеджер	 					КАК Менеджер,
		|	Расшифровка.Заказ 				КАК Заказ,
		|	-ЕСТЬNULL(Расшифровка.Сумма, Док.Сумма) КАК Сумма
		|ИЗ
		|	Документ.ПлатежноеПоручениеИсходящее КАК Док
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			Расшифровка.Заказ КАК Заказ,
		|			Расшифровка.Сумма КАК Сумма
		|		ИЗ
		|			Документ.ПлатежноеПоручениеИсходящее.РасшифровкаСуммы КАК Расшифровка
		|		ГДЕ
		|			Расшифровка.Ссылка = &Ссылка) КАК Расшифровка
		|		ПО (ИСТИНА)
		|ГДЕ
		|	Док.Ссылка = &Ссылка
		|	И Док.ВидОперации = &ВозвратПокупателя"
	КонецЕсли;	
	
	
	
	
	
	Запрос=Новый Запрос;
	Запрос.Текст=ТекстЗапроса;
	
	ОперацииДляВзаиморасчетов = Новый Массив;
	ОперацииДляВзаиморасчетов.Добавить(Перечисления.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику);
	ОперацииДляВзаиморасчетов.Добавить(Перечисления.ВидыОперацийСписаниеДенежныхСредств.ВозвратПокупателю);
	
	//Запрос.УстановитьПараметр("Область", 			ПараметрыСеанса.ТекущаяОбласть);
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("Период", 			Ссылка.Дата);
	Запрос.УстановитьПараметр("Валюта", 			Ссылка.Валюта);
	Запрос.УстановитьПараметр("Менеджер", 			Справочники.Контрагенты.ПолучитьОсновногоМенеджераПартнера(Ссылка.Дата, Ссылка.Контрагент));

	Запрос.УстановитьПараметр("ВидДвиженияПриход", 	ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("ВидДвиженияРасход", 	ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("ЭтоВозвратПокупателю", Ссылка.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ВозвратПокупателю);
	Запрос.УстановитьПараметр("ОплатаПоставщику",	Перечисления.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику);
	Запрос.УстановитьПараметр("ВозвратПокупателя",	Перечисления.ВидыОперацийСписаниеДенежныхСредств.ВозвратПокупателю);

	Запрос.УстановитьПараметр("Организация", 		Ссылка.Организация);
	Запрос.УстановитьПараметр("Контрагент", 		Ссылка.Контрагент);
	Запрос.УстановитьПараметр("ВидОперацииОплата", 	Перечисления.ВидыОперацийВзаиморасчетов.Оплата);
	Запрос.УстановитьПараметр("ФормаОтношений", 	?(Ссылка.ВидОперации = Перечисления.ВидыОперацийСписаниеДенежныхСредств.ВозвратПокупателю, Перечисления.ФормаОтношений.Клиент, Перечисления.ФормаОтношений.Поставщик));
	
	Запрос.УстановитьПараметр("ОперацииДляВзаиморасчетов", 	ОперацииДляВзаиморасчетов);
	
	Пакет = Запрос.ВыполнитьПакет();
	
	ДополнительныеСвойства.Вставить("ПараметрыСистемы", КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[0].Выгрузить()));
	ДополнительныеСвойства.Вставить("Шапка", 			КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[1].Выгрузить()));
	
	Для Каждого Элем Из Нтаб Цикл
		ДополнительныеСвойства.Вставить(Элем.Ключ,Пакет[Элем.Значение].Выгрузить());
	КонецЦикла;	
	
	//ДополнительныеСвойства.Вставить("Взаиморасчеты", 	Пакет[3].Выгрузить());
	//ДополнительныеСвойства.Вставить("ДенежныеСредства", Пакет[4].Выгрузить());
	//ДополнительныеСвойства.Вставить("ОборотыДенежныхСредств", Пакет[5].Выгрузить());
	//ДополнительныеСвойства.Вставить("Оплаты", Пакет[6].Выгрузить());
	//ДополнительныеСвойства.Вставить("Авансы", Пакет[7].Выгрузить());
	//
	//ДополнительныеСвойства.Вставить("ДолгиКонтрагентов", Пакет[8].Выгрузить());
	//ДополнительныеСвойства.Вставить("ДолгиПоОтгрузкам", Пакет[9].Выгрузить());
	//ДополнительныеСвойства.Вставить("ДолгиПоЗаказам", Пакет[10].Выгрузить());
	
КонецПроцедуры
