
&НаСервере
Процедура ОбновитьJSON()
	
	Структура = Новый Структура;
	Для Каждого Реквизиты ИЗ Метаданные.Обработки.ТестМатаМата.Реквизиты Цикл 
		Если ЗначениеЗаполнено(Объект[Реквизиты.Имя]) Тогда
			Структура.Вставить(Реквизиты.Имя, Объект[Реквизиты.Имя]) КонецЕсли; КонецЦикла;
	
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку(Новый ПараметрыЗаписиJSON(,"  "));
	ЗаписатьJSON(Запись, Структура,, "ПреобразоватьJSON", МатаМата);
	стрЗапрос = Запись.Закрыть();
	
КонецПроцедуры


&НаКлиенте
Процедура ПриИзменении(Элемент)
	
	ОбновитьJSON();
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСервере()
	
	стрОтвет = МатаМата.ПолучитьПередачиТовараPOST(, стрЗапрос);
	
КонецПроцедуры
&НаКлиенте
Процедура Отправить(Команда)
	
	ОтправитьНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьJSON();
	
КонецПроцедуры
