
Функция ПолучитьСписокУстановленногоОборудования(ИмяКомпьютера) Экспорт
	
	// Возвращает соответствие
	// в которой в ключе перечисление оборудования (перечисление.)
	// в значении настройки
	
	Оборудование = Новый Соответствие;
	
	Запрос = Новый Запрос("ВЫБРАТЬ Оборудование, Настройки ИЗ РегистрСведений.ВнешнееОборудование ГДЕ ИмяКомпьютера = """ + ИмяКомпьютера + """");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Настройки = ЗначениеИзСтрокиВнутр(Выборка.Настройки);
		Оборудование.Вставить(Выборка.Оборудование, ?(ПустаяСтрока(Настройки),Новый Структура, Настройки));
		
	КонецЦикла;
	
	Возврат Оборудование;
	
КонецФункции

Функция ПолучитьНастройкиОборудования(Оборудование, ИмяКомпьютера) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ Оборудование, Настройки ИЗ РегистрСведений.ВнешнееОборудование ГДЕ Оборудование = &Оборудование И ИмяКомпьютера = """ + ИмяКомпьютера + """");
	Запрос.УстановитьПараметр("Оборудование", Оборудование);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Возврат ЗначениеИзСтрокиВнутр(Выборка.Настройки);
		
	КонецЕсли;

КонецФункции

Функция ПолучитьНастройкиМашины(ИмяКомпьютера) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ * ИЗ РегистрСведений.НастройкиМашины ГДЕ ИмяКомпьютера ПОДОБНО """ + ИмяКомпьютера + """");
	Возврат КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Запрос.Выполнить().Выгрузить());
	
КонецФункции