
Функция СинхронизироватьОбъектПоСсылке81_Ст(стрМетаданного81, УникальныйИдентификаторИлиСтруктураОбъекта, ФормироватьНовый = Истина, стрОшибки = "") Экспорт
	
	// ФормироватьНовый - если отсутствует, тогда формируеться новый объект
	
	//Если стрМетаданного81 = "Справочник.Номенклатура" Тогда
	//	
	//	Возврат COMServer.СинхронизироватьОбъект(
	//				УникальныйИдентификатор,
	//				КэшируемыеФункции.ПолучитьПравилаСопостовленияУТ81(Справочники.ПравилаОбмена.Номенклатура),,
	//				стрОшибки);
	//				
	//Иначе	// Поиимщем правило
					
		Правило = КэшируемыеФункции.ПолучитьПравилаСопостовленияУТ81Поимени81(стрМетаданного81, стрОшибки);
					
		Если Правило = Неопределено Тогда
		
			стрОшибки = "Нет правила синхронизации для метаобъекта """ + стрМетаданного81 + """
					|правило нужно прописать в модуле внешнего соединения 8.2 - функция ""ИзменитьСправочник""
					|{" + стрОшибки + "}
					|";
			Возврат Ложь;
			
		Иначе
			
			СтруктураОбъекта = ЗначениеИзСтрокиВнутр(УникальныйИдентификаторИлиСтруктураОбъекта);
			
			Попытка
				СинхронизацияУдалась = COMServer.СинхронизироватьОбъект_ПоОбъектуСтруктуре(
						СтруктураОбъекта,
			//Возврат COMServer.СинхронизироватьОбъект(
			//			УникальныйИдентификаторИлиСтруктураОбъекта,
						Правило,,
						стрОшибки);
			Исключение
				стрОшибки = ОписаниеОшибки();
				СинхронизацияУдалась = Ложь;
			КонецПопытки;
			
			Если не СинхронизацияУдалась Тогда			
				
				ЗаписьЖурналаРегистрации(
					"COMConnector.Синхронизация объекта", 
					УровеньЖурналаРегистрации.Ошибка,,,
					"Ошибка при синхронизации 8.2
							|" + стрОшибки);
			Иначе
							
				ЗаписьЖурналаРегистрации(
					"COMConnector.Синхронизация объекта", 
					УровеньЖурналаРегистрации.Информация,,,
					"Синхронизирован объект: 
					|Путь: " + стрМетаданного81 + "
					|Ид: " + СтруктураОбъекта.Ссылка);
					
			КонецЕсли;
			
			Возврат СинхронизацияУдалась;
			
		КонецЕсли;
	//КонецЕсли;
	//	
	//Возврат Истина;
	
КонецФункции
Функция СинхронизироватьОбъектПоСсылке81(стрМетаданного81, УникальныйИдентификаторИлиСтруктураОбъекта, ФормироватьНовый = Истина, стрОшибки = "") Экспорт
	
	// Отличается тем что правил может быть несколько и тогда синхронизация будет по всем правилам
                  
	
	Правила = КэшируемыеФункции.ПолучитьВсеПравилаСопостовленияУТ81Поимени81(стрМетаданного81, стрОшибки);
	
	Для Каждого Правило Из Правила Цикл
	
		СтруктураОбъекта = ЗначениеИзСтрокиВнутр(УникальныйИдентификаторИлиСтруктураОбъекта);
			
		Попытка
			СинхронизацияУдалась = COMServer.СинхронизироватьОбъект_ПоОбъектуСтруктуре(
						СтруктураОбъекта,
						Правило,,
						стрОшибки);
		Исключение
			опОшибки = ОписаниеОшибки();
			стрОшибки = стрОшибки + " " + опОшибки;
			СинхронизацияУдалась = Ложь;
		КонецПопытки;
			
		Если не СинхронизацияУдалась Тогда			
			
			ЗаписьЖурналаРегистрации(
				"COMConnector.Синхронизация объекта", 
				УровеньЖурналаРегистрации.Ошибка,,,
				"Ошибка при синхронизации 8.2
						|" + стрОшибки);
			Возврат Ложь;
			
		Иначе
							
			ЗаписьЖурналаРегистрации(
				"COMConnector.Синхронизация объекта", 
				УровеньЖурналаРегистрации.Информация,,,
				"Синхронизирован объект: 
				|Путь: " + стрМетаданного81 + "
				|Ид: " + СтруктураОбъекта.Ссылка);
				
		КонецЕсли;
			
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

Функция СинхронизироватьРегистрПоСсылке81(стрМетаданного81, стрСсылка81, стрОшибки) Экспорт
	
	Если стрМетаданного81 = "Справочник.Контрагенты" ИЛИ стрМетаданного81 = "Справочник.ФизическиеЛица" ИЛИ стрМетаданного81 = "Справочник.КонтактныеЛицаКонтрагентов" Тогда
		
		Попытка
			COMServer.ВыполнитьСинхронизациюКонтактнойИнформации(стрМетаданного81, стрСсылка81, стрОшибки);
			ЗаписьЖурналаРегистрации(
				"COMConnector.Синхронизация объекта", 
				УровеньЖурналаРегистрации.Ошибка,,,
				"при синхронизации 8.2
						|" + стрОшибки + " * " + стрМетаданного81 + " * " + стрСсылка81);
		Исключение                                                     
			стрОшибки = ОписаниеОшибки();
			ЗаписьЖурналаРегистрации(
				"COMConnector.Синхронизация объекта", 
				УровеньЖурналаРегистрации.Ошибка,,,
				"ОШИБКА при синхронизации 8.2
						|" + стрОшибки + " * " + стрМетаданного81 + " * " + стрСсылка81);
			
			Возврат Ложь;
		КонецПопытки;

	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции
