&НаКлиенте
Перем мФормаРашифровки;

&НаСервере
Процедура ОбновитьОстатки(ТекТовар)
	
	Остатки.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Склад,
	|	СУММА(Остаток) 	КАК Остаток,
	|	СУММА(Резерв) 	КАК Резерв
	|ИЗ
	|(
	|	ВЫБРАТЬ
	|		Склад 				КАК Склад,
	|		КоличествоОстаток 	КАК Остаток,
	|		0					КАК Резерв
	|	ИЗ
	|		РегистрНакопления.ТоварыНаСкладах.Остатки(, Номенклатура = &ВыбТовар)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		Размещение,
	|		0,
	|		КоличествоОстаток
	|	ИЗ
	|		РегистрНакопления.ТоварыВРезерве.Остатки(, Номенклатура = &ВыбТовар)
	|
	|) КАК Запрос
	|
	|СГРУППИРОВАТЬ ПО
	|	Склад";
	
	Запрос.УстановитьПараметр("ВыбТовар", ТекТовар);
	Выборка82 = Запрос.Выполнить().Выбрать();
	    
	Connector = КэшируемыеФункции.ИницилизироватьCOMConnector81();
	
	Если Connector <> Неопределено Тогда
		
		ГУИД82 		=  Строка(ТекТовар.УникальныйИдентификатор());
		Ссылка81 	= Connector.Справочники.Номенклатура.ПолучитьСсылку(Connector.NewObject("UUID", ГУИД82));
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ВыбТовар", Ссылка81);
		
		ТекстЗапроса = "
		|ВЫБРАТЬ
		|	Склад,
		|	СУММА(Остаток) 	КАК Остаток,
		|	СУММА(Резерв) 	КАК Резерв
		|ИЗ
		|(
		|	ВЫБРАТЬ
		|		Склад 				КАК Склад,
		|		КоличествоОстаток 	КАК Остаток,
		|		0					КАК Резерв
		|	ИЗ
		|		РегистрНакопления.ТоварыНаСкладах.Остатки(, Номенклатура = &ВыбТовар)
		|
		|	ОБЪЕДИНИТЬ ВСЕ
		|
		|	ВЫБРАТЬ
		|		Склад,
		|		0,
		|		КоличествоОстаток
		|	ИЗ
		|		РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(, Номенклатура = &ВыбТовар)
		|
		|) КАК Запрос
		|
		|СГРУППИРОВАТЬ ПО
		|	Склад";
		
	 	РезультатЗапроса81 = COMServer.ПолучитьВыполнениеЗапроса81(ТекстЗапроса, , СтруктураПараметров,);
		Если РезультатЗапроса81 <> Неопределено Тогда
			
			Выборка81 = РезультатЗапроса81.Выбрать();
				
		КонецЕсли;
		
		Пока Выборка81.Следующий() Цикл
			
			ГУИД81 = Connector.String(Выборка81.Склад.УникальныйИдентификатор());
			ТекущийСклад = Справочники.Склады.ПолучитьСсылку(Новый УникальныйИдентификатор(ГУИД81));
			
			СтрокаОстатки = Остатки.Добавить();
			СтрокаОстатки.Склад 	= ТекущийСклад;
            СтрокаОстатки.Остаток81 = Выборка81.Остаток;
			СтрокаОстатки.Резерв81 	= Выборка81.Резерв;
			
			Пока Выборка82.Следующий() Цикл
				
				Если Выборка82.Склад = ТекущийСклад Тогда
					СтрокаОстатки.Остаток82 = Выборка82.Остаток;
					СтрокаОстатки.Резерв82 	= Выборка82.Резерв;
					Выборка82.Сбросить();
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТоваровПриАктивизацииСтроки(Элемент)
	
	ТекДанные = Элементы.СписокТоваров.ТекущиеДанные;
	
	Если 	ТекДанные <> Неопределено И
			ТекДанные.Ссылка <> Неопределено И 
			Не ТекДанные.ЭтоГруппа Тогда
			
		ОбновитьОстатки(ТекДанные.Ссылка);
		
		Если мФормаРашифровки <> Неопределено Тогда
			мФормаРашифровки.ВыбраннаяНоменклатура = ТекДанные.Ссылка;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРегистрРезервы(Команда)
	
	ОткрытьФорму("РегистрСведенья.ТоварыВРезерве.ФормаСписка", Новый Структура("Объект", Объект));
	
КонецПроцедуры

&НаКлиенте
Процедура ДвижениеРезервы(Команда)
	
	Если мФормаРашифровки = Неопределено Тогда
		
		мФормаРашифровки = ПолучитьФорму("Обработка.СравнениеДвиженийС81.Форма.РасшифровкаРезервов",,ЭтаФорма);
				
	КонецЕсли;
	
	Объект.ВыбраннаяНоменклатура = Элементы.СписокТоваров.ТекущаяСтрока;
	мФормаРашифровки.Открыть();
	
	мФормаРашифровки.ВыбраннаяНоменклатура = Элементы.СписокТоваров.ТекущаяСтрока;
	мФормаРашифровки.ОбновитьРашифровку();
	
КонецПроцедуры
