&НаСервере
Функция ВытащитьВнутрЗаказИзЗадачи(СсылкаЗадача)
	
	Если НЕ СсылкаЗадача.БизнесПроцесс.Пустая() И
			(	СсылкаЗадача.ТочкаМаршрута = БизнесПроцессы.ПеремещениеТоваров.ТочкиМаршрута.ПринятьТовар Или
				СсылкаЗадача.ТочкаМаршрута = БизнесПроцессы.ПеремещениеТоваров.ТочкиМаршрута.ОтправитьТовар) Тогда
				
		//Если ТипЗнч(СсылкаЗадача.БизнесПроцесс) = Тип("БизнесПроцессСсылка.ПеремещениеТоваров") Тогда // у внутреннего заказа
		//	
		//	Возврат СсылкаЗадача.Заказ;
		//	
		//Иначе																					// у обычных заказов
		//		
			Запрос = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Документ.ВнутреннийЗаказ ГДЕ Заказчик = &Сборка И НЕ ПометкаУдаления И Проведен");
			Запрос.УстановитьПараметр("Сборка", СсылкаЗадача.БизнесПроцесс.Заказчик);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Возврат Выборка.Ссылка; 
			Иначе
				Возврат СсылкаЗадача.Заказ; КонецЕсли; КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//ТабДок = Новый ТабличныйДокумент;
	
	Если ТипЗнч(ПараметрКоманды[0]) = Тип("БизнесПроцессСсылка.ЗаявкаПокупателя") Тогда  
		
		Список = ПолучитьРеализацииПоЗаказу(ПараметрКоманды);
		Если Список.Количество() > 1 Тогда
			Реализация = Список.ВыбратьЭлемент();
			Если Реализация <> Неопределено Тогда
				РеализацияСсылка =  Реализация.Значение;
			КонецЕсли;
		ИначеЕсли Список.Количество() = 1 Тогда
			РеализацияСсылка = Список[0].Значение;
		Иначе
			Возврат;
		КонецЕсли;
		МассивСсылок = Новый Массив;
 		МассивСсылок.Добавить(РеализацияСсылка);
		
		Печать(МассивСсылок);
	ИначеЕсли ТипЗнч(ПараметрКоманды[0]) = Тип("БизнесПроцессСсылка.ВнутренняяЗаявка") Тогда
		МассивСсылок = ПолучитьВнутренниеЗаказыПоЗаявке(ПараметрКоманды);
		Печать(МассивСсылок);
		Возврат;
		//Печать(МассивСсылок);
	Иначе
		
		// silber { отфильтруем задачи, оставим только принять или отправить
		
		Ссылки = Новый Массив;
		Для Каждого Ссылка Из ПараметрКоманды Цикл
			Если ТипЗнч(Ссылка) = Тип("ЗадачаСсылка.ЗадачаПользователю") Тогда
				
				ВнутрЗаказ = ВытащитьВнутрЗаказИзЗадачи(Ссылка);
				Если ВнутрЗаказ <> Неопределено Тогда Ссылки.Добавить(ВнутрЗаказ)  КонецЕсли;
				
			Иначе
				Ссылки.Добавить(Ссылка); КонецЕсли; КонецЦикла;
	
		// } silber
		
		Печать(Ссылки);
	КонецЕсли;

	//ФункцииФормДокументов.УстановитьНастройкиТабличногоДокумента(ТабДок);
	
	//ТабДок.АвтоМасштаб = Истина;
	//
	//ТабДок.Показать();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВнутренниеЗаказыПоЗаявке(ПараметрКоманды)
	МассивСсылок = Новый Массив;
	Для Каждого ЭлементМассива Из ПараметрКоманды Цикл
		МассивСсылок.Добавить(ЭлементМассива.Заказ)	
	КонецЦикла;
	Возврат МассивСсылок;
КонецФункции


&НаСервере
Функция ПолучитьРеализацииПоЗаказу(ПараметрКоманды)
	
	МассивСсылок = Новый Массив;
	Для Каждого Строка ИЗ ПараметрКоманды Цикл
		МассивСсылок.Добавить(Строка.Заказ);
	КонецЦикла;
	
	Возврат Заказы.ПолучитьРеализацииПоЗаказу(МассивСсылок);	
КонецФункции

&НаКлиенте
Процедура Печать(ПараметрКоманды)
	
	Инд = -1;
	Если ПараметрКоманды.Количество() > 1 Тогда
		Ответ = Вопрос("Создать для выбранных документов одну ТТН?", РежимДиалогаВопрос.ДаНетОтмена);
		
		Если Ответ = КодВозвратаДиалога.Да Тогда
			
			Форма = ПолучитьФорму("Обработка.ПечатьОбщихФорм.Форма.Форма", Новый Структура("Основание", ПараметрКоманды));
			Форма.ОткрытьМодально();
			
		ИначеЕсли
			Ответ = КодВозвратаДиалога.Нет Тогда
			Для Каждого Ссылка Из ПараметрКоманды Цикл Инд = Инд + 1;
				МассивСсылок = Новый Массив;
				МассивСсылок.Добавить(Ссылка);
				
				Форма = ПолучитьФорму("Обработка.ПечатьОбщихФорм.Форма.Форма", Новый Структура("Основание", МассивСсылок));			
		        Форма.ОткрытьМодально();
			КонецЦикла;
		
		КонецЕсли;
	
   Иначе
	   Для Каждого Ссылка Из ПараметрКоманды Цикл Инд = Инд + 1;
		    МассивСсылок = Новый Массив;
			МассивСсылок.Добавить(Ссылка);

			Форма = ПолучитьФорму("Обработка.ПечатьОбщихФорм.Форма.Форма", Новый Структура("Основание", МассивСсылок));			
	        Форма.ОткрытьМодально();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
