
Функция ПолучитьТекстПомощиРедактированияВыражения()
	
	Возврат "
	| Объект 		- загружаемый новый объект
	| ТекстЭкселя 	- текст в колонке экселя
	| Изменился		- булево, если изменился тогда объект будет записан
	| стрОшибки 	- текст который рекомендуеться заполнить если произойдет ошибка
	| ТаблицаДанных	- таблица значений со всеми данными экселя по строке:
	|		- ИмяРеквизита
	|		- Выражение
	|		- ТекстВЯчейке
	|		- ЭтоРеквизитПоиска
	|		- ТипОбъекта
	|		- ИмяРеквизитаПоискаСсылки
	|		- НомерГруппировкиСтрок
	|		- НеДобавлятьЕслиТакойЕсть
	|		- НомерКолонки
	|";
	
КонецФункции

&НаКлиенте
Процедура ОписаниеСтрокТипОбъектаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОтборМетаданных = Новый СписокЗначений;
	ОтборМетаданных.Добавить("Справочники");
	
	ДанныеВыбора = ОткрытьФорму("ОбщаяФорма.ВыборОбъектовМетаданных", 
	                  Новый Структура("ВыбранныеМетаданные, УникальныйИдентификаторИсточник", ОтборМетаданных , УникальныйИдентификатор));
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОбъектаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОтборМетаданных = Новый СписокЗначений;
	ОтборМетаданных.Добавить("Справочники");
	ОтборМетаданных.Добавить("Документы");
	ОтборМетаданных.Добавить("РегистрыСведений");
	
	ОткрытьФорму("ОбщаяФорма.ВыборОбъектовМетаданных", 
	                  Новый Структура("ВыбранныеМетаданные, УникальныйИдентификаторИсточник", ОтборМетаданных , УникальныйИдентификатор), Элемент);
		
КонецПроцедуры

&НаКлиенте
Процедура ВидОбъектаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если 	ТипЗнч(ВыбранноеЗначение) = Тип("СписокЗначений") И
			ВыбранноеЗначение.Количество() Тогда
			
		Объект.ВидОбъекта = ВыбранноеЗначение[0].Значение;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДВ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДВ.Фильтр =  "Эксель (*.xls)|*.xls*";	
	
	Если ДВ.Выбрать() Тогда
		
		Объект.ИмяФайла = ДВ.ПолноеИмяФайла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьСтруктуру(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ВыражениеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекДанные = Элементы.ОписаниеСтрок.ТекущиеДанные;
	
	ОткрытьФорму("ОбщаяФорма.РедактированияВыражения", 
	                  Новый Структура("Выражение, ТекстПомощи", 
					  	 ТекДанные.Выражение, 
						 ПолучитьТекстПомощиРедактированияВыражения()), 
					Элемент);

КонецПроцедуры

&НаКлиенте
Процедура ВыражениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если 	ТипЗнч(ВыбранноеЗначение) = Тип("Строка") Тогда
		
		ТекДанные = Элементы.ОписаниеСтрок.ТекущиеДанные;
		ТекДанные.Выражение = ВыбранноеЗначение;
		
	КонецЕсли;

КонецПроцедуры
