
&НаКлиенте
Процедура КонтактыВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
ВыбранноеЗначение = Новый Структура;
ВыбранноеЗначение.Вставить("Партнер",Элемент.ТекущиеДанные.Объект);
ВыбранноеЗначение.Вставить("Кому",Элемент.ТекущиеДанные.Представление);
Закрыть(ВыбранноеЗначение);	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Ссылка ПОМЕСТИТЬ Контрагенты ИЗ Справочник.Контрагенты ГДЕ 
	               |ВЫБОР
	               |			КОГДА НЕ &Партнер = &ПустойПартнер
	               |				ТОГДА Ссылка.Партнер = &Партнер
	               |			ИНАЧЕ ЛОЖЬ
	               |КОНЕЦ
                   |И НЕ ПометкаУдаления
	               |;
	               |ВЫБРАТЬ
	               |	Контрагенты.Ссылка КАК Контакт,
	               |	ТИПЗНАЧЕНИЯ(Контрагенты.Ссылка) КАК Тип
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА НЕ &Партнер = &ПустойПартнер
	               |				ТОГДА Контрагенты.Партнер = &Партнер
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |	И Контрагенты.ПометкаУдаления = ЛОЖЬ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Партнеры.Ссылка,
	               |	ТИПЗНАЧЕНИЯ(Партнеры.Ссылка)
	               |ИЗ
	               |	Справочник.Партнеры КАК Партнеры
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА НЕ &Партнер = &ПустойПартнер
	               |				ТОГДА Партнеры.Ссылка = &Партнер
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |	И Партнеры.ПометкаУдаления = ЛОЖЬ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ФизическиеЛица.Ссылка,
	               |	ТИПЗНАЧЕНИЯ(ФизическиеЛица.Ссылка)
	               |ИЗ
	               |	Справочник.ФизическиеЛица КАК ФизическиеЛица
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА НЕ &Партнер = &ПустойПартнер
	               |				ТОГДА ФизическиеЛица.Партнер = &Партнер
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |	И ФизическиеЛица.ПометкаУдаления = ЛОЖЬ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КонтактныеЛица.Ссылка,
	               |	ТИПЗНАЧЕНИЯ(КонтактныеЛица.Ссылка)
	               |ИЗ
	               |	Справочник.КонтактныеЛица КАК КонтактныеЛица
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА НЕ &Партнер = &ПустойПартнер
	               |				ТОГДА КонтактныеЛица.Владелец в (ВЫБРАТЬ Ссылка ИЗ Контрагенты)
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |	И КонтактныеЛица.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Партнер",Параметры.знПартнер);
	Запрос.УстановитьПараметр("ПустойПартнер",Справочники.Партнеры.ПустаяСсылка());
	Результат = Запрос.Выполнить().Выгрузить();
	СписокКонтактов = Результат.ВыгрузитьКолонку("Контакт");
	
	    ЭлементОтбора = Контакты.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект");   
	    ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	    ЭлементОтбора.Использование  = Истина;
	    ЭлементОтбора.ПравоеЗначение = СписокКонтактов;
	         
	   
	

КонецПроцедуры
