
&НаКлиенте
Процедура КонтактыВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
ВыбранноеЗначение = Новый Структура;
ВыбранноеЗначение.Вставить("Контрагент",Элемент.ТекущиеДанные.Объект);
ВыбранноеЗначение.Вставить("Кому",Элемент.ТекущиеДанные.Представление);
Закрыть(ВыбранноеЗначение);	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Контрагенты.Ссылка
	               |ПОМЕСТИТЬ Контрагенты
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА НЕ &Контрагент = &ПустойКонтрагент
	               |				ТОГДА Контрагенты.Ссылка = &Контрагент
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |	И НЕ Контрагенты.ПометкаУдаления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Контрагенты.Ссылка КАК Контакт,
	               |	ТИПЗНАЧЕНИЯ(Контрагенты.Ссылка) КАК Поле1
	               |ИЗ
	               |	Справочник.Контрагенты КАК Контрагенты
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА НЕ &Контрагент = &ПустойКонтрагент
	               |				ТОГДА Контрагенты.Ссылка = &Контрагент
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |	И Контрагенты.ПометкаУдаления = ЛОЖЬ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ФизическиеЛица.Ссылка,
	               |	ТИПЗНАЧЕНИЯ(ФизическиеЛица.Ссылка)
	               |ИЗ
	               |	Справочник.ФизическиеЛица КАК ФизическиеЛица
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА НЕ &Контрагент = &ПустойКонтрагент
	               |				ТОГДА ФизическиеЛица.Контрагент = &Контрагент
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |	И ФизическиеЛица.ПометкаУдаления = ЛОЖЬ
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КонтактныеЛица.Ссылка,
	               |	ТИПЗНАЧЕНИЯ(КонтактныеЛица.Ссылка)
	               |ИЗ
	               |	Справочник.КонтактныеЛица КАК КонтактныеЛица
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА НЕ &Контрагент = &ПустойКонтрагент
	               |				ТОГДА КонтактныеЛица.Владелец В
	               |						(ВЫБРАТЬ
	               |							Контрагенты.Ссылка
	               |						ИЗ
	               |							Контрагенты)
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ
	               |	И КонтактныеЛица.ПометкаУдаления = ЛОЖЬ";
	Запрос.УстановитьПараметр("Контрагент",Параметры.знКонтрагент);
	Запрос.УстановитьПараметр("ПустойКонтрагент",Справочники.Контрагенты.ПустаяСсылка());
	Результат = Запрос.Выполнить().Выгрузить();
	СписокКонтактов = Результат.ВыгрузитьКолонку("Контакт");
	
	    ЭлементОтбора = Контакты.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	    ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект");   
	    ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	    ЭлементОтбора.Использование  = Истина;
	    ЭлементОтбора.ПравоеЗначение = СписокКонтактов;
	         
	   
	

КонецПроцедуры
