
&НаСервере
Функция ПолучитьМакет(ОбъектСсылка)
	
	Возврат ПоместитьВоВременноеХранилище(РегистрыСведений.ИсторияОбъектов.ПолучитьМакетИсторииОбъекта(ОбъектСсылка));
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ОткрытьФорму("РегистрСведений.ИсторияОбъектов.Форма.ФормаИсторииОбъекта", 
			Новый Структура("Заголовок, АдресТаблицы", 
					"История изменений " + ПараметрКоманды,
					ПолучитьМакет(ПараметрКоманды)),
			ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
КонецПроцедуры
