
&НаСервере
Процедура ОбновитьКомментарий()
	
	КомментарийHTML = Комментарии.ПолучитьКомментарииHTMLКОбъекту(СсылкаНаОбъект, ИмяРеквизита, НомерСтрокиОбъекта);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СсылкаНаОбъект 		= Параметры.СсылкаНаОбъект;
	ИмяРеквизита 		= Параметры.ИмяРеквизита;
	НомерСтрокиОбъекта 	= Параметры.НомерСтрокиОбъекта;
	
	Заголовок = СсылкаНаОбъект;
	
	ОбновитьКомментарий();
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	HTMLОбработкаКлиент.ТекстHTMLПриНажатии(ДанныеСобытия, СтандартнаяОбработка, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	ОбновитьКомментарий();
	ОповеститьОЗаписиНового(НовыйОбъект);
	
КонецПроцедуры
