&НаКлиенте
Перем МассивКомментариев Экспорт;

&НаСервере
Функция ВыполнитьЗадачуСервер(ЗаказДоставлен)
	ВсеТоварыОтгружаются = Заказы.ВсеТоварыОтгружаются(Заказ);
	Если ЗаказДоставлен Тогда
		СостояниеОтгрузки = "Доставлен";
		СостояниеЗаказа = ?(ВсеТоварыОтгружаются,"Доставлен","ДоставленЧастично");
	Иначе
		СостояниеОтгрузки = "Отгружен";
		СостояниеЗаказа = ?(ВсеТоварыОтгружаются,"Отгружен","ОтгруженЧастично");
	КонецЕсли;
	
	НачатьТранзакцию();
	
	// Установим статус
	Если НЕ Заказы.УстановитьСостояниеЗаказа(Заказ, Перечисления.СостоянияЗаказа[СостояниеЗаказа]) ИЛИ НЕ Заказы.УстановитьСостояниеДокументаОтгрузки(ДокументОтгрузки,СостояниеОтгрузки) Тогда
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецЕсли;
	
	Если Не Записать(Новый Структура("ВыполнитьЗадачу", Истина)) Тогда
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецЕсли;
	
	Если ЗаказДоставлен = Ложь И ЗначениеЗаполнено(ЯчейкаХраненияЗаказа) Тогда
		БПОбъект = Объект.БизнесПроцесс.ПолучитьОбъект();
		БПОбъект.ЯчейкаХраненияЗаказа = ЯчейкаХраненияЗаказа;
		БПОбъект.Записать();
		
		Если ТипЗнч(ДокументОтгрузки) = Тип("ДокументСсылка.РеализацияТоваров") Тогда
			Для Каждого ТекСборка Из ДокументОтгрузки.СобранныеТовары Цикл
				Если ЗначениеЗаполнено(ТекСборка.СборочныйЛист) И ТекСборка.СборочныйЛист.ЯчейкаСобранногоТовара <> ЯчейкаХраненияЗаказа Тогда
					ТекОбъект = ТекСборка.СборочныйЛист.ПолучитьОбъект();
					ТекОбъект.ЯчейкаСобранногоТовара = ЯчейкаХраненияЗаказа;
					ТекОбъект.Записать();
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли ТипЗнч(ДокументОтгрузки) = Тип("ДокументСсылка.ОтгрузкаТоваров") Тогда
			Если ЗначениеЗаполнено(ДокументОтгрузки.СборочныйЛист) И ТекОбъект.ЯчейкаСобранногоТовара <> ЯчейкаХраненияЗаказа Тогда
				ТекОбъект = ДокументОтгрузки.ПолучитьОбъект();
				ТекОбъект.ЯчейкаСобранногоТовара = ЯчейкаХраненияЗаказа;
				ТекОбъект.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ЗафиксироватьТранзакцию();
	
	Возврат Истина;
	
КонецФункции

// ТИПОВЫЕ

&НаКлиенте
Процедура ПоказатьСкрытьАдресацию(Команда)
	
	// Реверснем
	
	КоманднаяПанель.ПодчиненныеЭлементы.ПоказатьСкрытьАдресацию.Пометка = Не КоманднаяПанель.ПодчиненныеЭлементы.ПоказатьСкрытьАдресацию.Пометка;
	
	// Обновим видимость
	
	ФункцииФормЗадач.ВидимостьАдресации(ЭтаФорма);
	
КонецПроцедуры
&НаСервере
Процедура ПрочитатьРеквизиты()
	
	ФункцииБизнесПроцессов.ЗаполнитьДанные(ЭтаФорма, 
		Объект.Ссылка.БизнесПроцесс, 
		Объект.Ссылка);
		
КонецПроцедуры
&НаСервере
Процедура УправлениеВидимостьюДоступностью()
	
	ЭтоТекущаяЗадача = Не Объект.Выполнена;
		
	Элементы.КнопкаПодтвердитьИЗакрыть.Видимость = ЭтоТекущаяЗадача;
	Элементы.КнопкаОтклонитьИЗакрыть.Видимость = ЭтоТекущаяЗадача;
	
	Элементы.ЯчейкаХраненияЗаказа.Видимость = СкладЯчеестый;
КонецПроцедуры

// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// прикрепленные файлы
	ОбновитьВидимостьПрикрепленныхФайловНаСервере();
	
	// комментарии
	ФункцииБизнесПроцессов.ДобавитьРаботуСКомментариями(ЭтаФорма);

	ПрочитатьРеквизиты();
	
	// Спрячем
	
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры


 &НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// комментарии
	ФункцииБизнесПроцессовКлиент.ПолучитьМассивКомментариев(ЭтаФорма, Объект.БизнесПроцесс);

	ФункцииФормЗадач.ПриОткрытии(Объект, ЭтаФорма, Отказ);
	
КонецПроцедуры
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ФункцииФормЗадач.ПослеЗаписи(Объект, ЭтаФорма, ПараметрыЗаписи);
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
КонецПроцедуры

// КОМАНДЫ

&НаКлиенте
Процедура ПодтвердитьДоставку(Команда)
	Если ВыполнитьЗадачуСервер(Истина) Тогда Закрыть() КонецЕсли;
	ФункцииФормЗадач.ПослеЗаписи(Объект, ЭтаФорма, Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьДоставку(Команда)
	Если ВыполнитьЗадачуСервер(Ложь) Тогда Закрыть() КонецЕсли;
	ФункцииФормЗадач.ПослеЗаписи(Объект, ЭтаФорма, Неопределено);
КонецПроцедуры

// КОММЕНТАРИИ

&НаКлиенте
Процедура КомандаПоказатьКомментарий(Команда)
	ФункцииБизнесПроцессовКлиент.КомандаПоказатьКомментарий(ЭтаФорма);
КонецПроцедуры

// ПЕЧАТЬ СБОРОЧНОГО ЛИСТА

#Область Прикрепленные_файлы

&НаКлиенте
Процедура УдалитьПрикрепленныеФайлыНажатие(Элемент)
	
	ПрикрепленныеФайлыКлиент.УдалитьНажатие(Объект.Заказ, ЭтаФорма, Элемент);
	
КонецПроцедуры
&НаКлиенте
Процедура ПрикрепленныеФайлыНажатиеСкрепка(Элемент)
	
	ПрикрепленныеФайлыКлиент.НажатиеСкрепка(Объект.Заказ, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПрикрепленныйФайл(Элемент)
	
	ПрикрепленныеФайлыКлиент.ОткрытьПрикрепленныйФайл(Элемент.Имя);
	
КонецПроцедуры
&НаКлиенте
Процедура ПоказатьПрикрееленныеФайлы(Элемент)
	
	ПрикрепленныеФайлыКлиент.ПоказатьПрикрепленныеФайлы(Объект.Заказ, ЭтаФорма, Элемент);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьПрикрепленныхФайловНаСервере()
	
	ПрикрепленныеФайлы.Иницилизировать(Объект.Заказ, ЭтаФорма);
	
КонецПроцедуры
&НаКлиенте
Процедура ОбновитьВидимостьПрикрепленныхФайлов() Экспорт
	
	ОбновитьВидимостьПрикрепленныхФайловНаСервере();
	
КонецПроцедуры

#КонецОбласти

