
//&НаКлиенте
//Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
//	
//	Перем ДокСсылка;
//	
//	СписокМашин = ЗагрузкаВАвтомобильЗаказов.ПолучитьСписокАвтомобилейДляЗагрузки();
//	ВыбрЭлемент = СписокМашин.ВыбратьЭлемент("Куда загружать?");
//	
//	Если ВыбрЭлемент <> Неопределено Тогда стрСообщения = "";
//		Если ЗагрузкаВАвтомобильЗаказов.ДобавитьЗаказы(ВыбрЭлемент.Значение, ПараметрКоманды, ДокСсылка, стрСообщения) Тогда
//			
//			СобытияСистемы.ОповеститьОИзмененииЗагрузкиАвтомобиля(ВыбрЭлемент.Значение);
//			ПоказатьОповещениеПользователя("Добавление заказов на погрузку", ПолучитьНавигационнуюСсылку(ДокСсылка), стрСообщения, БиблиотекаКартинок.ЗагрузкаЗаказа_Добавление) КонецЕсли;КонецЕсли;
//	
//КонецПроцедуры


&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если НЕ ЗначениеЗаполнено(ПараметрКоманды) Тогда
		Возврат;
	КонецЕсли;
	СписокМашин = ЗагрузкаВАвтомобильЗаказов.ПолучитьСписокАвтомобилейДляЗагрузки();
	СписокМашин.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ПослеВыбораЭлемента", ЭтотОбъект, ПараметрКоманды),"Куда загружать?");
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораЭлемента(ВыбранныйЭлемент, СписокПараметров) Экспорт
	Перем ДокСсылка;
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;

	стрСообщения = "";
	Если ЗагрузкаВАвтомобильЗаказов.ДобавитьЗаказы(ВыбранныйЭлемент.Значение, СписокПараметров, ДокСсылка, стрСообщения) Тогда
		СобытияСистемы.ОповеститьОИзмененииЗагрузкиАвтомобиля(ВыбранныйЭлемент.Значение);
		ПоказатьОповещениеПользователя("Добавление заказов на погрузку", ПолучитьНавигационнуюСсылку(ДокСсылка), стрСообщения, БиблиотекаКартинок.ЗагрузкаЗаказа_Добавление);
	КонецЕсли;
КонецПроцедуры
