
Процедура СкорректироватьСборку() экспорт
	
	 // Получим задачу корректировки заказа
	
	Запрос = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Задача.ЗадачаПользователю ГДЕ ТочкаМаршрута = &ТочкаСкорректироватьЗаказ И НЕ ПометкаУдаления И НЕ Выполнена И НЕ Параллельная И Заказ = &Заказ");
	
	Запрос.УстановитьПараметр("ТочкаСкорректироватьЗаказ", 	БизнесПроцессы.СборкаЗаказа.ТочкиМаршрута.СкорректироватьЗаказ);
	Запрос.УстановитьПараметр("Заказ", 						Заказ);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Количество() Тогда 
		ОбщиеФункции.СообщитьТекст("Не найдена задача ""Скорректировать заказ"""); 
		Возврат;
		
	ИначеЕсли Выборка.Количество() > 1 Тогда 
		ОбщиеФункции.СообщитьТекст("Найдено несколько задач ""Скорректировать заказ"" относящиеся к данному заказу"); 
		Возврат; КонецЕсли;
		
	Выборка.Следующий();
	ЗадачаОбъект = Выборка.Ссылка.ПолучитьОбъект();
	
	НачатьТранзакцию();
	
	// Установим статус
	
	Если Не Заказы.УстановитьСостояниеЗаказа(Заказ, Перечисления.СостоянияЗаказа.Собирается) Тогда
		Возврат ;
		ОтменитьТранзакцию(); КонецЕсли;
	
	// Выполним задачу
	ЗадачаОбъект.ДополнительныеСвойства.Вставить("КонтрольАдресации", Ложь);
	Попытка
		ЗадачаОбъект.ВыполнитьЗадачу();
	Исключение
		Возврат;
		ОтменитьТранзакцию(); КонецПопытки;
	
	// Все ок фиксируем
	
	ЗафиксироватьТранзакцию(); 
	Возврат;

	
КонецПроцедуры