
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗапрашиватьКоличество = Параметры.ЗапрашиватьКоличество;
	ЗапрашиватьЦену = Параметры.ЗапрашиватьЦена;

	Количество = Параметры.Количество;
	Цена = Параметры.Цена;
	
	Элементы.Количество.Видимость = ЗапрашиватьКоличество;
	Элементы.Цена.Видимость = ЗапрашиватьЦену;
	
	ЭтаФорма.Заголовок = "Ввод " + ?(ЗапрашиватьКоличество, "количества", "") + ?(ЗапрашиватьКоличество И ЗапрашиватьЦену, " и ", "") + ?(ЗапрашиватьЦену, "цены", "");
	
КонецПроцедуры

&НаКлиенте
Процедура ок(Команда)
	Закрыть(Новый Структура("Количество, Цена", Количество, Цена));
КонецПроцедуры
