
Функция ПолучитьТоварыИзПроводокСборочногоЛиста(СборочныйЛист)
	
	Запрос = Новый Запрос("ВЫБРАТЬ Заказ, Ячейка, Номенклатура, Собрать Количество, Количество Собрано, НеНайдено, Сборщик ИЗ Документ.СборочныйЛист.Товары ГДЕ Ссылка = &СборочныйЛист");
	Запрос.УстановитьПараметр("СборочныйЛист", СборочныйЛист);
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ЗаполнитьФормуПоБП(Форма, СсылкаПроцесс, СсылкаЗадача = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(СсылкаПроцесс) Тогда
		
		Запрос = Новый Запрос("
		
		// Условия
		
		|ВЫБРАТЬ 	Заказ, Заказ.Контрагент Контрагент, Склад, СборочныйЛист
		|ИЗ			БизнесПроцесс.СборкаТовара КАК Процесс
		|ГДЕ		Ссылка = &СсылкаБП
		|");
		
		Запрос.УстановитьПараметр("СсылкаБП", СсылкаПроцесс);
		Шапка = Запрос.Выполнить().Выгрузить()[0];
		
		// Заполним шапку
		
		ЗаполнитьЗначенияСвойств(Форма, Шапка);
		
		// Заполним таблицы
		
		Если СсылкаПроцесс.СборочныйЛист.Проведен Тогда
			ТабТов = ПолучитьТоварыИзПроводокСборочногоЛиста(СсылкаПроцесс.СборочныйЛист);
			
			//ТЗЗаказов = ТабТов.Скопировать(,"Заказ");
			//ТЗЗаказов.Свернуть("Заказ");
			//Форма.ТаблицаЗаказов.Загрузить(ТЗЗаказов);
			
		Иначе
			ТабТов = Заказы.ПолучитьСостояниеТоваров(СсылкаПроцесс,  ?(СсылкаЗадача <> Неопределено И СсылкаЗадача.Выполнена, СсылкаЗадача.ДатаВыполнения, ТекущаяДата()));
			//Форма.ТаблицаЗаказов.Добавить().Заказ = Шапка.Заказ; 
		КонецЕсли;
		
		Форма.Товары.Загрузить(ТабТов); КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьЗаголовокБП(СсылкаПроцесс) Экспорт
	
	Если СсылкаПроцесс.Пустая() Тогда
		
		Возврат "Создание";
		
	Иначе
		
		Если СсылкаПроцесс.Заказ.Пустая() Тогда
			
			Возврат Строка(СсылкаПроцесс);
			
		Иначе
			
			расшЗаказа = "";
			Если ТипЗнч(СсылкаПроцесс.Заказ) = Тип("ДокументСсылка.ИнтернетЗаказПокупателя") Тогда
				расшЗаказа = "интернет ";
			ИначеЕсли ТипЗнч(СсылкаПроцесс.Заказ) = Тип("ДокументСсылка.ВнутреннийЗаказ") Тогда
				расшЗаказа = "внутреннего ";
			КонецЕсли;
			
			Возврат "Сборка " + расшЗаказа + "заказа № " + СсылкаПроцесс.Заказ.Номер + " от " + СсылкаПроцесс.Заказ.Дата + " БП(" + СсылкаПроцесс.Номер + ")";
				
		КонецЕсли;
	КонецЕсли;
	
КонецФункции
