
Процедура ОбновитьТаблицуТоваров(Товары, СсылкаПроцесс, ВыбЗаказы = Неопределено) Экспорт
	
	// Заполним товары из сборочных листов + кто не попал в сборочники из мегазапроса
	
	ТабТоваров	 		= ПолучитьТоварыИзПроводокСборочногоЛиста(СсылкаПроцесс.СборочныйЛист);
	ЗаказыВнеСборочника = Новый Массив;
	
	Если ВыбЗаказы <> Неопределено Тогда
		Для Каждого Заказ Из ВыбЗаказы Цикл Если ТабТоваров.Найти(Заказ, "Заказ") = Неопределено Тогда ЗаказыВнеСборочника.Добавить(Заказ) КонецЕсли; КонецЦикла; КонецЕсли;
		
	Если ЗаказыВнеСборочника.Количество() Тогда
		КонвертацияТипов.ДобавитьТаблицуКДругойТаблице(ТабТоваров, Заказы.ПолучитьСостояниеТоваров(ЗаказыВнеСборочника))
		
	ИначеЕсли СсылкаПроцесс.СборочныйЛист.пустая() Тогда
		ТабТоваров = Заказы.ПолучитьСостояниеТоваров(СсылкаПроцесс); КонецЕсли;
	
	Товары.Загрузить(ТабТоваров);
	
КонецПроцедуры

Функция ПолучитьТоварыИзПроводокСборочногоЛиста(СборочныйЛист)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ 	&СостояниеСбобирается Состояние, Ссылка.Склад Размещение, 
	|			Заказ, Ячейка, Номенклатура, Собрать Количество, Количество Собрано, НеНайдено, Сборщик 
	|ИЗ Документ.СборочныйЛист.Товары ГДЕ Ссылка = &СборочныйЛист");
	
	Запрос.УстановитьПараметр("СостояниеСбобирается", 	Перечисления.СостояниеСборкиЗаказа.Собирается);
	Запрос.УстановитьПараметр("СборочныйЛист", 			СборочныйЛист);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ЗаполнитьФормуПоБП(Форма, СсылкаПроцесс, СсылкаЗадача = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(СсылкаПроцесс) Тогда Запрос = Новый Запрос("
		
		// Условия
		
		|ВЫБРАТЬ 	Заказ, Заказ.Контрагент Контрагент, Склад, СборочныйЛист
		|ИЗ			БизнесПроцесс.СборкаТовара КАК Процесс
		|ГДЕ		Ссылка = &СсылкаБП
		|");
		
		Запрос.УстановитьПараметр("СсылкаБП", СсылкаПроцесс);
		
		// Заполним шапку
		
		ЗаполнитьЗначенияСвойств(Форма, Запрос.Выполнить().Выгрузить()[0]);
		
		// Заполним таблицы
		
		ОбновитьТаблицуТоваров(Форма.Товары, СсылкаПроцесс);
		
		//Форма.Товары.Загрузить(?(СсылкаПроцесс.СборочныйЛист.Проведен,
		//	ПолучитьТоварыИзПроводокСборочногоЛиста(СсылкаПроцесс.СборочныйЛист),
		//	Заказы.ПолучитьСостояниеТоваров(СсылкаПроцесс,  ?(СсылкаЗадача <> Неопределено И СсылкаЗадача.Выполнена, 
		//																СсылкаЗадача.ДатаВыполнения, 
		//																ТекущаяДата())))); 
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьЗаголовокБП(СсылкаПроцесс) Экспорт
	
	Если СсылкаПроцесс.Пустая() Тогда
		
		Возврат "Создание";
		
	Иначе
		
		Если СсылкаПроцесс.Заказ.Пустая() Тогда
			
			Возврат Строка(СсылкаПроцесс);
			
		Иначе
			
			расшЗаказа = "";
			Если ТипЗнч(СсылкаПроцесс.Заказ) = Тип("ДокументСсылка.ИнтернетЗаказПокупателя") Тогда
				расшЗаказа = "интернет ";
			ИначеЕсли ТипЗнч(СсылкаПроцесс.Заказ) = Тип("ДокументСсылка.ВнутреннийЗаказ") Тогда
				расшЗаказа = "внутреннего ";
			КонецЕсли;
			
			Возврат "Сборка " + расшЗаказа + "заказа № " + СсылкаПроцесс.Заказ.Номер + " от " + СсылкаПроцесс.Заказ.Дата + " БП(" + СсылкаПроцесс.Номер + ")";
				
		КонецЕсли;
	КонецЕсли;
	
КонецФункции
