
Процедура УстановитьЗадачеРеквизитыПоУмолчанию(ФормируемыеЗадачи)
	
	Для Каждого Задача Из ФормируемыеЗадачи Цикл
		
		Задача.Наименование = ФункцииБизнесПроцессов.ПредставлениеЗадачиПоЗаказу(Задача, Заказ);
		Задача.Склад 		= Ссылка.Склад;
		Задача.Заказ 		= Заказ; КонецЦикла;
	
КонецПроцедуры


Процедура СобратьЗаказПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	УстановитьЗадачеРеквизитыПоУмолчанию(ФормируемыеЗадачи);
	
	// Установим статус
	
	Если Не Заказы.УстановитьСостояниеЗаказа(Заказ, Перечисления.СостоянияЗаказа.ВОчередиНаСборку) Тогда
		Отказ = Истина КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ТипЗнч = ТипЗнч(ДанныеЗаполнения);
	
	Если ТипЗнч = Тип("Структура") Тогда
		
		КонвертацияТипов.ЗаполнитьОбъектПоСтруктуреОснованию(ЭтотОбъект, ДанныеЗаполнения); КонецЕсли;
	
КонецПроцедуры

Функция ЭтоПоследняяСборка()
	
	Возврат Заказ.Склад = Склад;
	
КонецФункции

Процедура ВыполнитьСкорректироватьЗаказ(ТочкаМаршрутаБизнесПроцесса)
	// Если это последний склад сборки тогда выполнить задачу скорректировать за логиста
	
	Запрос = Новый Запрос("
	
	// Проверим что это последняя задача
	
	|ВЫБРАТЬ 	Ссылка Задача
	|ИЗ			Задача.ЗадачаПользователю 
	|ГДЕ 		Не Выполнена И
	|			БизнесПроцесс.Заказ = &Заказ И
	|			ТочкаМаршрута 		= &ТочкаСкорректировать И
	|			Склад 				= &Склад");
	
	Запрос.УстановитьПараметр("Заказ", Заказ);
	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("ТочкаСкорректировать", БизнесПроцессы.СборкаЗаказа.ТочкиМаршрута.СкорректироватьЗаказ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		
		ЗадОбъект = Выборка.Задача.Получитьобъект();
		ЗадОбъект.ДополнительныеСвойства.Вставить("КонтрольАдресации", Ложь);
		ЗадОбъект.ВыполнитьЗадачу(); КонецЦикла;	
	
КонецПроцедуры

Процедура ЭтоПоследняяСборкаПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = ЭтоПоследняяСборка();
	
КонецПроцедуры

Процедура ЗакрытьСборкиОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	ВОЗВРАТ; // пока не понимаю как правильно
	
	// Закрываем сборки которые не собирались, чтобы не висели товары в сборке
	
	Если Не БизнесПроцессы.СборкаЗаказа.СоздатьСборочныйЛистКоторыйЗакроетСборкуЗаказа(Заказ, Склад) Тогда
		ВызватьИсключение "Ошибка создания отмены сборочного листа"; КонецЕсли;
	
КонецПроцедуры

Процедура СобратьТоварУОбъединенныхСборокОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	// Выполним задачи которые не относяткся к данному БП но они оказались в сборочном листе
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ Ссылка ИЗ Задача.ЗадачаПользователю 
	|ГДЕ 
	|	Выполнена = ЛОЖЬ И
	|	ТочкаМаршрута = &ТочкаСобратьТовар И
	|	Ссылка.Заказ В(
	|				ВЫБРАТЬ РАЗЛИЧНЫЕ Заказ 
	|				ИЗ Документ.СборочныйЛист.Товары 
	|				ГДЕ Ссылка = &СборочныйЛист И Заказ <> &Заказ)
	|");
	
	Запрос.УстановитьПараметр("СборочныйЛист", 		СборочныйЛист);
	Запрос.УстановитьПараметр("Заказ", 				Заказ);
	Запрос.УстановитьПараметр("ТочкаСобратьТовар", 	БизнесПроцессы.СборкаТовара.ТочкиМаршрута.СобратьТовар);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл 
		Выборка.Ссылка.ПолучитьОбъект().ВыполнитьЗадачу() КонецЦикла;
	
КонецПроцедуры


//Нэти Исмаилов ИТ 23.03.2017 Начало
Процедура ОтправкаПисьмаОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	Если ТипЗнч(Заказ) = Тип("ДокументСсылка.ИнтернетЗаказПокупателя") и Не ЗначениеЗаполнено(Заказ.МВЗ) Тогда
		
		Если Заказы.ЗаказПолностьюСобран(Ссылка,Заказ.Склад) Тогда
			Если Заказ.ВариантДоставкиНов = Перечисления.ВариантДоставки.ДоставкаДоГрузоперевозчика
				Или Заказ.ВариантДоставкиНов = Перечисления.ВариантДоставки.ДоставкаДоКлиента Тогда
				
				ТекстПисьма = "	Ваш заказ #" + СокрЛП(Заказ.Номер) + " собран и готов к отправке в транспортную компанию.<BR>";
				БизнесПроцессы.ИнтернетЗаявка.СформироватьПисьмо_Нов(Заказ, """Гараж Тулс"". Готов заказ", ТекстПисьма,,,,, "Готов к отправке");
				
			ИначеЕсли Заказ.ВариантДоставкиНов = Перечисления.ВариантДоставки.СамовывозСНашегоСклада Тогда
				
				ТекстПисьма = "	Ваш заказ #" + СокрЛП(Заказ.Номер) + " собран и готов к отгрузке.<BR>";
				БизнесПроцессы.ИнтернетЗаявка.СформироватьПисьмо_Нов(Заказ, """Гараж Тулс"". Готов заказ", ТекстПисьма,,,,, "Готов к отгрузке");
				
			ИначеЕсли Заказ.ВариантДоставкиНов = Перечисления.ВариантДоставки.ДоставкаДоКлиентаНашимиСилами Тогда
				
				ТекстПисьма = "	Ваш заказ #" + СокрЛП(Заказ.Номер) + " собран и готов к доставке.<BR>";
				БизнесПроцессы.ИнтернетЗаявка.СформироватьПисьмо_Нов(Заказ, """Гараж Тулс"". Готов заказ", ТекстПисьма,,,,, "Готов к доставке");

			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
//Нэти Исмаилов ИТ 23.03.2017 Конец

