
Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	Если НЕ ПроведенияДокументов.РазрешеноПерепроводитьДокумент(Ссылка) Тогда
		Возврат;
	КонецЕсли;	
	
	ДатаНачалаРаботыСборкиПоНовому = '20131030';
	
	Заказ = БизнесПроцессы.ПеремещениеТоваров.ПолучитьЗаказ(Ссылка.Процесс);
	ПолучитьТаблицуПоРезервам = 
			Не Ссылка.Процесс.Пустая() И
			ЗначениеЗаполнено(Заказ);
			
	СписыватьСборку = Не Ссылка.Процесс.Пустая() И Ссылка.Процесс.ЗаказСобран;  // это перемещение типа внутреннего
			
	ИменаРегистров = Новый Массив;
	ПоВсем=Ложь;
	Если Не ДополнительныеСвойства.Свойство("ИменаРегистров",ИменаРегистров) Тогда
		ПоВсем=Истина;
		ИменаРегистров = Новый Массив;
	КонецЕсли;	
	
	
	ТекстЗапроса=КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() +Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
	
	"//>>> Шапка

	|ВЫБРАТЬ
	|	СкладОтправитель, СкладПолучатель
	|ИЗ
	|	Документ.ОтгрузкаТоваров
	|ГДЕ
	|	Ссылка = &Ссылка";
	
	
	
	Нтаб=Новый Структура;
	ТекНомер=1;	
		
	Если ИменаРегистров.Найти("ТоварыНаСкладах")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ТоварыНаСкладах",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		
		"//>>> ТоварыНаСкладах
		
		|ВЫБРАТЬ
		|	&Период						КАК Период,
		|	&ВидДвиженияРасход			КАК ВидДвижения,
		|	Ссылка.СкладОтправитель		КАК Склад,
		|	Номенклатура	            КАК Номенклатура,
		|	ВЫБОР КОГДА Упаковка = &ПустаяУпаковка ТОГДА
		|		СУММА(Количество)
		|	ИНАЧЕ
		|		СУММА(Количество*Упаковка.Коэффициент)
		|	КОНЕЦ				КАК Количество
		|ИЗ
		|	Документ.ОтгрузкаТоваров.Товары
		|
		|ГДЕ
		|	Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	Ссылка.СкладОтправитель,
		|	Номенклатура,
		|	Упаковка
		|ИМЕЮЩИЕ СУММА(Количество) <> 0"
		
	КонецЕсли;	
	
	
	Если ИменаРегистров.Найти("ТоварыВПути")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ТоварыВПути",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		
		"//>>> ТоварыВПути
		
		|ВЫБРАТЬ
		|	&Период						КАК Период,
		|	&ВидДвиженияПриход			КАК ВидДвижения,
		|	Ссылка.Процесс.Заказчик 	КАК Заказчик,
		|	Ссылка.СкладОтправитель		КАК СкладОтправитель,
		|	Ссылка.СкладПолучатель		КАК СкладПолучатель,
		|	Ссылка.Маршрут				КАК Маршрут,
		|	Номенклатура	            КАК Номенклатура,
		|	Упаковка					КАК Упаковка,
		|	СУММА(Количество)			КАК Количество
		|ИЗ
		|	Документ.ОтгрузкаТоваров.Товары
		|
		|ГДЕ
		|	Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	Ссылка.Процесс.ЗаказЧик,
		|	Ссылка.СкладОтправитель,
		|	Ссылка.СкладПолучатель,
		|	Ссылка.Маршрут,
		|	Номенклатура,
		|	Упаковка
		|ИМЕЮЩИЕ СУММА(Количество) <> 0"
		
	КонецЕсли;	
		
	
	Если ИменаРегистров.Найти("ТоварыВЯчейках")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ТоварыВЯчейках",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		
		"//>>> ТоварыВЯчейках
		
		|ВЫБРАТЬ
		|	&Период						КАК Период,
		|	&ВидДвиженияРасход			КАК ВидДвижения,
		|	Ячейка						КАК Ячейка,
		|	Номенклатура	            КАК Номенклатура,
		|	ВЫБОР КОГДА Упаковка = &ПустаяУпаковка ТОГДА
		|		СУММА(Количество)
		|	ИНАЧЕ
		|		СУММА(Количество*Упаковка.Коэффициент)
		|	КОНЕЦ						КАК Количество
		|ИЗ
		|	Документ.ОтгрузкаТоваров.Товары
		|
		|ГДЕ
		|	Ссылка = &Ссылка И
		|	Ячейка <> &ПустаяЯчейка
		|
		|СГРУППИРОВАТЬ ПО
		|	Ячейка,
		|	Номенклатура,
		|	Упаковка
		|ИМЕЮЩИЕ СУММА(Количество) <> 0"
		
	КонецЕсли;	
	
	
	Если ИменаРегистров.Найти("ТоварыВРезерве")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ТоварыВРезерве",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		
		"//>>> ТоварыВРезерве
		
		|ВЫБРАТЬ
		|	&Период						КАК Период,
		|	&ВидДвиженияРасход			КАК ВидДвижения,
		|	Ссылка.СкладОтправитель		КАК Размещение,
		|	&Заказ						КАК ДокументРезерва,
		|	Номенклатура	            КАК Номенклатура,
		|	ВЫБОР КОГДА Упаковка = &ПустаяУпаковка ТОГДА
		|		СУММА(Количество)
		|	ИНАЧЕ
		|		СУММА(Количество*Упаковка.Коэффициент)
		|	КОНЕЦ						КАК Количество
		|ИЗ
		|	Документ.ОтгрузкаТоваров.Товары
		|
		|ГДЕ
		|	&ПолучитьТаблицуПоРезервам = ИСТИНА И
		|	НЕ ДокументРезерва.Дата ЕСТЬ NULL И
		|	Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	Ссылка.СкладОтправитель,
		|	Номенклатура,
		|	Упаковка
		|ИМЕЮЩИЕ СУММА(Количество) <> 0"
		
	КонецЕсли;	
	
	
	
	Если ИменаРегистров.Найти("СборщикЗаказа")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("СборщикЗаказа",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		
		"//>>> СборщикЗаказа
		
		|ВЫБРАТЬ
		|	&Период						КАК Период,
		|	Сборщик						КАК Сборщик,
		|	&Заказ						КАК Заказ,
		|	Номенклатура				КАК Номенклатура,
		|	Упаковка					КАК Упаковка,
		|	Ссылка.СкладОтправитель		КАК Склад,
		|  	Ячейка						КАК Ячейка,		
		|	СУММА(Количество)			КАК Количество
		|ИЗ
		|	Документ.ОтгрузкаТоваров.Товары
		|
		|ГДЕ
		|	Ссылка = &Ссылка И
		|	Сборщик <> &ПустойСборщик
		|
		|СГРУППИРОВАТЬ ПО
		|	Ссылка,
		|	Сборщик,
		|	Номенклатура,
		|	Упаковка,
		|	Ячейка
		|ИМЕЮЩИЕ
		|	СУММА(Количество) <> 0"
		
	КонецЕсли;	
	
	
	Если ИменаРегистров.Найти("ДвижениеТовара")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ДвижениеТовара",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		
		"//>>> ДвижениеТовара
		
		|ВЫБРАТЬ
		|	&Период						КАК Период,
		|	Ссылка.СкладОтправитель		КАК Склад,
		|	&Заказ 	Заказ,
		|	Номенклатура,
		|	Упаковка, 
		|	-СУММА(Количество) Количество
		|ИЗ
		|	Документ.ОтгрузкаТоваров.Товары
		|
		|ГДЕ
		|	Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	Ссылка,
		|	Номенклатура,
		|	Упаковка"
		
	КонецЕсли;	
	
	
	Если ИменаРегистров.Найти("ОтгруженныеЗаказы")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ОтгруженныеЗаказы",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		
		"//>>> ОтгруженныеЗаказы
		
		|ВЫБРАТЬ
		|	&Период	Период,
		|	&Заказ 	Заказ,
		|	Ссылка	ДокументОтгрузки,
		|	СУММА(Номенклатура.Вес * ВЫБОР КОГДА Упаковка = &ПустаяУпаковка ТОГДА Количество ИНАЧЕ Количество * Упаковка.Коэффициент КОНЕЦ) 	ВесПодготовлено,
		|	СУММА(Номенклатура.Объем * ВЫБОР КОГДА Упаковка = &ПустаяУпаковка ТОГДА Количество ИНАЧЕ Количество * Упаковка.Коэффициент КОНЕЦ) 	ОбъемПодготовлено
		|ИЗ
		|	Документ.ОтгрузкаТоваров.Товары
		|ГДЕ
		|	Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	Ссылка"
		
	КонецЕсли;	
	
	
	Если ИменаРегистров.Найти("ТоварыСобранные")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ТоварыСобранные",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		
		"//>>> ТоварыСобранные
		
		|ВЫБРАТЬ
		|	&Период				КАК Период,
		|	&ВидДвиженияРасход	КАК ВидДвижения,
		|	Ссылка.СкладОтправитель		Склад,
		//|	Ссылка.СборочныйЛист.Заказ 	Заказ,
		|	Ссылка.Процесс.Заказчик.Заказ Заказ,
		|	Ссылка.СборочныйЛист		СборочныйЛист,
		|	Номенклатура,
		|	Упаковка,
		|	СУММА(Количество) КАК Количество
		|ИЗ
		|	Документ.ОтгрузкаТоваров.Товары
		|
		|ГДЕ
		|	Ссылка = &Ссылка И Ссылка.СборочныйЛист <> &ПустойСборочныйЛист
		|
		|СГРУППИРОВАТЬ ПО
		|	Ссылка,
		|	Номенклатура,
		|	Упаковка"
		
	КонецЕсли;	
	
	
	Если ИменаРегистров.Найти("ЗаказыНаПеремещения")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ЗаказыНаПеремещения",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		
		"//>>> ЗаказыНаПеремещения
		
		|ВЫБРАТЬ
		|	&Период						КАК Период,
		|	&ВидДвиженияРасход			КАК ВидДвижения,
		|	Ссылка.СкладОтправитель		КАК СкладОтправитель,
		|	&Заказ 	Заказ,
		|	Номенклатура,
		|	Упаковка, 
		|	Количество
		|ИЗ
		|	Документ.ОтгрузкаТоваров.Товары
		|
		|ГДЕ
		|	Ссылка = &Ссылка"
	КонецЕсли;	
	
	
	Если ИменаРегистров.Найти("ВнутренниеЗаказы")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("ВнутренниеЗаказы",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		
		// ВнутренниеЗаказы
		
		"ВЫБРАТЬ Неопределено где Истина=Ложь"
		
	КонецЕсли;	
	
	
	Если ИменаРегистров.Найти("СборкаЗаказа")<>Неопределено ИЛИ ПоВсем Тогда
		ТекНомер=ТекНомер+1;
		Нтаб.Вставить("СборкаЗаказа",ТекНомер);
		
		ТекстЗапроса=ТекстЗапроса+Символы.ПС+";"+Символы.ПС+"/////////////////////////////////////////"+Символы.ПС+
		
		"//>>> СборкаЗаказа
		|выбрать неопределено где истина=ложь"
		
	КонецЕсли;	
	
	
	Запрос=Новый Запрос;
	
	Запрос.УстановитьПараметр("Ссылка", 			Ссылка);
	Запрос.УстановитьПараметр("Заказ", 				Заказ);
	Запрос.УстановитьПараметр("Период", 			Ссылка.Дата);
	Запрос.УстановитьПараметр("ВидДвиженияПриход", 	ВидДвиженияНакопления.Приход);
	Запрос.УстановитьПараметр("ВидДвиженияРасход", 	ВидДвиженияНакопления.Расход);
	Запрос.УстановитьПараметр("ПустаяЯчейка", 		Справочники.Ячейки.ПустаяСсылка());
	Запрос.УстановитьПараметр("ПолучитьТаблицуПоРезервам", 	ПолучитьТаблицуПоРезервам);
	Запрос.УстановитьПараметр("ПустаяУпаковка", 	Справочники.УпаковкиНоменклатуры.ПустаяСсылка());
	Запрос.УстановитьПараметр("СписыватьСборку", 	СписыватьСборку);
	Запрос.УстановитьПараметр("ПустойСборщик", 		Справочники.ФизическиеЛица.ПустаяСсылка());
	Запрос.УстановитьПараметр("Дата1", 				Ссылка.Дата);
	Запрос.УстановитьПараметр("ПустойСборочныйЛист",Документы.СборочныйЛист.ПустаяСсылка());
	
	
	Запрос.Текст=ТекстЗапроса;
	Пакет = Запрос.ВыполнитьПакет();

	Для Каждого Элем Из Нтаб Цикл
		ДополнительныеСвойства.Вставить(Элем.Ключ,Пакет[Элем.Значение].Выгрузить());
	КонецЦикла;	
	
	
//	ДополнительныеСвойства.Вставить("ПараметрыСистемы", КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[0].Выгрузить()));
//	ДополнительныеСвойства.Вставить("Шапка", 			КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[1].Выгрузить()));
//	ДополнительныеСвойства.Вставить("ТоварыНаСкладах", 	Пакет[2].Выгрузить());
//	ДополнительныеСвойства.Вставить("ТоварыВПути", 		Пакет[3].Выгрузить());
////	ДополнительныеСвойства.Вставить("ВнутренниеЗаказы", Пакет[4].Выгрузить());
//	ДополнительныеСвойства.Вставить("ТоварыВЯчейках", 	Пакет[5].Выгрузить());
//	ДополнительныеСвойства.Вставить("ТоварыВРезерве", 	Пакет[6].Выгрузить());
//	ДополнительныеСвойства.Вставить("СборкаЗаказа", 	Пакет[?(ТекущаяДата() > ДатаНачалаРаботыСборкиПоНовому, 8, 7)].Выгрузить());
//	ДополнительныеСвойства.Вставить("СборщикЗаказа", 	Пакет[9].Выгрузить());
//	ДополнительныеСвойства.Вставить("ДвижениеТовара",	Пакет[10].Выгрузить());
//	//ДополнительныеСвойства.Вставить("ПартииТоваров",	Пакет[12].Выгрузить());
//	ДополнительныеСвойства.Вставить("ТоварыСобранные",	Пакет[13].Выгрузить());
//	ДополнительныеСвойства.Вставить("ЗаказыНаПеремещения",	Пакет[14].Выгрузить());
//	
//	Если ТипЗнч(Заказ) = Тип("ДокументСсылка.ВнутреннийЗаказ") Тогда ДополнительныеСвойства.Вставить("ОтгруженныеЗаказы", Пакет[11].Выгрузить()) КонецЕсли;
//	
//	// Разнесем табличку сборок
//	
//	Если Не ДополнительныеСвойства.СборкаЗаказа.Количество() И СписыватьСборку Тогда
//		
//		ТаблицаСборки = Пакет[7].Выгрузить();
//		Если ТаблицаСборки.Количество() Тогда
//			
//			ТаблицаРазмазаннойСборки = КонтрольПроведения.РазмазатьТаблицуВТаблицеПоМинимальнымРесурсам(
//					ТаблицаСборки,
//					ДополнительныеСвойства.ТоварыНаСкладах,
//					"Номенклатура",
//					"Количество");
//					
//			ТаблицаРазмазаннойСборки.Колонки.Количество.Имя = "Собрано";
//			ДополнительныеСвойства.СборкаЗаказа = ТаблицаРазмазаннойСборки; КонецЕсли; КонецЕсли;

КонецПроцедуры
