&НаСервере
Функция НайтиТоварыИПоложитьВХранилище()
	
	// Ищем по артикулу
	
	//Запрос = Новый Запрос("
	//|ВЫБРАТЬ Тов.Артикул, Тов.Номенклатура, Тов.Цена, Тов.Количество, Тов.ПроизводительКод, Тов.Комментарий
	//|ПОМЕСТИТЬ Товары
	//|ИЗ &Товары КАК Тов;
	//
	//|ВЫБРАТЬ Тов.Артикул, ЕСТЬNULL(Спр.Ссылка, Тов.Номенклатура) Номенклатура, Тов.Цена, Тов.Количество, Истина Пересчет, Произ.Ссылка Производитель, Тов.Комментарий
	//|ИЗ Товары КАК Тов
	//
	//|ЛЕВОЕ СОЕДИНЕНИЕ
	//|	(	ВЫБРАТЬ Артикул, МАКСИМУМ(Ссылка)
	//|		ИЗ 		Справочник.Номенклатура 
	//|		ГДЕ НЕ ПометкаУдаления И Артикул В(ВЫБРАТЬ Артикул ИЗ Товары)
	//|		СГРУППИРОВАТЬ ПО Артикул
	//|	) Спр
	//|ПО 
	//|	Спр.Артикул = Тов.Артикул
	//|
	//|ЛЕВОЕ СОЕДИНЕНИЕ
	//|	(	ВЫБРАТЬ Код, МАКСИМУМ(Ссылка)
	//|		ИЗ 		Справочник.Производители 
	//|		ГДЕ НЕ ПометкаУдаления И Код В(ВЫБРАТЬ ПроизводительКод ИЗ Товары)
	//|		СГРУППИРОВАТЬ ПО Код
	//|	) Произ
	//|ПО 
	//|	Произ.Код = Тов.ПроизводительКод
	//|");
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Тов.Артикул,
	                      |	Тов.Номенклатура,
	                      |	Тов.Цена,
	                      |	Тов.Количество,
	                      |	Тов.Комментарий,
	                      |	Тов.ПроизводительНаим
	                      |ПОМЕСТИТЬ Товары
	                      |ИЗ
	                      |	&Товары КАК Тов
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Тов.Артикул,
	                      |	ЕСТЬNULL(Спр.Ссылка, Тов.Номенклатура) КАК Номенклатура,
	                      |	Тов.Цена,
	                      |	Тов.Количество,
	                      |	ИСТИНА КАК Пересчет,
	                      |	Тов.Комментарий,
	                      |	ЕСТЬNULL(Произ.Ссылка, Тов.ПроизводительНаим) КАК Производитель
	                      |ИЗ
	                      |	Товары КАК Тов
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                      |			Номенклатура.Артикул КАК Артикул,
	                      |			МАКСИМУМ(Номенклатура.Ссылка) КАК Ссылка
	                      |		ИЗ
	                      |			Справочник.Номенклатура КАК Номенклатура
	                      |		ГДЕ
	                      |			НЕ Номенклатура.ПометкаУдаления
	                      |			И Номенклатура.Артикул В
	                      |					(ВЫБРАТЬ
	                      |						Товары.Артикул
	                      |					ИЗ
	                      |						Товары)
	                      |		
	                      |		СГРУППИРОВАТЬ ПО
	                      |			Номенклатура.Артикул) КАК Спр
	                      |		ПО (Спр.Артикул = Тов.Артикул)
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                      |			МАКСИМУМ(Производители.Ссылка) КАК Ссылка,
	                      |			Производители.Наименование КАК Наименование
	                      |		ИЗ
	                      |			Справочник.Производители КАК Производители
	                      |		ГДЕ
	                      |			НЕ Производители.ПометкаУдаления
	                      |			И Производители.Наименование В
	                      |					(ВЫБРАТЬ
	                      |						Товары.ПроизводительНаим
	                      |					ИЗ
	                      |						Товары)
	                      |		
	                      |		СГРУППИРОВАТЬ ПО
	                      |			Производители.Наименование) КАК Произ
	                      |		ПО Тов.ПроизводительНаим = Произ.Наименование");

	
	Запрос.УстановитьПараметр("Товары", Товары.Выгрузить());
	Возврат ПоместитьВоВременноеХранилище(Запрос.Выполнить().Выгрузить());
	
КонецФункции

&НаКлиенте
Процедура Загрузить(Команда)
	
	// Загрузим из таблицы
	
	КолСтрок = ТабличныйДокумент.ВысотаТаблицы;
	Товары.Очистить();
	
	Для НомСтр = 1 По КолСтрок Цикл 
		
		ОбработкаПрерыванияПользователя();
		Состояние("Сканируем строки", НомСтр / КолСтрок * 100, НомСтр, БиблиотекаКартинок.Эксель);
		
		НовСтрока = Товары.Добавить();
		
		НовСтрока.Артикул 			= ТабличныйДокумент.Область("R" + Строка(НомСтр) + "C" + Строка(1)).Текст;
		НовСтрока.Номенклатура 		= ТабличныйДокумент.Область("R" + Строка(НомСтр) + "C" + Строка(2)).Текст;
		
		НовСтрока.Количество 	    = ТабличныйДокумент.Область("R" + Строка(НомСтр) + "C" + Строка(3)).Текст;
		НовСтрока.Цена 		        = ТабличныйДокумент.Область("R" + Строка(НомСтр) + "C" + Строка(4)).Текст;
		НовСтрока.ПроизводительНаим = ТабличныйДокумент.Область("R" + Строка(НомСтр) + "C" + Строка(5)).Текст;
		//НовСтрока.ПроизводительКод	= ТабличныйДокумент.Область("R" + Строка(НомСтр) + "C" + Строка(5)).Текст;
		НовСтрока.Комментарий 		= ТабличныйДокумент.Область("R" + Строка(НомСтр) + "C" + Строка(6)).Текст; КонецЦикла;
	
	// Отправим на поиск товаров и потом в документ
	
	Если КолСтрок > 99 Тогда ПоказатьОповещениеПользователя("Поиск товаров в базе",,"Ищем по артикулу товары в базе", БиблиотекаКартинок.НайтиПоНомеру) КонецЕсли;
	ОповеститьОВыборе(Новый Структура("Товары, ПересчитатьЦену, ДобавитьВКонец", НайтиТоварыИПоложитьВХранилище(), Истина, Истина));
	
КонецПроцедуры