Процедура СохранитьКартинку(Отказ)
	
	ТекКартинка = Картинка.Получить();
	
	Если ТекКартинка <> Неопределено И НЕ ПустаяСтрока(КэшируемыеФункции.ПолучитьПутьКОблакуЛокально()) Тогда
		
		ИмяФайла = КэшируемыеФункции.ПолучитьПутьКОблакуЛокально() + "\img\" + Код + "." + Расширение;
			
		Попытка
			текКартинка.Записать(ИмяФайла);
		Исключение
			стрОшибки = ОписаниеОшибки();
			ОбщиеФункции.СообщитьТекст("Ошибка при записи картинки в облако
			|ИмяФайла = " + ИмяФайла + "
			|" + стрОшибки);
			Отказ = Истина; КонецПопытки; КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	ТекКартинка = Картинка.Получить();
	
	Если ТекКартинка <> Неопределено И ТипЗнч(ТекКартинка) = Тип("Картинка") Тогда
		Расширение	= КонвертацияТипов.РасширениеКартинки(текКартинка) КонецЕсли;
	
	ДатаИзменения = ТекущаяДата();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	СохранитьКартинку(Отказ);
	
КонецПроцедуры
