

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьФорматированныйТекстhtml(Выборка, МассивИменВыборки, ТекстСтрокиВыборки, СкобкаНачало = "<___", СкобкаКонец = "___>")
	
	Текст = "";
	
	Пока Выборка.Следующий() Цикл
		
		текТекст = ТекстСтрокиВыборки;
		Для Каждого ИмяВыборки Из МассивИменВыборки Цикл
			
			текТекст = СтрЗаменить(текТекст, СкобкаНачало + ИмяВыборки + СкобкаКонец, Выборка[ИмяВыборки]);
			
		КонецЦикла;
		
		Текст = Текст + текТекст;
		
	КонецЦикла;
	
	Возврат Текст;
	//Возврат ?(Текст = "", "", 
	//	"<HTML><HEAD>
	//	|<META content=""text/html; charset=utf-8"" http-equiv=Content-Type>
	//	|<META name=GENERATOR content=""MSHTML 8.00.7600.16588""></HEAD>
	//	|<body bgcolor=""#FCFAEB"">" + Текст);
	
КонецФункции
&НаСервере
Функция ПолучитьТекстОтзывов(Выборка)
	
	Текст = "";
	
	//Если Ном = КолЗаписей Тогда
	//		
	//		ОбзацНачало = "<P><STRONG>";
	//		ОбзацКонец = "</STRONG></P>";
	//		
	//	Иначе
	//		
			ОбзацНачало = "<P>";
			ОбзацКонец = "</P>";
			
		//КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		Текст = Текст +
		
		"<font class=""Apple-style-span"" color=""#808080""><i><span class=""Apple-style-span"" style=""font-size: x-small;"">"
		+ Формат(Выборка.ДатаСообщения,"ДЛФ=DT") + 
		"</span></i></font><i><span class=""Apple-style-span"" style=""font-size: x-small;"">"
		+ " " + Выборка.ИмяПользователя +
		"<font class=""Apple-style-span"" color=""#CC99FF"">"
		+ " (" + Выборка.Оценка + ")" + 
		"</font></span></i></p>
		
		|" + ОбзацНачало + Выборка.Сообщение + ОбзацКонец;

		
	КонецЦикла;
	
	Возврат ?(Текст = "", "", 
	"<HTML><HEAD>
	|<META content=""text/html; charset=utf-8"" http-equiv=Content-Type>
	|<META name=GENERATOR content=""MSHTML 8.00.7600.16588""></HEAD>
	|<body bgcolor=""#FCFAEB"">" + Текст);

	
КонецФункции

&НаСервере
Процедура ЗадатьДанныеСтраницы(ТекстHTML, ИмяСтраницы, ИмяПсевдонимаСтраницы, ИмяТекста)
	
	Страница = Элементы[ИмяСтраницы];
	
	ЭтаФорма[ИмяТекста] = ТекстHTML;
	
	Если ПустаяСтрока(ТекстHTML) Тогда
		
		Страница.Заголовок 	= ИмяПсевдонимаСтраницы + " (пусто)";
		
	Иначе
		
		Страница.Заголовок 	= ИмяПсевдонимаСтраницы + " (данные)";
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПоТовару(СсылкаНоменклатуры)
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Пользователь,
	|	Сообщение,
	|	ДатаСообщения,
	|	Город,
	|	Оценка,
	|	Почта,
	|	ИмяПользователя
	|ИЗ
	|	Справочник.ОтзывыОТоваре
	|ГДЕ
	|	Владелец = &Ссылка
	|;
	|ВЫБРАТЬ
	|	Пользователь,
	|	Вопрос,
	|	ДатаВопроса,
	|	Почта,
	|	ИмяПользователя
	|ИЗ
	|	Справочник.ВопросыПоТовару
	|ГДЕ
	|	Владелец = &Ссылка
	|;
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Ссылка.ПользовательИнтернет КАК ПользовательИнтернет,
	|	Ссылка.ЭлектроннаяПочта КАК ЭлектроннаяПочта
	|ИЗ
	|	Справочник.РассылкиПользователям.Товары
	|ГДЕ
	|	Номенклатура = &Ссылка
	|;
	|");
	
	Запрос.УстановитьПараметр("ссылка", СсылкаНоменклатуры);
	Пакет = Запрос.ВыполнитьПакет();
	
	// Отзывы
	
	//ЗадатьДанныеСтраницы(	
	Текст = "<p><b> Отзывы о товаре: </b></p>" + 
				ПолучитьФорматированныйТекстhtml(
					 		Пакет[0].Выбрать(),
							КонвертацияТипов.ПолучитьМассивИзСтроки("ДатаСообщения, ИмяПользователя, Оценка, Сообщение"),
							"<font class=""Apple-style-span"" color=""#808080""><i><span class=""Apple-style-span"" style=""font-size: x-small;""><___ДатаСообщения___></span></i></font>
							|<i><span class=""Apple-style-span"" style=""font-size: x-small;""><___ИмяПользователя___> оценка:<font class=""Apple-style-span"" color=""#CC99FF""><___Оценка___></font></span></i></p>
							|<___Сообщение___></P>"); 
		//"СтраницаОтзывыОТоваре", 
		//"Отзывы",
		//"ОтзывыОТоваре");
			
	// Вопросы  от товаре
	
	//ЗадатьДанныеСтраницы(	
	Текст = Текст + "<p><b> Вопросы по товару: </b></p>" + 
				ПолучитьФорматированныйТекстhtml(
					 		Пакет[1].Выбрать(),
							КонвертацияТипов.ПолучитьМассивИзСтроки("ДатаВопроса, ИмяПользователя, Почта, Вопрос"),
							"<font class=""Apple-style-span"" color=""#808080""><i><span class=""Apple-style-span"" style=""font-size: x-small;""><___ДатаВопроса___></span></i></font>
							|<i><span class=""Apple-style-span"" style=""font-size: x-small;""><___ИмяПользователя___> <font class=""Apple-style-span"" color=""#CC99FF""><___Почта___></font></span></i></p>
							|<___Вопрос___></P>");
		//"СтраницаВопросы", 
		//"Вопросы",
		//"ВопросыПоТовару");
			
	// Текст о появлении
	
	//ЗадатьДанныеСтраницы(	
	Текст = Текст + "<p><b> Напоминания: </b></p>" + 
				ПолучитьФорматированныйТекстhtml(
					 		Пакет[2].Выбрать(),
							КонвертацияТипов.ПолучитьМассивИзСтроки("ПользовательИнтернет, ЭлектроннаяПочта"),
							"<font class=""Apple-style-span"" color=""#808080""><i><span class=""Apple-style-span"" style=""font-size: x-small;""><___ПользовательИнтернет___></span></i></font>
							|<___ЭлектроннаяПочта___></P>");
		//"СтраницаСообщитьОПоявлении", 
		//"Напоминания",
		//"ЗапросОПоявлении");
		
	полеТекстHTML = "<HTML><HEAD>
	|<META content=""text/html; charset=utf-8"" http-equiv=Content-Type>
	|<META name=GENERATOR content=""MSHTML 8.00.7600.16588""></HEAD>
	|<body bgcolor=""#FCFAEB"">" + Текст;
	
		
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	СсылкаНоменклатуры = Элементы.Список.ТекущаяСтрока;
	
	Если СсылкаНоменклатуры <> Неопределено Тогда
		
		ОбновитьДанныеПоТовару(СсылкаНоменклатуры);
		АдресКартинки = Картинки.ПолучитьНавигационнуюСсылкуОсновногоИзображения(СсылкаНоменклатуры);
		
	КонецЕсли;
	
КонецПроцедуры
