
&НаСервере
Процедура УстановитьОбласть(Область)
	
	ПараметрыСеанса.ТекущаяОбласть = Область;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("Справочник.Область.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	
	УстановитьОбласть(ПараметрКоманды);
	ОбновитьИнтерфейс();
	
КонецПроцедуры
