
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбщийРасходТранспортировки = ВладелецФормы.Объект.ОбщийРасходТранспортировки;
	КомиссияЗаДоставку	= ВладелецФормы.Объект.КомиссияЗаДоставку;
	КомиссияЗаОплату	= ВладелецФормы.Объект.КомиссияЗаОплату;
	
	Валюта	= ВладелецФормы.Объект.Валюта;
	ТипЦенСебестоимость	= ВладелецФормы.ТипЦенСебестоимость;
	ВалютаУправленческогоУчета			= ВладелецФормы.ВалютаУправленческогоУчета;
	
	ТипЦенЗакупочный	= ВладелецФормы.Объект.ТипЦенЗакупочный;
	КурсДокумента = ВладелецФормы.Объект.КурсДокумента;
КонецПроцедуры

&НаКлиенте
Процедура КомиссияЗаДоставкуПриИзменении(Элемент)
	
	ВладелецФормы.Объект.КомиссияЗаДоставку = КомиссияЗаДоставку;
	ВладелецФормы.Модифицированность = Истина;
	
	Если ВладелецФормы.Объект.Товары.Количество() Тогда
		ВладелецФормы.ПересчитатьТаблицуТовары();
	КонецЕсли;
	
	ВладелецФормы.ОбновитьОтображениеДанных();

КонецПроцедуры

&НаКлиенте
Процедура КомиссияЗаОплатуПриИзменении(Элемент)
	
	ВладелецФормы.Объект.КомиссияЗаОплату = КомиссияЗаОплату;
	ВладелецФормы.Модифицированность = Истина;
	
	Если ВладелецФормы.Объект.Товары.Количество() Тогда
		ВладелецФормы.ПересчитатьТаблицуТовары();
	КонецЕсли;
	
	ВладелецФормы.ОбновитьОтображениеДанных();

КонецПроцедуры

&НаКлиенте
Процедура ОбщийРасходТранспортировкиПриИзменении(Элемент)
	
	ВладелецФормы.Объект.ОбщийРасходТранспортировки = ОбщийРасходТранспортировки;
	ВладелецФормы.Модифицированность = Истина;
	
	Если ВладелецФормы.Объект.Товары.Количество() Тогда
		ВладелецФормы.ПересчитатьТаблицуТовары();
	КонецЕсли;
	
	ВладелецФормы.ОбновитьОтображениеДанных();

КонецПроцедуры

&НаКлиенте
Процедура ТипЦенЗакупочныйПриИзменении(Элемент)
	
	ВладелецФормы.Объект.ТипЦенЗакупочный = ТипЦенЗакупочный;
	ВладелецФормы.Модифицированность = Истина;
	
	ВладелецФормы.СформироватьВалютныйЗаголовок("ЦенаЗакупочная", ТипЦенЗакупочный);
    ВладелецФормы.СформироватьВалютныйЗаголовок("СебестоимостьЦенаЗакупочная", ТипЦенЗакупочный);
	
	ВладелецФормы.ОбновитьОтображениеДанных();

КонецПроцедуры

&НаКлиенте
Процедура ВалютаПриИзменении(Элемент)
	
	ВладелецФормы.Объект.Валюта = Валюта;
	ВладелецФормы.Модифицированность = Истина;
	
	ВладелецФормы.ОбновитьОтображениеДанных();

КонецПроцедуры

&НаКлиенте
Процедура ЗагружатьСЦенойПриИзменении(Элемент)
	
	ВладелецФормы.ЗагружатьСЦеной = ЗагружатьСЦеной;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроцентТранспортныеРасходыПриИзменении(Элемент)
	
	ВладелецФормы.ПроцентТранспортныеРасходы = ПроцентТранспортныеРасходы;
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппировкаНоменклатурыПриИзменении(Элемент)
	
	ВладелецФормы.ГруппировкаНоменклатуры = ГруппировкаНоменклатуры;

КонецПроцедуры

&НаКлиенте
Процедура КурсДокументаПриИзменении(Элемент)
	ВладелецФормы.Объект.КурсДокумента = КурсДокумента;
	ВладелецФормы.Модифицированность = Истина;
	Если  ВладелецФормы.Объект.Себестоимость.Количество() Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтаФорма, Параметры);
		ПоказатьВопрос(Оповещение, НСтр("ru = 'Пересчитать таблицу расчета себестоимости?'"), Режим, 0);
	КонецЕсли;
КонецПроцедуры

//...

&НаКлиенте
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
    КонецЕсли;

    ВладелецФормы.ЗаполнитьТаблицуСебестоимость();
	ВладелецФормы.ОбновитьОтображениеДанных();

КонецПроцедуры 


//&НаКлиенте
//Процедура ТипЦенСебестоимостьПриИзменении(Элемент)
//	
//	ВладелецФормы.Объект.Номер 			= Номер;
//	ВладелецФормы.Модифицированность 	= Истина;
//	
//	ВладелецФормы.ОбновитьОтображениеДанных();

//КонецПроцедуры

//&НаКлиенте
//Процедура ТипЦенМаркетинговаяСебестоимостьПриИзменении(Элемент)
//	
//	ВладелецФормы.Объект.Номер 			= Номер;
//	ВладелецФормы.Модифицированность 	= Истина;
//	
//	ВладелецФормы.ОбновитьОтображениеДанных();

//КонецПроцедуры
