
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РолиПользователя = ПолучитьРолиПользователя();
	Список.Параметры.УстановитьЗначениеПараметра("Роль", РолиПользователя);
	Список.Параметры.УстановитьЗначениеПараметра("ОсновнойМенеджер", ПараметрыСеанса.ТекущийПользователь);
	
КонецПроцедуры

&НаСервереБезКонтекста	
Функция ПолучитьРолиПользователя()
	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ 	Роль 
		|ПОМЕСТИТЬ 	СписокРолей
		|ИЗ 		РегистрСведений.РолиПользователей 
		|ГДЕ 		Пользователь = &Пользователь
		|;
		|ВЫБРАТЬ 	Ссылка КАК Роль
		|ИЗ 		Справочник.Роли
		|ГДЕ		Ссылка В ИЕРАРХИИ(ВЫБРАТЬ Роль ИЗ СписокРолей КАК СписокРолей)
		|");
		
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Роль");
	
КонецФункции	
