Процедура ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос(
	
	КэшируемыеФункции.ТектЗапросаПолученияПараметровСистемы() + "
														
	//|;
	//|ВЫБРАТЬ
	//|	Партнер
	//|ИЗ
	//|	Документ.УстановкаНоменклатурыЗамены
	//|ГДЕ
	//|	Ссылка = &Ссылка
	|;
	|ВЫБРАТЬ
	|	ДатаНачала Период,
	|	Тов.Номенклатура,
	|	Тов.НоменклатураЗамена,
	|	Парт.Партнер,
	|	Парт.Контрагент,
	|	ИСТИНА Использование
	|ИЗ
	|	Документ.УстановкаНоменклатурыЗамены.Товары КАК Тов
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|	Документ.УстановкаНоменклатурыЗамены.Партнеры  Парт
	|	ПО ИСТИНА
	|ГДЕ
	| Тов.Ссылка = &Ссылка И Парт.Ссылка = &Ссылка И ДатаНачала <> ДАТАВРЕМЯ(1,1,1)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДатаОкончания Период,
	|	Тов.Номенклатура,
	|	Тов.НоменклатураЗамена,
	|	Парт.Партнер,
	|	Парт.Контрагент,
	|	ЛОЖЬ Использование
	|ИЗ
	|	Документ.УстановкаНоменклатурыЗамены.Товары КАК Тов
	|	ЛЕВОЕ СОЕДИНЕНИЕ
	|	Документ.УстановкаНоменклатурыЗамены.Партнеры  Парт
	|	ПО ИСТИНА
	|ГДЕ
	| Тов.Ссылка = &Ссылка И Парт.Ссылка = &Ссылка И ДатаОкончания <> ДАТАВРЕМЯ(1,1,1)");
	
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);	
	Запрос.УстановитьПараметр("Период",Ссылка.Дата);	
	Пакет = Запрос.ВыполнитьПакет();
		
	// Воткнем в структуру
	
	ДополнительныеСвойства.Вставить("ПараметрыСистемы", КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[0].Выгрузить()));
	//ДополнительныеСвойства.Вставить("Шапка", 			КонвертацияТипов.ПолучитьСтруктуруИзСТрокиТаблицыЗначений(Пакет[1].Выгрузить()));
	ДополнительныеСвойства.Вставить("НоменклатураЗамены", 			Пакет[1].Выгрузить());	
	
КонецПроцедуры
