
&НаКлиенте
Процедура ЛимитНажатие(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Отбор, КлючНазначенияИспользования, СформироватьПриОткрытии", Новый Структура("Инициатор", Объект.Ссылка),,Истина);
	ОткрытьФорму("Отчет.ОтчетПоЛимитам.Форма.ФормаОтчета", ПараметрыФормы, ЭтаФорма);
КонецПроцедуры

&НаСервере
Функция ПолучитьТекущийЛимит()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	ЛимитыОбороты.СуммаПриход,
					|	ЛимитыОбороты.СуммаРасход,
					|	ЛимитыОбороты.СуммаПриход - ЛимитыОбороты.СуммаРасход КАК ТекущийЛимит
					|ИЗ
					|	РегистрНакопления.Лимиты.Обороты(, , , Инициатор = &Ссылка) КАК ЛимитыОбороты";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ТекущийЛимит;		
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Лимит = ПолучитьТекущийЛимит();
	//КонтактныеЛица.Параметры.УстановитьЗначениеПараметра("Ссылка", Объект.Ссылка);
	
	GUID = Объект.Ссылка.УникальныйИдентификатор();
КонецПроцедуры

