&НаКлиенте
Процедура ДополнительныеРеквизиты(Команда)
	
	ФункцииФормДокументов.ОткрытьОбщиеРеквизиты(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//ЛимитыДлямВ
	 ПоказатьТекущийЛимит();
	 
КонецПроцедуры

&НаСервере
Процедура ПоказатьТекущийЛимит()
	Для Каждого Стр Из Объект.Лимиты Цикл
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛимитыОбороты.СуммаОборот КАК ТекущийЛимит
		               |ИЗ
		               |	РегистрНакопления.Лимиты.Обороты КАК ЛимитыОбороты
		               |ГДЕ
		               |	ЛимитыОбороты.Инициатор = &Инициатор";
		Запрос.УстановитьПараметр("Инициатор", Стр.Инициатор);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Стр.ТекущийЛимит = Выборка.ТекущийЛимит;	
		КонецЦикла;	
	КонецЦикла;	
КонецПроцедуры


&НаКлиенте
Процедура ЛимитыДляИнициаторовПриИзменении(Элемент)
	// Вставить содержимое обработчика
	ПоказатьТекущийЛимит();
КонецПроцедуры

&НаКлиенте
Процедура ЛимитыИнициаторПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ПоказатьТекущийЛимит();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьВнешниеДанные(ИмяКоманды)
	
	ОткрытьФорму("Документ.УстановкаЛимитов.Форма.ЗагрузкаДанных", Новый Структура("Страница, СтруктураКолонокТовары, ИмяТаблицы, ЗагружатьКоличество", ИмяКоманды, Неопределено, "Объект.Лимиты", Истина),ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеТабличногоДокумента(Команда)
	ЗагрузитьВнешниеДанные(Команда.Имя);
КонецПроцедуры
