
Функция ПечатьТехЗаключение(Ссылки) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	Макет 			= Документы.ТехЗаключение.ПолучитьМакет("Заключение");
	ОбластьШапка 	= Макет.ПолучитьОбласть("Шапка");
	ОбластьТело 	= Макет.ПолучитьОбласть("Тело");
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Номер, Дата, Ответственный,
	|	ЗаказНаряд.Номер НомерЗаказа, ЗаказНаряд.Дата ДатаЗаказа, ЗаказНаряд.Контрагент Контрагент,
	|	Номенклатура, Номенклатура.Артикул Артикул,
	|	Неисправность, Причина, Заключение
	|ИЗ
	|	Документ.ТехЗаключение 
	|ГДЕ
	|	Ссылка В(&Ссылки) И НЕ ПометкаУдаления
	|");
	
	Запрос.УстановитьПараметр("Ссылки", Ссылки);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьТело.Параметры.Пользователь = ВернутьДолжностьИПользователя(); 
		ОбластьШапка.Параметры.Заполнить(Выборка);
		ОбластьТело.Параметры.Заполнить(Выборка);
		
		ОбластьШапка.Параметры.Дата 		= Формат(ОбластьШапка.Параметры.Дата, "ДЛФ=DD");
		ОбластьШапка.Параметры.ДатаЗаказа 	= Формат(ОбластьШапка.Параметры.ДатаЗаказа, "ДЛФ=DD");
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		ТабличныйДокумент.Вывести(ОбластьТело);
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц(); КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ВернутьДолжностьИПользователя()
	
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	Если ТекущийПользователь.ФизЛицо.Пустая() Тогда //Если не заполнено ФИЗ лицо
		ФИОПользователя = СклонениеПоПадежам.daСклонение(ТекущийПользователь.Наименование, "Р", ,"ФИО");
		ДолжностьИПользователь = ФИОПользователя;
	Иначе
		Если ЗначениеЗаполнено(ТекущийПользователь.ФизЛицо.Должность) Тогда //Есть у ФИЗ лица есть должность
			ДолжностьПользователя = СклонениеПоПадежам.daСклонение(ТекущийПользователь.ФизЛицо.Должность, "Р", ,"Д");
            ФИОПользователя = СклонениеПоПадежам.daСклонение(ТекущийПользователь.ФизЛицо.Наименование, "Р", ,"ФИО");
			ДолжностьИПользователь = ДолжностьПользователя + " " + ФИОПользователя;
		Иначе
			ФИОПользователя = СклонениеПоПадежам.daСклонение(ТекущийПользователь.ФизЛицо.Наименование, "Р", ,"ФИО");
			ДолжностьИПользователь = ФИОПользователя;
		КонецЕсли;	
	КонецЕсли;
	
	Возврат ДолжностьИПользователь;
	
КонецФункции	
