Процедура ПечататьСборочныйЛистИнвентаризации(ТабДокумент, Ссылка, ТолькоПроблемные = Ложь) Экспорт
	
	Макет = БизнесПроцессы.ЯчеестаяИнвентаризация.ПолучитьМакет("СборочныйЛистИнвентаризации");
	
	ОбластьШапка 			= Макет.ПолучитьОбласть("Шапка");
	ОбластьЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
	ОбластьСтрока 			= Макет.ПолучитьОбласть("Строка");
	ОбластьИтого 			= Макет.ПолучитьОбласть("Итого");
	
	// Шапка
	
	ОбластьШапка.Параметры.Номер 	= Ссылка.Номер;
	ОбластьШапка.Параметры.Дата 	= Ссылка.Дата;
	
	ТабДокумент.Вывести(ОбластьШапка);
	ТабДокумент.Вывести(ОбластьЗаголовокТаблицы);
	
	//// Отсортируем чтобы бегали быстрее
	//
	//ТаблВывода = Ссылка.Товары.Выгрузить();
	//ТаблВывода.Сортировать("Ячейка");
	//ТаблВывода.Колонки.Добавить("Артикул", Новый ОписаниеТипов("Строка"));	
	// Получим другие ячейки
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗЛИЧНЫЕ *, Номенклатура.Артикул Артикул ПОМЕСТИТЬ ТаблицаТовара ИЗ БизнесПроцесс.ЯчеестаяИнвентаризация.Товары ГДЕ Ссылка = &Ссылка 
	|;
	|ВЫБРАТЬ
	|	Яч.Номенклатура,
	|	Яч.Ячейка,
	|	СУММА(Яч.КоличествоОстаток + ЕСТЬNULL(Сбор.СобраноОстаток,0)) Количество
	|ИЗ
	|	РегистрНакопления.ТоварыВЯчейках.Остатки(,Ячейка.Проход + ""."" + Ячейка.Секция <> """ + Ссылка.Секция + """) Яч
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.СборкаЗаказа.Остатки(,СкладЯчейка ССЫЛКА Справочник.Ячейки И СкладЯчейка.Владелец = &Склад И Номенклатура В(ВЫБРАТЬ Номенклатура ИЗ ТаблицаТовара)) Сбор
	|ПО
	|	Яч.Номенклатура = Сбор.Номенклатура И
	|	Яч.Ячейка 		= Сбор.СкладЯчейка
	|
	|СГРУППИРОВАТЬ ПО
	|	Яч.Номенклатура,
	|	Яч.Ячейка
	|;
	|ВЫБРАТЬ *, Артикул ИЗ ТаблицаТовара"); //УПОРЯДОЧИТЬ По Ячейка, Артикул");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Склад", Ссылка.Склад);
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	ДругиеЯчейки = РезультатЗапроса[1].Выгрузить();
	ТаблВывода =  РезультатЗапроса[2].Выгрузить();
	
	// Выводим в таблицу
	
	Ном = 0; Сумма = 0; Количество = 0;
	ПустаяУпаковка = Справочники.УпаковкиНоменклатуры.ПустаяСсылка();
	Для каждого Строка Из ТаблВывода Цикл 
		
		Если ТолькоПроблемные И Не Строка.ОбщееКоличествоНаСкладе <> Строка.ОбщееКоличествоВЯчейках Тогда
			Продолжить;
		КонецЕсли;
		
		Ном = Ном + 1;
		
		Количество 	= Количество + Строка.КоличествоУчет;
		
		ОбластьСтрока.Параметры.Заполнить(Строка);
		ОбластьСтрока.Параметры.Номер 				= Ном;
		//ОбластьСтрока.Параметры.Артикул 			= Строка.Артикул;
		//ОбластьСтрока.Параметры.ЕдиницаИзмерения 	= Строка.Номенклатура.ЕдиницаИзмерения;
		
		// Сформируем другие ячейки
		СтрокиДругих = ДругиеЯчейки.НайтиСтроки(Новый Структура("Номенклатура", Строка.Номенклатура));Стр = "";
		Для Каждого СтрокаДругих Из СтрокиДругих Цикл Стр = Стр + ?(Стр = "", "",Символы.ПС) + СтрокаДругих.Ячейка + " - " + СтрокаДругих.Количество + " - ";КонецЦикла;
		ОбластьСтрока.Параметры.ДругиеЯчейки		= Стр;
		
		ТабДокумент.Вывести(ОбластьСтрока);
		
	КонецЦикла; 
	
	ОбластьИтого.Параметры.КолНоменклатура	= Количество;
	ОбластьИтого.Параметры.ДатаФормирования = Формат(ТекущаяДата(),"ДЛФ=DDT");
	ТабДокумент.Вывести(ОбластьИтого);
	
	// Настрим просмотры
	
	ТабДокумент.ТолькоПросмотр 	= Истина;
	ТабДокумент.ОтображатьСетку = Ложь;
 
КонецПроцедуры
