
Процедура УсловиеТоварПодсчитанПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
	Результат = ИнвентаризацияПринята;
	
КонецПроцедуры



Процедура ПодсчитатьТоварПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	
	// Создадим инвентаризацию и проведем документ
	
	ЗадачаОбъект = ФормируемыеЗадачи[0];
	
	
КонецПроцедуры


//Процедура ПровестиДокументыИнвентаризацийСторно()
//	
//	Запрос = Новый Запрос("
//	|ВЫБРАТЬ НЕОПРЕДЕЛЕНО ДокументРезерва, НЕОПРЕДЕЛЕНО Размещение, Ячейка, Номенклатура, СУММА(КоличествоУчет) Количество Из Документ.Инвентаризация.Товары ГДЕ Не Ссылка.ПометкаУдаления И Ссылка.Проведен И Ссылка.Процесс = &Ссылка СГРУППИРОВАТЬ ПО Ячейка, Номенклатура;
//	|ВЫБРАТЬ ДокументРезерва, Размещение, Номенклатура, КоличествоОстаток Количество ИЗ РегистрНакопления.ТоварыВРезерве.Остатки(,ДокументРезерва.Процесс = &Ссылка)
//	|");
//	
//	Запрос.УстановитьПараметр("Ссылка", Ссылка);
//	Пакет = Запрос.ВыполнитьПакет();
//	
//	Доки 	= Пакет[0].Выгрузить();
//	Остатки = Пакет[1].Выгрузить();
//	
//	ТЗТовары = КонвертацияТипов.РазнестиТаблицуПоТаблицеОстатков(Доки, Остатки);
//	
//	Если ТЗТовары.Количество() Тогда
//		
//		НовДок = Документы.Инвентаризация.СоздатьДокумент();
//		НовДок.Дата = ТекущаяДата();
//		НовДок.Склад	= Склад;
//		НовДок.Процесс 	= Ссылка;
//		
//		НовДок.Товары.Загрузить(ТЗТовары);
//		НовДок.Записать(РежимЗаписиДокумента.Проведение);
//		
//	КонецЕсли;
//	
//КонецПроцедуры

Процедура ОтменаИнвентаризацииОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	// Снимем резерв
	
	//ПровестиДокументыИнвентаризацийСторно();
	
	ДокОбъект = ДокИнвентаризация.ПолучитьОбъект();
	ДокОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);

	
КонецПроцедуры

Функция ТоварВПоиске(Товар)
	
	Запрос = Новый Запрос("ВЫБРАТЬ КоличествоОстаток
	|ИЗ РегистрНакопления.ТоварыВЯчейках.Остатки(, Ячейка = &ВПоиске И Номенклатура = &Товар)
//	|ГДЕ Регистратор ССЫЛКА Документ.ПеремещениеТоваров И Регистратор.Процесс <> ЗНАЧЕНИЕ(БизнесПроцесс.ЯчеестаяИнвентаризация.ПустаяСсылка)	
	|");
	
	Запрос.УстановитьПараметр("ВПоиске", Справочники.Ячейки.НайтиПоНаименованию("в.по.ис.ке"));
	Запрос.УстановитьПараметр("Товар", Товар);
	Запрос.УстановитьПараметр("НачалоИнвентаризации", Константы.НачалоИнвентаризации.Получить());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КоличествоОстаток;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции


Процедура ОбработатьНедостачи()
	
	//готовим таблицу недостач
	НовТаб = Новый ТаблицаЗначений;
	НовТаб.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	НовТаб.Колонки.Добавить("Ячейка");
	НовТаб.Колонки.Добавить("КоличествоРасхождение");
	
	НовТаб.Колонки.Добавить("ЯчейкаОтправитель");
	НовТаб.Колонки.Добавить("ЯчейкаПолучатель");
	НовТаб.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
	
	Для Каждого Стр Из Товары Цикл
		Если Стр.КоличествоРасхождение < 0 Тогда
			НовСтр = НовТаб.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр,Стр);
			НовСтр.ЯчейкаОтправитель = Стр.Ячейка;
			НовСтр.ЯчейкаПолучатель = Склад.ЯчейкаНеНайдено;
			НовСтр.Количество = - Стр.КоличествоРасхождение;
		КонецЕсли;
	КонецЦикла;
	
	
	//снимем резерв по дате заказов по LIFO, если это мешает проведению инвентаризации
	//а мешает нам разница между недостачей и свободным остатком. Если недостача > своб остатка - снимаем.
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|Выбрать НовТаб.Номенклатура, НовТаб.Количество
	|Поместить НовТаб
	|из &НовТаб КАК НовТаб
	|;
	|
	|Выбрать Номенклатура, Сумма(Остаток) - Сумма(Резерв) КАК СвобОст
	|Поместить Остатки
	|из
	|(
	|Выбрать Номенклатура, КоличествоОстаток Остаток,0 Резерв 
	|из
	|РегистрНакопления.ТоварыНаСкладах.Остатки(,Номенклатура в (Выбрать Номенклатура из НовТаб) и Склад = &Склад)
	|
	|Объединить все
	|
	|Выбрать Номенклатура, 0,КоличествоОстаток 
	|из
	|РегистрНакопления.ТоварыВРезерве.Остатки(,Номенклатура в (Выбрать Номенклатура из НовТаб) и Размещение = &Склад)
	|) вт
	|Сгруппировать по Номенклатура
	|;
	|
	|Выбрать НовТаб.Номенклатура, НовТаб.Количество - isnull(Остатки.СвобОст,0) Списать, &Склад Размещение, Неопределено Заказ, 0 Количество
	|из
	|НовТаб
	|Левое Соединение Остатки
	|По НовТаб.Номенклатура = Остатки.Номенклатура
	|ГДЕ НовТаб.Количество - isnull(Остатки.СвобОст,0) > 0
	|;
	|
	|Выбрать Номенклатура, ДокументРезерва Заказ, ДокументРезерва.Дата Дата, КоличествоОстаток 
	|из
	|РегистрНакопления.ТоварыВРезерве.Остатки(,Номенклатура в (Выбрать Номенклатура из НовТаб) и Размещение = &Склад)
	|Упорядочить по ДокументРезерва.Дата Убыв
	|
	|";
	Запрос.УстановитьПараметр("НовТаб",НовТаб);
	Запрос.УстановитьПараметр("Склад",Склад);
	Пакет = Запрос.ВыполнитьПакет();
	Выборка = Пакет[2].Выбрать();
	ТабСн = Пакет[2].Выгрузить().СкопироватьКолонки();
	Зак = Пакет[3].Выгрузить();
	
	
	Пока Выборка.Следующий() Цикл
		Списать = Выборка.Списать;
		Отбор = Новый Структура("Номенклатура", Выборка.Номенклатура);
		Строки = Зак.НайтиСтроки(Отбор);
		Для Каждого СтрЗак из Строки Цикл
			Списываем = мин(Списать,СтрЗак.КоличествоОстаток);
			Если Списываем<=0 Тогда Продолжить; КонецЕсли;
			
			НовСтр = ТабСн.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр,Выборка);
			НовСтр.Заказ = СтрЗак.Заказ;
			НовСтр.Количество = Списываем;
			
			Списать = Списать - Списываем;
		КонецЦикла;	
		
		Если Списать>0 Тогда
			//такого не может быть
			//если все таки может - придумайте что с этим делать
		КонецЕсли;	
		
	КонецЦикла;	
	
	//заполняем снятие резервов
	Если ТабСн.Количество() Тогда
		Док = Документы.СнятиеРезерва.СоздатьДокумент();
		Док.Дата = ТекущаяДата();
		Док.Товары.Загрузить(ТабСн);
		Док.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
	
	
	//перемещаем в ячейку "в поиске"
	Если НовТаб.Количество() Тогда
		Док = Документы.ПеремещениеТоваров.СоздатьДокумент();
		Док.Дата = ТекущаяДата();
		Док.СкладОтправитель = Склад;
		Док.СкладПолучатель = Склад;
		Док.Процесс = Ссылка;
		
		Док.Товары.Загрузить(НовТаб);
		
		Док.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
КонецПроцедуры


Процедура ОбработатьИзлишки()
	
	НовТаб = Товары.Выгрузить().СкопироватьКолонки();
	НовТаб.Колонки.Добавить("ЯчейкаОтправитель");
	НовТаб.Колонки.Добавить("ЯчейкаПолучатель");
	НовТаб.Колонки.Добавить("Количество");
	
	Для Каждого Стр Из Товары Цикл
		Если Стр.КоличествоРасхождение > 0 Тогда
			НовСтр = НовТаб.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтр,Стр);
			НовСтр.ЯчейкаОтправитель = Склад.ЯчейкаНеНайдено;
			НовСтр.ЯчейкаПолучатель = Стр.Ячейка;
			НовСтр.Количество = Стр.КоличествоРасхождение;
		КонецЕсли;
	КонецЦикла;
	
	
	Если НовТаб.Количество() Тогда
	Док = Документы.ПеремещениеТоваров.СоздатьДокумент();
	Док.Дата = ТекущаяДата();
	Док.СкладОтправитель = Склад;
	Док.СкладПолучатель = Склад;
	Док.Процесс = Ссылка;
	
	Док.Товары.Загрузить(НовТаб);
	
	Док.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	
КонецПроцедуры


Процедура ПриемИнвентаризацииОбработка(ТочкаМаршрутаБизнесПроцесса)
	
	НачатьТранзакцию();
	
	// Снимем резерв по ячейкам
	ДокОбъект = ДокИнвентаризация.ПолучитьОбъект();
	ДокОбъект.ИнвентаризацияПринята = Истина;
	ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	ОбработатьНедостачи();
	
	ОбработатьИзлишки();
	
	ЗафиксироватьТранзакцию();
	
	
	// Снимем резерв
	
	//ПровестиДокументыИнвентаризацийСторно();
	
	// Перместим товар
	
	//СоздатьПеремещениеВникуда();
	
	//// Оприходуем товар
	//
	//
	//Оприходование = Документы.ОприходованиеТоваров.СоздатьДокумент();
	//Оприходование.Заполнить(Ссылка);
	//Оприходование.Дата = ТекущаяДата();
	//
	//Оприходование.Записать(РежимЗаписиДокумента.Проведение);
	//
	//// Спишем товар
	//
	//Списание = Документы.СписаниеТоваров.СоздатьДокумент();
	//Списание.Заполнить(Ссылка);
	//Списание.Дата = ТекущаяДата();
	//
	//Списание.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры


Процедура СоздатьПеремещениеВникуда()
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ
	|	Номенклатура 				Номенклатура,
	|	Ячейка 						Ячейка,
	|	СУММА(КоличествоУчет) 		КоличествоУчет,
	|	СУММА(КоличествоФакт)       КоличествоФакт
	|ПОМЕСТИТЬ
	|	ТаблицаТовара
	|ИЗ
	|	БизнесПроцесс.ЯчеестаяИнвентаризация.Товары ГДЕ	Ссылка = &Ссылка	
	|СГРУППИРОВАТЬ ПО Номенклатура, Ячейка
	|
	|;
	|ВЫБРАТЬ
	|	Таб.Номенклатура,
	|	Таб.Ячейка,
	|	Таб.Ячейка				ЯчейкаОтправитель,
	|	ЯчОбщ.Количество		ОбщееКоличествоВЯчейках,
	|	Ост.КоличествоОстаток 	ОбщееКоличествоНаСкладе,
	|	ЕСТЬNULL(Рез.КоличествоОстаток, 0)					КоличествоРезервСклад,
	|	Таб.КоличествоУчет,			
	|	Таб.КоличествоФакт - Таб.КоличествоУчет 			КоличествоРасхождение,
	|	ВЫБОР КОГДА Ост.КоличествоОстаток = ЯчОбщ.Количество 
	|			ТОГДА ВЫБОР КОГДА Рез.КоличествоОстаток - Ост.КоличествоОстаток + Таб.КоличествоУчет > 0 ТОГДА Рез.КоличествоОстаток - Ост.КоличествоОстаток + Таб.КоличествоУчет ИНАЧЕ 0 КОНЕЦ
	|			ИНАЧЕ 0
	|	КОНЕЦ КоличествоКПеремещению,
	|	ВЫБОР КОГДА Ост.КоличествоОстаток = ЯчОбщ.Количество 
	|			ТОГДА ВЫБОР КОГДА Рез.КоличествоОстаток - Ост.КоличествоОстаток + Таб.КоличествоУчет > 0 ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ
	|			ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ НужноПереместить
	|ИЗ
	|	ТаблицаТовара Таб
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	(
	|		ВЫБРАТЬ 
	|			Яч.Номенклатура, Яч.КоличествоОстаток + ЕСТЬNULL(Сбор.СобраноОстаток,0) Количество
	|		ИЗ 
	|			РегистрНакопления.ТоварыВЯчейках.Остатки(,Ячейка.Владелец = &Склад И Номенклатура В(ВЫБРАТЬ Номенклатура ИЗ ТаблицаТовара)) Яч
	|		ЛЕВОЕ СОЕДИНЕНИЕ 
	|			РегистрНакопления.СборкаЗаказа.Остатки(,СкладЯчейка ССЫЛКА Справочник.Ячейки И СкладЯчейка.Владелец = &Склад И Номенклатура В(ВЫБРАТЬ Номенклатура ИЗ ТаблицаТовара)) Сбор
	|		ПО 
	|			Яч.Номенклатура = Сбор.Номенклатура
	|	) ЯчОбщ
	|ПО
	|	ЯчОбщ.Номенклатура = Таб.Номенклатура
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(,Склад = &Склад И Номенклатура В(ВЫБРАТЬ Номенклатура ИЗ ТаблицаТовара)) Ост
	|ПО
	|	Таб.Номенклатура = Ост.Номенклатура
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ТоварыВРезерве.Остатки(,
	|								ВЫБОР КОГДА ДокументРезерва ССЫЛКА Документ.Инвентаризация И ДокументРезерва.Процесс = &Ссылка ТОГДА ЛОЖЬ ИНАЧЕ ИСТИНА КОНЕЦ И 
	|								Размещение = &Склад И 
	|								Номенклатура В(ВЫБРАТЬ Номенклатура ИЗ ТаблицаТовара)) Рез
	|ПО
	|	Таб.Номенклатура = Рез.Номенклатура
	|
	|");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Склад", 	Склад);
	
	ТЗТовары = Запрос.Выполнить().Выгрузить();
	  
	// Проверим ячейки которые не правильно определеили резерв
	
	Для Каждого Строка Из ТЗТовары Цикл
		
		Отбор = Новый Структура("Номенклатура", Строка.Номенклатура);
		СуммаПоЭтимЯчейкам = КонвертацияТипов.ПолучитьСуммуКолонкиПоУсловию(ТЗТовары, "КоличествоУчет", Отбор);
		Если СуммаПоЭтимЯчейкам <> Строка.КоличествоУчет Тогда // косяк может быть когда товара несколько
			
			НужноПереместить = Строка.КоличествоРезервСклад - (Строка.ОбщееКоличествоВЯчейках - СуммаПоЭтимЯчейкам) - КонвертацияТипов.ПолучитьСуммуКолонкиПоУсловию(ТЗТовары, "КоличествоКПеремещению", Отбор);
			
			Если НужноПереместить Тогда
			
				СтрокиТовара = ТЗТовары.НайтиСтроки(Отбор);
				Для Каждого СтрокаТовара Из СтрокиТовара Цикл
					
					Перемещаем = Мин(НужноПереместить, СтрокаТовара.КоличествоУчет - СтрокаТовара.КоличествоКПеремещению);
					Если Перемещаем Тогда
						
						СтрокаТовара.КоличествоКПеремещению = СтрокаТовара.КоличествоКПеремещению + Перемещаем;
						НужноПереместить = НужноПереместить - Перемещаем;
						
					КонецЕсли;
				КонецЦикла;
				
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//Ячейки = КонвертацияТипов.ПолучитьТаблицуИзНайденныхСтрокТаблицыЗначений(ТЗТовары, Новый Структура("НужноПереместить", Истина));
	ТЗТовары.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15, 3)));
	ТЗТовары.Колонки.Добавить("ОтправитьВПоиск", Новый ОписаниеТипов("Булево"));
	
	Для Каждого СтрокаТовар Из ТЗТовары Цикл
		
		ВПоиск = 0;
		
		// Если нужно что-то списать, а оно требеует перемещения
		
		Если СтрокаТовар.НужноПереместить И СтрокаТовар.КоличествоРасхождение < 0 Тогда
			НадоСписать = - СтрокаТовар.КоличествоРасхождение;
			МогуСписать = СтрокаТовар.КоличествоУчет - СтрокаТовар.КоличествоКПеремещению;
			СтрокаТовар.КоличествоРасхождение = ?( НадоСписать > МогуСписать, - МогуСписать, - НадоСписать);
			СтрокаТовар.Количество = ?( НадоСписать > МогуСписать, НадоСписать - МогуСписать, 0);
			СтрокаТовар.ОтправитьВПоиск = СтрокаТовар.Количество > 0;
		КонецЕсли;
		
	КонецЦикла;
	
	// СОЗДАТЬ ДОКУМЕНТ ПЕРЕМЕЩЕНИЕ ДЛЯ ТОВАРОВ, КОТОРЫЕ НЕЛЬЗЯ СПИСАТЬ ИЗ-ЗА РЕЗЕРВА	
	
	ЯчейкаВПоиске = Справочники.Ячейки.НайтиПоНаименованию("в.по.ис.ке");
	Таб = КонвертацияТипов.ПолучитьТаблицуИзНайденныхСтрокТаблицыЗначений(ТЗТовары, Новый Структура("ОтправитьВПоиск", Истина));
	Таб.Колонки.Добавить("ЯчейкаПолучатель", Новый ОписаниеТипов("СправочникСсылка.Ячейки"));	
	Таб.ЗаполнитьЗначения(ЯчейкаВПоиске, "ЯчейкаПолучатель");
	
	Перемещение = Документы.ПеремещениеТоваров.СоздатьДокумент();
	Перемещение.СкладОтправитель = Склад;
	Перемещение.СкладПолучатель = Склад;
	Перемещение.Процесс  = Ссылка;
	Перемещение.Дата = ТекущаяДата();
	Перемещение.Товары.Загрузить(Таб);
	
	Перемещение.Записать(РежимЗаписиДокумента.Проведение);
	
	// СОЗДАТЬ ПЕРЕМЕЩЕНИЕ ТОВАРОВ, КОТОРЫЕ НАЙДЕНЫ (ИХ ОПРИХОДОВАТЬ НЕ НАДО)
	
	Перемещение = Документы.ПеремещениеТоваров.СоздатьДокумент();
	Перемещение.СкладОтправитель = Склад;
	Перемещение.СкладПолучатель = Склад;
	Перемещение.Процесс  = Ссылка;
	Перемещение.Дата = ТекущаяДата();	
	
	// СОЗДАТЬ СПИСАНИЕ ТОВАРОВ, КОТОРЫЕ МОЖНО СПИСАТЬ
	
	Списание = Документы.СписаниеТоваров.СоздатьДокумент();
	Списание.Процесс = Ссылка;
	Списание.Склад 	= Склад;
	Списание.Дата = ТекущаяДата();
	
	// СОЗДАТЬ ОПРИХОДОВАНИЕ ТОВАРОВ (ЗА ИСКЛЮЧЕНИЕ ТОВАРОВ КОТОРЫЕ НАЙДЕНЫ ВПОИСКЕ)
	
	Оприходование = Документы.ОприходованиеТоваров.СоздатьДокумент();
	Оприходование.Процесс = Ссылка;
	Оприходование.Склад 	= Склад;
	Оприходование.Дата = ТекущаяДата();
	
	ТЧТоварыСписать = Списание.Товары;
	ТЧТоварыДобавить = Оприходование.Товары;
	ТЧПереместитьИзНикуда = Перемещение.Товары;
	
	// будем запоминать, какие потерешки учли, т.к. если записей товара несколько, но в разных ячейках, то количество учтенных потеряшек надо знать
	УчтеныНайденныеВПоиске = Новый Соответствие;
	
	Для Каждого СтрокаТовар ИЗ ТЗТовары Цикл
		Если СтрокаТовар.КоличествоРасхождение < 0 Тогда
			НовСтрока = ТЧТоварыСписать.Добавить();
			НовСтрока.Ячейка = СтрокаТовар.Ячейка;
			НовСтрока.Номенклатура = СтрокаТовар.Номенклатура;
			НовСтрока.Количество = - СтрокаТовар.КоличествоРасхождение;
		ИначеЕсли 
			СтрокаТовар.КоличествоРасхождение > 0 Тогда
			
		    // узнаем, может товар ищут, и оприходовать его не надо
			ВПоиске = ТоварВПоиске(СтрокаТовар.Номенклатура);
			
			ТекЗначение = УчтеныНайденныеВПоиске.Получить(СтрокаТовар.Номенклатура);	
			ВПоиске = ?(ТекЗначение = Неопределено, ВПоиске, ВПоиске - ТекЗначение);  
							
			// если товара нет в розыске, оприходуем его
			Если НЕ ВПоиске Тогда
				
				НовСтрока = ТЧТоварыДобавить.Добавить();
				НовСтрока.Ячейка = СтрокаТовар.Ячейка;
				НовСтрока.Номенклатура = СтрокаТовар.Номенклатура;
				НовСтрока.Количество = СтрокаТовар.КоличествоРасхождение;
				
			// если товар был потерян, переместим его из потеряшек в ячейку, где его нашли
			Иначе
				
				//СтрокиТовара = ТЗТовары.НайтиСтроки(Новый Структура("Номенклатура", СтрокаТовар.Номенклатура));
				
				// если товар лежит в одной ячейке
				//Если СтрокиТовара.Количество() = 1 Тогда
					

					// если количество нашедшегося товара меньше или равно, чем количество в поиске, тогда оприходовать нечего, перемещаем его весь из потеряшек
					

					Если СтрокаТовар.КоличествоРасхождение <= ВПоиске Тогда
							
						НовСтрока = ТЧПереместитьИзНикуда.Добавить();
						НовСтрока.ЯчейкаПолучатель = СтрокаТовар.Ячейка;
						НовСтрока.ЯчейкаОтправитель = ЯчейкаВПоиске;
						НовСтрока.Номенклатура = СтрокаТовар.Номенклатура;
						НовСтрока.Количество = СтрокаТовар.КоличествоРасхождение;
						
						ТекЗначение = УчтеныНайденныеВПоиске.Получить(НовСтрока.Номенклатура);						
						УчтеныНайденныеВПоиске.Вставить(НовСтрока.Номенклатура, ?(ТекЗначение = Неопределено, 0, ТекЗначение) + НовСтрока.Количество);  
						
					// если все потеряшки нашли дом, переместим их) остальное оприходуем
						
					Иначе
						
						НовСтрока = ТЧПереместитьИзНикуда.Добавить();
						НовСтрока.ЯчейкаПолучатель = СтрокаТовар.Ячейка;
						НовСтрока.ЯчейкаОтправитель = ЯчейкаВПоиске;
						НовСтрока.Номенклатура = СтрокаТовар.Номенклатура;
						НовСтрока.Количество = ВПоиске;
						
						ТекЗначение = УчтеныНайденныеВПоиске.Получить(НовСтрока.Номенклатура);						
						УчтеныНайденныеВПоиске.Вставить(НовСтрока.Номенклатура, ?(ТекЗначение = Неопределено, 0, ТекЗначение) + НовСтрока.Количество);  						
						
						НовСтрока = ТЧТоварыДобавить.Добавить();
						НовСтрока.Ячейка = СтрокаТовар.Ячейка;
						НовСтрока.Номенклатура = СтрокаТовар.Номенклатура;
						НовСтрока.Количество = СтрокаТовар.КоличествоРасхождение - ВПоиске;
					КонецЕсли;
					
				//ИначеЕсли СтрокиТовара.Количество() > 1 Тогда
				//	
				//КонецЕсли;
					 			
			КонецЕсли	
			
		КонецЕсли;
		
	КонецЦикла;
	Если ТЧТоварыСписать.Количество() Тогда
		Списание.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	Если ТЧТоварыДобавить.Количество() Тогда
		Оприходование.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	Если ТЧПереместитьИзНикуда.Количество() Тогда 
		Перемещение.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;

КонецПроцедуры
