
&НаСервере
Функция НайтиСборкуЗаказа(Заказ)
	
	Запрос = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Задача.ЗадачаПользователю ГДЕ Заказ = &Заказ И ТочкаМаршрута = &ТочкаМаршрутаСобрать И Не Выполнена");
	
	Точки = БизнесПроцессы.СборкаЗаказа.ТочкиМаршрута;
	
	Запрос.УстановитьПараметр("ТочкаМаршрутаСобрать", 	Точки.СобратьЗаказ);
	Запрос.УстановитьПараметр("ТочкаМаршрутаСобрать", 	Точки.СобратьЗаказ1);
	Запрос.УстановитьПараметр("Заказ", 					Заказ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда Возврат Выборка.Ссылка; КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Перем ДокументСсылка, СборщикСсылка;
	
	МассивНоменклатуры = ВнешнееОборудование.СкачатьДанныеСТерминала(,ДокументСсылка, СборщикСсылка);
	Если МассивНоменклатуры <> Неопределено Тогда
		
		// Проверим чтобы был заказ
		
		Если ДокументСсылка = Неопределено Тогда ПоказатьПредупреждение(,"В ТСД не отсканирован заказ!",,"Сообщение!"); Возврат КонецЕсли;
		
		// Найдем форму сборки заказа
		
		ЗадачаСобратьЗаказ = НайтиСборкуЗаказа(ДокументСсылка);
		Если ЗадачаСобратьЗаказ = Неопределено Тогда ПоказатьПредупреждение(,"Не найдена задача сборки заказа
																	|" + ДокументСсылка,,"Сообщение!"); Возврат КонецЕсли;
		// Откром форму задачи
		
		ФормаЗадачи = ПолучитьФорму("БизнесПроцесс.СборкаЗаказа.Форма.Задача_СобратьЗаказ", Новый Структура("Ключ", ЗадачаСобратьЗаказ),,ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
		ФормаЗадачи.Открыть();
		
		// Откроем форму сравнения
		
		ОткрытьФорму("ОбщаяФорма.СравненияДанныхСТСД", 
					Новый Структура("ИмяТаблицыДокумента, МассивНоменклатуры, ДокументСсылка, Сборщик",
													"Товары", МассивНоменклатуры, ДокументСсылка, СборщикСсылка), ФормаЗадачи);КонецЕсли;
КонецПроцедуры
