
&НаСервере
Функция ПолучитьТекстHTML()
	
	Возврат ПолучитьОбщийМакет("ИнформацияОСистемеHTML").ПолучитьТекст();
	
КонецФункции
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	//ОткрытьФорму("ОбщаяФорма.", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
	#Если ВебКлиент Тогда
		
		ПоказатьПредупреждение(,"В веб браузере эта информация пока не доступна",,"Сообщение");
		Возврат;
		
	#Иначе
		
	врФайл = ПолучитьИмяВременногоФайла("html");
	
	Док = Новый ТекстовыйДокумент;
	Док.УстановитьТекст(ПолучитьТекстHTML());
	Док.Записать(врФайл);
	
	ЗапуститьПриложение(врФайл);
	
	#КонецЕсли
	
КонецПроцедуры
