

&НаСервере
Процедура ЗагрузитьСервере(СправочникСсылка)

	стрОшибки = "";
	
	Если Не COMServer.ЗагрузитьОбъекты(СправочникСсылка,, стрОшибки) Тогда
		
		ОбщиеФункции.СообщитьТекст(стрОшибки);
		
	Иначе
		
		ОбщиеФункции.СообщитьТекст("Справочник загружен");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	// Вставить содержимое обработчика.
	// ПараметрыФормы = Новый Структура("", );
	// ОткрытьФорму("WSProxy", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
	Если Вопрос("Загрузить все из 81?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ЗагрузитьСервере("");
	
КонецПроцедуры
