
&НаСервере
Функция ПолучитьПараметрыДляТабличногоДокумента(Ссылки, СтрНомер)
	
	Возврат Заказы.ПолучитьПараметрыДляТабличногоДокумента(Ссылки, СтрНомер);
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДок = Новый ТабличныйДокумент;
	Печать(ТабДок, ПараметрКоманды);

	ФункцииФормДокументов.УстановитьНастройкиТабличногоДокумента(ТабДок);
	
	ТабДок.ДвусторонняяПечать = ТипДвустороннейПечати.ПереворотВлево;

	СтрНомера = "";
	ДополнительныеПараметры = ПолучитьПараметрыДляТабличногоДокумента(ПараметрКоманды, СтрНомера);
	ОткрытьФорму("ОбщаяФорма.ТабличныйДокумент", Новый Структура("ТабличныйДокумент, ИмяФайла, ДополнительныеПараметры", ТабДок, СтрНомера, ДополнительныеПараметры),ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

&НаСервере
Процедура Печать(ТабДок, ПараметрКоманды)
	
	Инд = -1;
	Для Каждого Ссылка Из ПараметрКоманды Цикл Инд = Инд + 1; Если Инд Тогда ТабДок.ВывестиГоризонтальныйРазделительСтраниц();КонецЕсли;                                                           
		
		Если ТипЗнч(Ссылка) = Тип("БизнесПроцессСсылка.ЗаявкаПокупателя") Тогда
			Документы.ЗаказПокупателя.Печать_СчетЗаказ(ТабДок, Ссылка.Заказ, "Счет",,"Инструмент");
		ИначеЕсли
			ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
			Документы.ЗаказПокупателя.Печать_СчетЗаказ(ТабДок, Ссылка, "Счет",,"Инструмент");
        ИначеЕсли
			ТипЗнч(Ссылка) = Тип("ДокументСсылка.ИнтернетЗаказПокупателя") Тогда
			Документы.ЗаказПокупателя.Печать_СчетЗаказ(ТабДок, Ссылка, "Счет",,"Инструмент",,,"ИнтернетЗаказПокупателя");
		ИначеЕсли
			ТипЗнч(Ссылка) = Тип("БизнесПроцессСсылка.ИнтернетЗаявка") Тогда
			Документы.ЗаказПокупателя.Печать_СчетЗаказ(ТабДок, Ссылка.Заказ, "Счет",,"Инструмент",,,"ИнтернетЗаказПокупателя");
		ИначеЕсли
			ТипЗнч(Ссылка) = Тип("ДокументСсылка.РеализацияТоваров") Тогда
			Документы.ЗаказПокупателя.Печать_СчетЗаказ(ТабДок, Ссылка, "Счет",,"Инструмент",,,"РеализацияТоваров");
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры