
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	Если Данные.Ссылка <> Неопределено Тогда
		СтандартнаяОбработка = Ложь;
		Представление = "ОС " + Данные.Код;
	КонецЕсли;

КонецПроцедуры

Функция ПолучитьМассивЗадач(Ссылка) Экспорт
		МассивЗадач = Новый Массив;
		
		Запрос = Новый Запрос("ВЫБРАТЬ Задача ИЗ РегистрСведений.СборочныеЛисты ГДЕ ОбъедененнаяСборка = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл МассивЗадач.Добавить(Выборка.Задача); КонецЦикла;
		
	Возврат МассивЗадач;	
	
КонецФункции