
&НаСервере
Процедура СохранитьНастройку()
	
	ОбщиеФункции.УстановитьНастройкуПользователя(ПутьККартинкам, "ПутьККартинкам");
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьККартинкамНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДВ = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Если ДВ.Выбрать() Тогда
		
		ПутьККартинкам = ДВ.Каталог;
		СохранитьНастройку();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПутьККартинкам = ОбщиеФункции.НастройкаПользователя("ПутьККартинкам");
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСсылкиККартинкам()
	
	Запрос = Новый Запрос("ВЫБРАТЬ Ссылка процесс, Ссылка.Номер Каталог, Картинка ИЗ БизнесПроцесс.РемонтИнструмента.Картинки");
	СсылкиКартинок.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИзХранилища(СсылкаКартинки)
	
	Возврат ПоместитьВоВременноеХранилище(СсылкаКартинки.Картинка.Получить());
	
КонецФункции
&НаКлиенте
Функция ЗаписатьКартинку(Строка)
	
	Адрес = ПолучитьИзХранилища(Строка.Картинка);
	
	Файл = Новый Файл(ПутьККартинкам + "\" + Строка.Каталог);
	Если Не Файл.Существует() Тогда
		
		Попытка
			СоздатьКаталог(Файл.ПолноеИмя);
		Исключение
			
			стрОшибки = ОписаниеОшибки();
			ОбщиеФункции.СообщитьТекст("Ошибка при создании каталога
				|" + стрОшибки);
			Возврат Ложь;
		
		КонецПопытки;
		
	КонецЕсли;
	
	ПутьКартинки = Файл.ПолноеИмя + "\"+ Строка(строка.Картинка);
	
	// Проверим что такой уже есть
	
	Если Не Перезаписывать Тогда
		
		ФайлКартинки = Новый Файл(ПутьКартинки);
		Если ФайлКартинки.Существует() Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	текКартинка = ПолучитьИзВременногоХранилища(ПолучитьИзХранилища(Строка.Картинка));
	
	Попытка
		
		текКартинка.Записать(ПутьКартинки);
		
	Исключение
		
		стрОшибки = ОписаниеОшибки();
		ОбщиеФункции.СообщитьТекст("Ошибка при записи картинки
				|" + стрОшибки);
		Возврат Ложь;
		
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции
&НаКлиенте
Процедура Выгрузить(Команда)
	
	ЗагрузитьСсылкиККартинкам();
	
	ном = 0; КолВсего = СсылкиКартинок.Количество();
	Для Каждого строка Из СсылкиКартинок Цикл ном = ном + 1; Состояние(Строка.Процесс, ном / КолВсего * 100, Строка.Картинка);
		
		Если Не ЗаписатьКартинку(строка) Тогда
			ПоказатьПредупреждение(,"При записи произошли ошибки",,"Ошибка!");
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
	ОбщиеФункции.СообщитьТекст("Картинки выружены в " + ПутьККартинкам);
	
КонецПроцедуры
