
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	ОбновитьAlies();
КонецПроцедуры

&НаСервере
Процедура ОбновитьAlies(Переписать = Ложь)
	
	Если Не ПустаяСтрока(Объект.Наименование) И
			(Переписать Или ПустаяСтрока(Объект.alies) Или КонвертацияТипов.ЕстьРусскиеБуквы(Объект.alies)) Тогда
			                                                                                  
		Объект.alies = НРег(КонвертацияТипов.ПреобразоватьРусскийТекстВАнглицкий(HTTP.СформироватьAliesИзНаименования2(Объект.Наименование))); КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИзНаименования(Команда)
	ОбновитьAlies(Истина);
КонецПроцедуры
