
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Объект.ДатаАнализа = ТекущаяДата();
	Объект.КоличествоЛетДляРасчетаТренда = 4;
	
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	Объект.ДанныеПродаж.Очистить();
	
	ОчиститьОстальныеТЧ();
	
	ЗаполнитьНаСервере();
	
	Если ЗаТекущийПериодУжеЕстьДанные(ДобавитьМесяц(КонецГода(Объект.ДатаАнализа), 1), ?(ЗначениеЗаполнено(Объект.Номенклатура), Объект.Номенклатура, Неопределено)) Тогда
		
		Элементы.Сообщение.Заголовок = "За " + Год(ДобавитьМесяц(КонецГода(Объект.ДатаАнализа), 1)) + " уже есть данные!";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Анализ(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("АнализПродолжить", ЭтаФорма, Параметры);
	ПоказатьВопрос(ОписаниеОповещения, "Выполнить анализ?", РежимДиалогаВопрос.ДаНет,, КодВозвратаДиалога.Нет);
		
КонецПроцедуры

&НаКлиенте
Процедура АнализПродолжить(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	ОчиститьОстальныеТЧ();
	
	Состояние("1-9. Заполнение По пяти точкам");
	ЗаполнитьНаСервереПоПятиТочкам();
	
	Состояние("2-9. Заполнение По двенадцати точкам");
	ЗаполнитьНаСервереПодвенадцатиТочкам();
	
	Состояние("3-9. Заполнение Между двумя крайними точками");
	ЗаполнитьНаСервереМеждуДвумяКрайнимиТочками();
	
	Состояние("4-9. Заполнение Сезонность");
	ЗаполнитьНаСервереСезонность();
	
	Состояние("5-9. Заполнение Сезонность усредненная");
	ЗаполнитьНаСервереСезонностьУсредненная();
	
	Состояние("6-9. Заполнение Сезонность усредненная с нормировкой");
	ЗаполнитьНаСервереСезонностьУсредненнаяСНормировкой();
	
	Состояние("7-9. Заполнение Данные продаж без сезонности");
	ЗаполнитьНаСервереДанныеПродажБезСезонности();
	
	Состояние("8-9. Заполнение Данные продаж тренд");
	ЗаполнитьНаСервереДанныеПродажТренд();
	
	Состояние("9-9. Заполнение Данные продаж ошибки прогноза");
	ЗаполнитьНаСервереДанныеПродажОшибкиПрогноза();
	
	ПоказатьПредупреждение(, "Анализ завершен!");
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОстальныеТЧ()
	
	Объект.ПоПятиТочкам.Очистить();
	Объект.ПоДвенадцатиТочкам.Очистить();
	Объект.МеждуДвумяКрайнимиТочками.Очистить();
	Объект.Сезонность.Очистить();
	Объект.СезонностьУсредненная.Очистить();
	Объект.СезонностьУсредненнаяСНормировкой.Очистить();
	Объект.ДанныеПродажБезСезонности.Очистить();
	Объект.ДанныеПродажТренд.Очистить();
	Объект.ДанныеПродажОшибкиПрогноза.Очистить();
	Объект.ДанныеПродажТрендДалее.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогФыбораФайла			= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогФыбораФайла.Заголовок	= "Выберите каталог";
	
	Если ДиалогФыбораФайла.Выбрать() Тогда
		Объект.ПутьКФайлу = ДиалогФыбораФайла.Каталог;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	
	Элементы.ДанныеПродаж.ОтборСтрок = Неопределено;
	
	Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		
		Элементы.ДанныеПродаж.ОтборСтрок = Новый ФиксированнаяСтруктура("Номенклатура", Объект.Номенклатура);
		Элементы.ПоПятиТочкам.ОтборСтрок = Новый ФиксированнаяСтруктура("Номенклатура", Объект.Номенклатура);
		Элементы.ПоДвенадцатиТочкам.ОтборСтрок = Новый ФиксированнаяСтруктура("Номенклатура", Объект.Номенклатура);
		Элементы.МеждуДвумяКрайнимиТочками.ОтборСтрок = Новый ФиксированнаяСтруктура("Номенклатура", Объект.Номенклатура);
		Элементы.Сезонность.ОтборСтрок = Новый ФиксированнаяСтруктура("Номенклатура", Объект.Номенклатура);
		Элементы.СезонностьУсредненная.ОтборСтрок = Новый ФиксированнаяСтруктура("Номенклатура", Объект.Номенклатура);
		Элементы.СезонностьУсредненнаяСНормировкой.ОтборСтрок = Новый ФиксированнаяСтруктура("Номенклатура", Объект.Номенклатура);
		Элементы.ДанныеПродажБезСезонности.ОтборСтрок = Новый ФиксированнаяСтруктура("Номенклатура", Объект.Номенклатура);
		Элементы.ДанныеПродажТренд.ОтборСтрок = Новый ФиксированнаяСтруктура("Номенклатура", Объект.Номенклатура);
		Элементы.ДанныеПродажОшибкиПрогноза.ОтборСтрок = Новый ФиксированнаяСтруктура("Номенклатура", Объект.Номенклатура);
		
	Иначе

		Элементы.ДанныеПродаж.ОтборСтрок = Неопределено;
		Элементы.ПоПятиТочкам.ОтборСтрок = Неопределено;
		Элементы.ПоДвенадцатиТочкам.ОтборСтрок = Неопределено;
		Элементы.МеждуДвумяКрайнимиТочками.ОтборСтрок = Неопределено;
		Элементы.Сезонность.ОтборСтрок = Неопределено;
		Элементы.СезонностьУсредненная.ОтборСтрок = Неопределено;
		Элементы.СезонностьУсредненнаяСНормировкой.ОтборСтрок = Неопределено;
		Элементы.ДанныеПродажБезСезонности.ОтборСтрок = Неопределено;
		Элементы.ДанныеПродажТренд.ОтборСтрок = Неопределено;
		Элементы.ДанныеПродажОшибкиПрогноза.ОтборСтрок = Неопределено;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДанные(Команда)
	
	Если Объект.ДанныеПродажТренд.Количество() = 0 Тогда
		Сообщить("Не заполнены Данные продаж Тренд!", СтатусСообщения.Внимание);
		Возврат;
	КонецЕсли;
	
	Если Объект.УжеЕстьДанныеЗаПериод Тогда
		ПоказатьПредупреждение(, "За текущий период уже есть данные!");
		Возврат;
	КонецЕсли;
		
	ЗаписатьДанныеНаСервере();
	
	ПоказатьПредупреждение(, "Данные записаны!");
	
КонецПроцедуры

&НаКлиенте
Процедура ПостроитьДиаграмму(Команда)
	
	Если Объект.ДанныеПродажТренд.Количество() = 0 Тогда
		Сообщить("Не заполнены Данные продаж Тренд!", СтатусСообщения.Внимание);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		Сообщить("Необходимо указать номенклатуру для построения диаграммы!", СтатусСообщения.Внимание);
		Возврат;
	КонецЕсли;
	
	ПостроитьДиаграммуНаСервере();
	ПостроитьДиаграммуТрендНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВExcel(Команда)
	
	ТабДок = ВыгрузитьВExcelНаСервере(1);
	Если НЕ ТабДок = Неопределено Тогда
		
		ТабДок.Показать("Данные продаж");
		
	КонецЕсли;
	
	ТабДок = ВыгрузитьВExcelНаСервере(2);
	Если НЕ ТабДок = Неопределено Тогда
		
		ТабДок.Показать("Данные продаж без сезонности");
		
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Т.Месяц,
	|	Т.Номенклатура,
	|	МАКСИМУМ(Т.ОбъемКолОборот1) КАК ОбъемКолОборот1,
	|	МАКСИМУМ(Т.ОбъемКолОборот2) КАК ОбъемКолОборот2,
	|	МАКСИМУМ(Т.ОбъемКолОборот3) КАК ОбъемКолОборот3,
	|	МАКСИМУМ(Т.ОбъемКолОборот4) КАК ОбъемКолОборот4
	|ИЗ
	|	(ВЫБРАТЬ
	|		МЕСЯЦ(Календарь.Дата) КАК Месяц,
	|		ДанныеПродажОбороты.Номенклатура КАК Номенклатура,
	|		СУММА(ЕСТЬNULL(ДанныеПродажОбороты.СреднееКоличествоПродаж, 0)) КАК ОбъемКолОборот1,
	|		0 КАК ОбъемКолОборот2,
	|		0 КАК ОбъемКолОборот3,
	|		0 КАК ОбъемКолОборот4
	|	ИЗ
	|		РегистрСведений.РабочиеДни КАК Календарь
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПродаж КАК ДанныеПродажОбороты
	|			ПО Календарь.Дата = ДанныеПродажОбороты.Период
	|				" + ?(ЗначениеЗаполнено(Объект.Номенклатура), "	И ДанныеПродажОбороты.Номенклатура = &Номенклатура", "") + "
	|	ГДЕ
	|		Календарь.Дата МЕЖДУ &НачДата1 И &КонДата1
	|		И ДанныеПродажОбороты.Период МЕЖДУ &НачДата1 И &КонДата1
	|	
	|	СГРУППИРОВАТЬ ПО
	|		МЕСЯЦ(Календарь.Дата),
	|		ДанныеПродажОбороты.Номенклатура
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		МЕСЯЦ(Календарь.Дата),
	|		ДанныеПродажОбороты.Номенклатура,
	|		0,
	|		СУММА(ЕСТЬNULL(ДанныеПродажОбороты.СреднееКоличествоПродаж, 0)),
	|		0,
	|		0
	|	ИЗ
	|		РегистрСведений.РабочиеДни КАК Календарь
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПродаж КАК ДанныеПродажОбороты
	|			ПО Календарь.Дата = ДанныеПродажОбороты.Период
	|				" + ?(ЗначениеЗаполнено(Объект.Номенклатура), "	И ДанныеПродажОбороты.Номенклатура = &Номенклатура", "") + "
	|	ГДЕ
	|		Календарь.Дата МЕЖДУ &НачДата2 И &КонДата2
	|		И ДанныеПродажОбороты.Период МЕЖДУ &НачДата2 И &КонДата2
	|	
	|	СГРУППИРОВАТЬ ПО
	|		МЕСЯЦ(Календарь.Дата),
	|		ДанныеПродажОбороты.Номенклатура
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		МЕСЯЦ(Календарь.Дата),
	|		ДанныеПродажОбороты.Номенклатура,
	|		0,
	|		0,
	|		СУММА(ЕСТЬNULL(ДанныеПродажОбороты.СреднееКоличествоПродаж, 0)),
	|		0
	|	ИЗ
	|		РегистрСведений.РабочиеДни КАК Календарь
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПродаж КАК ДанныеПродажОбороты
	|			ПО Календарь.Дата = ДанныеПродажОбороты.Период
	|				" + ?(ЗначениеЗаполнено(Объект.Номенклатура), "	И ДанныеПродажОбороты.Номенклатура = &Номенклатура", "") + "
	|	ГДЕ
	|		Календарь.Дата МЕЖДУ &НачДата3 И &КонДата3
	|		И ДанныеПродажОбороты.Период МЕЖДУ &НачДата3 И &КонДата3
	|	
	|	СГРУППИРОВАТЬ ПО
	|		МЕСЯЦ(Календарь.Дата),
	|		ДанныеПродажОбороты.Номенклатура
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		МЕСЯЦ(Календарь.Дата),
	|		ДанныеПродажОбороты.Номенклатура,
	|		0,
	|		0,
	|		0,
	|		СУММА(ЕСТЬNULL(ДанныеПродажОбороты.СреднееКоличествоПродаж, 0))
	|	ИЗ
	|		РегистрСведений.РабочиеДни КАК Календарь
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПродаж КАК ДанныеПродажОбороты
	|			ПО Календарь.Дата = ДанныеПродажОбороты.Период
	|				" + ?(ЗначениеЗаполнено(Объект.Номенклатура), "	И ДанныеПродажОбороты.Номенклатура = &Номенклатура", "") + "
	|	ГДЕ
	|		Календарь.Дата МЕЖДУ &НачДата4 И &КонДата4
	|		И ДанныеПродажОбороты.Период МЕЖДУ &НачДата4 И &КонДата4
	|	
	|	СГРУППИРОВАТЬ ПО
	|		МЕСЯЦ(Календарь.Дата),
	|		ДанныеПродажОбороты.Номенклатура) КАК Т
	|ГДЕ
	|	НЕ Т.Номенклатура ЕСТЬ NULL 
	|
	|СГРУППИРОВАТЬ ПО
	|	Т.Месяц,
	|	Т.Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Т.Месяц,
	|	Т.Номенклатура.Наименование";
	Запрос.УстановитьПараметр("НачДата1", ДобавитьМесяц(НачалоГода(Объект.ДатаАнализа), -36));
	Запрос.УстановитьПараметр("КонДата1", ДобавитьМесяц(КонецГода(Объект.ДатаАнализа), -36));
	Запрос.УстановитьПараметр("НачДата2", ДобавитьМесяц(НачалоГода(Объект.ДатаАнализа), -24));
	Запрос.УстановитьПараметр("КонДата2", ДобавитьМесяц(КонецГода(Объект.ДатаАнализа), -24));
	Запрос.УстановитьПараметр("НачДата3", ДобавитьМесяц(НачалоГода(Объект.ДатаАнализа), -12));
	Запрос.УстановитьПараметр("КонДата3", ДобавитьМесяц(КонецГода(Объект.ДатаАнализа), -12));
	Запрос.УстановитьПараметр("НачДата4", НачалоГода(Объект.ДатаАнализа));
	Запрос.УстановитьПараметр("КонДата4", КонецГода(Объект.ДатаАнализа));
	Запрос.УстановитьПараметр("Номенклатура", Объект.Номенклатура);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
					
		Если Выборка.Месяц = 1 Тогда
			НСтр = Объект.ДанныеПродаж.Добавить();
			НСтр.Номенклатура	= Выборка.Номенклатура;
			НСтр.Январь1		= Выборка.ОбъемКолОборот1;
			НСтр.Январь2		= Выборка.ОбъемКолОборот2;
			НСтр.Январь3		= Выборка.ОбъемКолОборот3;
			НСтр.Январь4		= Выборка.ОбъемКолОборот4;
		КонецЕсли;
		
		НСтр = Объект.ДанныеПродаж.НайтиСтроки(Новый Структура("Номенклатура", Выборка.Номенклатура));
		Если НСтр.Количество() = 0 Тогда
			НСтр = Объект.ДанныеПродаж.Добавить();
			НСтр.Номенклатура	= Выборка.Номенклатура;
			НСтр = Объект.ДанныеПродаж.НайтиСтроки(Новый Структура("Номенклатура", Выборка.Номенклатура));
		КонецЕсли;
		
		Если Выборка.Месяц = 2 Тогда
			НСтр[0].Февраль1	= Выборка.ОбъемКолОборот1;
			НСтр[0].Февраль2	= Выборка.ОбъемКолОборот2;
			НСтр[0].Февраль3	= Выборка.ОбъемКолОборот3;
			НСтр[0].Февраль4	= Выборка.ОбъемКолОборот4;
		КонецЕсли;
		Если Выборка.Месяц = 3 Тогда
			НСтр[0].Март1		= Выборка.ОбъемКолОборот1;
			НСтр[0].Март2		= Выборка.ОбъемКолОборот2;
			НСтр[0].Март3		= Выборка.ОбъемКолОборот3;
			НСтр[0].Март4		= Выборка.ОбъемКолОборот4;
		КонецЕсли;
		Если Выборка.Месяц = 4 Тогда
			НСтр[0].Апрель1		= Выборка.ОбъемКолОборот1;
			НСтр[0].Апрель2		= Выборка.ОбъемКолОборот2;
			НСтр[0].Апрель3		= Выборка.ОбъемКолОборот3;
			НСтр[0].Апрель4		= Выборка.ОбъемКолОборот4;
		КонецЕсли;
		Если Выборка.Месяц = 5 Тогда
			НСтр[0].Май1		= Выборка.ОбъемКолОборот1;
			НСтр[0].Май2		= Выборка.ОбъемКолОборот2;
			НСтр[0].Май3		= Выборка.ОбъемКолОборот3;
			НСтр[0].Май4		= Выборка.ОбъемКолОборот4;
		КонецЕсли;
		Если Выборка.Месяц = 6 Тогда
			НСтр[0].Июнь1		= Выборка.ОбъемКолОборот1;
			НСтр[0].Июнь2		= Выборка.ОбъемКолОборот2;
			НСтр[0].Июнь3		= Выборка.ОбъемКолОборот3;
			НСтр[0].Июнь4		= Выборка.ОбъемКолОборот4;
		КонецЕсли;
		Если Выборка.Месяц = 7 Тогда
			НСтр[0].Июль1		= Выборка.ОбъемКолОборот1;
			НСтр[0].Июль2		= Выборка.ОбъемКолОборот2;
			НСтр[0].Июль3		= Выборка.ОбъемКолОборот3;
			НСтр[0].Июль4		= Выборка.ОбъемКолОборот4;
		КонецЕсли;
		Если Выборка.Месяц = 8 Тогда
			НСтр[0].Август1		= Выборка.ОбъемКолОборот1;
			НСтр[0].Август2		= Выборка.ОбъемКолОборот2;
			НСтр[0].Август3		= Выборка.ОбъемКолОборот3;
			НСтр[0].Август4		= Выборка.ОбъемКолОборот4;
		КонецЕсли;
		Если Выборка.Месяц = 9 Тогда
			НСтр[0].Сентябрь1	= Выборка.ОбъемКолОборот1;
			НСтр[0].Сентябрь2	= Выборка.ОбъемКолОборот2;
			НСтр[0].Сентябрь3	= Выборка.ОбъемКолОборот3;
			НСтр[0].Сентябрь4	= Выборка.ОбъемКолОборот4;
		КонецЕсли;
		Если Выборка.Месяц = 10 Тогда
			НСтр[0].Октябрь1	= Выборка.ОбъемКолОборот1;
			НСтр[0].Октябрь2	= Выборка.ОбъемКолОборот2;
			НСтр[0].Октябрь3	= Выборка.ОбъемКолОборот3;
			НСтр[0].Октябрь4	= Выборка.ОбъемКолОборот4;
		КонецЕсли;
		Если Выборка.Месяц = 11 Тогда
			НСтр[0].Ноябрь1		= Выборка.ОбъемКолОборот1;
			НСтр[0].Ноябрь2		= Выборка.ОбъемКолОборот2;
			НСтр[0].Ноябрь3		= Выборка.ОбъемКолОборот3;
			НСтр[0].Ноябрь4		= Выборка.ОбъемКолОборот4;
		КонецЕсли;
		Если Выборка.Месяц = 12 Тогда
			НСтр[0].Декабрь1	= Выборка.ОбъемКолОборот1;
			НСтр[0].Декабрь2	= Выборка.ОбъемКолОборот2;
			НСтр[0].Декабрь3	= Выборка.ОбъемКолОборот3;
			НСтр[0].Декабрь4	= Выборка.ОбъемКолОборот4;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервереПоПятиТочкам()
	
	Для Каждого Стр из Объект.ДанныеПродаж Цикл
		
		Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
			Если НЕ Стр.Номенклатура = Объект.Номенклатура Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		НСтр = Объект.ПоПятиТочкам.Добавить();
		НСтр.Номенклатура = Стр.Номенклатура;
		НСтр.Стр1 = (Стр.Январь1	+ Стр.Февраль1	+ Стр.Март1		+ Стр.Апрель1	+ Стр.Май1)			/ 5;
		НСтр.Стр2 = (Стр.Февраль1	+ Стр.Март1		+ Стр.Апрель1	+ Стр.Май1		+ Стр.Июнь1)		/ 5;
		НСтр.Стр3 = (Стр.Март1		+ Стр.Апрель1	+ Стр.Май1		+ Стр.Июнь1		+ Стр.Июль1)		/ 5;
		НСтр.Стр4 = (Стр.Апрель1	+ Стр.Май1		+ Стр.Июнь1		+ Стр.Июль1		+ Стр.Август1)		/ 5;
		НСтр.Стр5 = (Стр.Май1		+ Стр.Июнь1		+ Стр.Июль1		+ Стр.Август1	+ Стр.Сентябрь1)	/ 5;
		НСтр.Стр6 = (Стр.Июнь1		+ Стр.Июль1		+ Стр.Август1	+ Стр.Сентябрь1	+ Стр.Октябрь1)		/ 5;
		НСтр.Стр7 = (Стр.Июль1		+ Стр.Август1	+ Стр.Сентябрь1	+ Стр.Октябрь1	+ Стр.Ноябрь1)		/ 5;
		НСтр.Стр8 = (Стр.Август1	+ Стр.Сентябрь1	+ Стр.Октябрь1	+ Стр.Ноябрь1	+ Стр.Декабрь1)		/ 5;
		НСтр.Стр9 = (Стр.Сентябрь1	+ Стр.Октябрь1	+ Стр.Ноябрь1	+ Стр.Декабрь1	+ Стр.Январь2)		/ 5;
		НСтр.Стр10 = (Стр.Октябрь1	+ Стр.Ноябрь1	+ Стр.Декабрь1	+ Стр.Январь2	+ Стр.Февраль2)		/ 5;
		НСтр.Стр11 = (Стр.Ноябрь1	+ Стр.Декабрь1	+ Стр.Январь2	+ Стр.Февраль2	+ Стр.Март2)		/ 5;
		НСтр.Стр12 = (Стр.Декабрь1	+ Стр.Январь2	+ Стр.Февраль2	+ Стр.Март2		+ Стр.Апрель2)		/ 5;
		НСтр.Стр13 = (Стр.Январь2	+ Стр.Февраль2	+ Стр.Март2		+ Стр.Апрель2	+ Стр.Май2)			/ 5;
		НСтр.Стр14 = (Стр.Февраль2 	+ Стр.Март2		+ Стр.Апрель2	+ Стр.Май2		+ Стр.Июнь2)		/ 5;
		НСтр.Стр15 = (Стр.Март2		+ Стр.Апрель2	+ Стр.Май2		+ Стр.Июнь2		+ Стр.Июль2)		/ 5;
		НСтр.Стр16 = (Стр.Апрель2	+ Стр.Май2		+ Стр.Июнь2		+ Стр.Июль2		+ Стр.Август2)		/ 5;
		НСтр.Стр17 = (Стр.Май2		+ Стр.Июнь2		+ Стр.Июль2		+ Стр.Август2	+ Стр.Сентябрь2)	/ 5;
		НСтр.Стр18 = (Стр.Июнь2		+ Стр.Июль2		+ Стр.Август2	+ Стр.Сентябрь2	+ Стр.Октябрь2)		/ 5;
		НСтр.Стр19 = (Стр.Июль2		+ Стр.Август2	+ Стр.Сентябрь2	+ Стр.Октябрь2	+ Стр.Ноябрь2)		/ 5;
		НСтр.Стр20 = (Стр.Август2	+ Стр.Сентябрь2	+ Стр.Октябрь2	+ Стр.Ноябрь2	+ Стр.Декабрь2)		/ 5;
		НСтр.Стр21 = (Стр.Сентябрь2	+ Стр.Октябрь2	+ Стр.Ноябрь2	+ Стр.Декабрь2	+ Стр.Январь3)		/ 5;
		НСтр.Стр22 = (Стр.Октябрь2	+ Стр.Ноябрь2	+ Стр.Декабрь2	+ Стр.Январь3	+ Стр.Февраль3)		/ 5;
		НСтр.Стр23 = (Стр.Ноябрь2	+ Стр.Декабрь2	+ Стр.Январь3	+ Стр.Февраль3	+ Стр.Март3)		/ 5;
		НСтр.Стр24 = (Стр.Декабрь2 	+ Стр.Январь3	+ Стр.Февраль3	+ Стр.Март3		+ Стр.Апрель3)		/ 5;
		НСтр.Стр25 = (Стр.Январь3	+ Стр.Февраль3	+ Стр.Март3		+ Стр.Апрель3	+ Стр.Май3)			/ 5;
		НСтр.Стр26 = (Стр.Февраль3 	+ Стр.Март3		+ Стр.Апрель3	+ Стр.Май3		+ Стр.Июнь3)		/ 5;
		НСтр.Стр27 = (Стр.Март3		+ Стр.Апрель3	+ Стр.Май3		+ Стр.Июнь3		+ Стр.Июль3)		/ 5;
		НСтр.Стр28 = (Стр.Апрель3	+ Стр.Май3		+ Стр.Июнь3		+ Стр.Июль3		+ Стр.Август3)		/ 5;
		НСтр.Стр29 = (Стр.Май3		+ Стр.Июнь3		+ Стр.Июль3		+ Стр.Август3	+ Стр.Сентябрь3)	/ 5;
		НСтр.Стр30 = (Стр.Июнь3		+ Стр.Июль3		+ Стр.Август3	+ Стр.Сентябрь3	+ Стр.Октябрь3)		/ 5;
		НСтр.Стр31 = (Стр.Июль3		+ Стр.Август3	+ Стр.Сентябрь3	+ Стр.Октябрь3	+ Стр.Ноябрь3)		/ 5;
		НСтр.Стр32 = (Стр.Август3	+ Стр.Сентябрь3	+ Стр.Октябрь3	+ Стр.Ноябрь3	+ Стр.Декабрь3)		/ 5;
		НСтр.Стр33 = (Стр.Январь4	+ Стр.Февраль4	+ Стр.Март4		+ Стр.Апрель4	+ Стр.Май4)			/ 5;
		НСтр.Стр34 = (Стр.Февраль4 	+ Стр.Март4		+ Стр.Апрель4	+ Стр.Май4		+ Стр.Июнь4)		/ 5;
		НСтр.Стр35 = (Стр.Март4		+ Стр.Апрель4	+ Стр.Май4		+ Стр.Июнь4		+ Стр.Июль4)		/ 5;
		НСтр.Стр36 = (Стр.Апрель4	+ Стр.Май4		+ Стр.Июнь4		+ Стр.Июль4		+ Стр.Август4)		/ 5;
		НСтр.Стр37 = (Стр.Май4		+ Стр.Июнь4		+ Стр.Июль4		+ Стр.Август4	+ Стр.Сентябрь4)	/ 5;
		НСтр.Стр38 = (Стр.Июнь4		+ Стр.Июль4		+ Стр.Август4	+ Стр.Сентябрь4	+ Стр.Октябрь4)		/ 5;
		НСтр.Стр39 = (Стр.Июль4		+ Стр.Август4	+ Стр.Сентябрь4	+ Стр.Октябрь4	+ Стр.Ноябрь4)		/ 5;
		НСтр.Стр40 = (Стр.Август4	+ Стр.Сентябрь4	+ Стр.Октябрь4	+ Стр.Ноябрь4	+ Стр.Декабрь4)		/ 5;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервереПодвенадцатиТочкам()
	
	Для Каждого Стр из Объект.ДанныеПродаж Цикл
		
		Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
			Если НЕ Стр.Номенклатура = Объект.Номенклатура Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		НСтр = Объект.ПоДвенадцатиТочкам.Добавить();
		НСтр.Номенклатура = Стр.Номенклатура;
		НСтр.Стр1 = (Стр.Январь1	+ Стр.Февраль1	+ Стр.Март1		+ Стр.Апрель1	+ Стр.Май1		+ Стр.Июнь1		+ Стр.Июль1		+ Стр.Август1	+ Стр.Сентябрь1	+ Стр.Октябрь1	+ Стр.Ноябрь1	+ Стр.Декабрь1)	/ 12;
		НСтр.Стр2 = (Стр.Февраль1	+ Стр.Март1		+ Стр.Апрель1	+ Стр.Май1		+ Стр.Июнь1		+ Стр.Июль1		+ Стр.Август1	+ Стр.Сентябрь1	+ Стр.Октябрь1	+ Стр.Ноябрь1	+ Стр.Декабрь1	+ Стр.Январь2)	/ 12;
		НСтр.Стр3 = (Стр.Март1		+ Стр.Апрель1	+ Стр.Май1		+ Стр.Июнь1		+ Стр.Июль1		+ Стр.Август1	+ Стр.Сентябрь1	+ Стр.Октябрь1	+ Стр.Ноябрь1	+ Стр.Декабрь1	+ Стр.Январь2	+ Стр.Февраль2)	/ 12;
		НСтр.Стр4 = (Стр.Апрель1	+ Стр.Май1		+ Стр.Июнь1		+ Стр.Июль1		+ Стр.Август1	+ Стр.Сентябрь1	+ Стр.Октябрь1	+ Стр.Ноябрь1	+ Стр.Декабрь1	+ Стр.Январь2	+ Стр.Февраль2	+ Стр.Март2)	/ 12;
		НСтр.Стр5 = (Стр.Май1		+ Стр.Июнь1		+ Стр.Июль1		+ Стр.Август1	+ Стр.Сентябрь1	+ Стр.Октябрь1	+ Стр.Ноябрь1	+ Стр.Декабрь1	+ Стр.Январь2	+ Стр.Февраль2	+ Стр.Март2		+ Стр.Апрель2)	/ 12;
		НСтр.Стр6 = (Стр.Июнь1		+ Стр.Июль1		+ Стр.Август1	+ Стр.Сентябрь1	+ Стр.Октябрь1	+ Стр.Ноябрь1	+ Стр.Декабрь1	+ Стр.Январь2	+ Стр.Февраль2	+ Стр.Март2		+ Стр.Апрель2	+ Стр.Май2)		/ 12;
		НСтр.Стр7 = (Стр.Июль1		+ Стр.Август1	+ Стр.Сентябрь1	+ Стр.Октябрь1	+ Стр.Ноябрь1	+ Стр.Декабрь1	+ Стр.Январь2	+ Стр.Февраль2	+ Стр.Март2		+ Стр.Апрель2	+ Стр.Май2		+ Стр.Июнь2)	/ 12;
		НСтр.Стр8 = (Стр.Август1	+ Стр.Сентябрь1	+ Стр.Октябрь1	+ Стр.Ноябрь1	+ Стр.Декабрь1	+ Стр.Январь2	+ Стр.Февраль2	+ Стр.Март2		+ Стр.Апрель2	+ Стр.Май2		+ Стр.Июнь2		+ Стр.Июль2)	/ 12;
		НСтр.Стр9 = (Стр.Сентябрь1	+ Стр.Октябрь1	+ Стр.Ноябрь1	+ Стр.Декабрь1	+ Стр.Январь2	+ Стр.Февраль2 	+ Стр.Март2		+ Стр.Апрель2	+ Стр.Май2		+ Стр.Июнь2		+ Стр.Июль2		+ Стр.Август2)	/ 12;
		НСтр.Стр10 = (Стр.Октябрь1	+ Стр.Ноябрь1	+ Стр.Декабрь1	+ Стр.Январь2	+ Стр.Февраль2	+ Стр.Март2		+ Стр.Апрель2	+ Стр.Май2		+ Стр.Июнь2		+ Стр.Июль2		+ Стр.Август2	+ Стр.Сентябрь2)	/ 12;
		НСтр.Стр11 = (Стр.Ноябрь1	+ Стр.Декабрь1	+ Стр.Январь2	+ Стр.Февраль2	+ Стр.Март2		+ Стр.Апрель2	+ Стр.Май2		+ Стр.Июнь2		+ Стр.Июль2		+ Стр.Август2	+ Стр.Сентябрь2	+ Стр.Октябрь2)	/ 12;
		НСтр.Стр12 = (Стр.Декабрь1	+ Стр.Январь2	+ Стр.Февраль2	+ Стр.Март2		+ Стр.Апрель2	+ Стр.Май2		+ Стр.Июнь2		+ Стр.Июль2		+ Стр.Август2	+ Стр.Сентябрь2	+ Стр.Октябрь2	+ Стр.Ноябрь2)	/ 12;
		НСтр.Стр13 = (Стр.Январь2	+ Стр.Февраль2	+ Стр.Март2		+ Стр.Апрель2	+ Стр.Май2		+ Стр.Июнь2		+ Стр.Июль2		+ Стр.Август2	+ Стр.Сентябрь2	+ Стр.Октябрь2	+ Стр.Ноябрь2	+ Стр.Декабрь2)	/ 12;
		НСтр.Стр14 = (Стр.Февраль2 	+ Стр.Март2		+ Стр.Апрель2	+ Стр.Май2		+ Стр.Июнь2		+ Стр.Июль2		+ Стр.Август2	+ Стр.Сентябрь2	+ Стр.Октябрь2	+ Стр.Ноябрь2	+ Стр.Декабрь2	+ Стр.Январь3)	/ 12;
		НСтр.Стр15 = (Стр.Март2		+ Стр.Апрель2	+ Стр.Май2		+ Стр.Июнь2		+ Стр.Июль2		+ Стр.Август2	+ Стр.Сентябрь2	+ Стр.Октябрь2	+ Стр.Ноябрь2	+ Стр.Декабрь2	+ Стр.Январь3	+ Стр.Февраль3)	/ 12;
		НСтр.Стр16 = (Стр.Апрель2	+ Стр.Май2		+ Стр.Июнь2		+ Стр.Июль2		+ Стр.Август2	+ Стр.Сентябрь2	+ Стр.Октябрь2	+ Стр.Ноябрь2	+ Стр.Декабрь2	+ Стр.Январь3	+ Стр.Февраль3	+ Стр.Март3)	/ 12;
		НСтр.Стр17 = (Стр.Май2		+ Стр.Июнь2		+ Стр.Июль2		+ Стр.Август2	+ Стр.Сентябрь2	+ Стр.Октябрь2	+ Стр.Ноябрь2	+ Стр.Декабрь2	+ Стр.Январь3	+ Стр.Февраль3	+ Стр.Март3		+ Стр.Апрель3)	/ 12;
		НСтр.Стр18 = (Стр.Июнь2		+ Стр.Июль2		+ Стр.Август2	+ Стр.Сентябрь2	+ Стр.Октябрь2	+ Стр.Ноябрь2	+ Стр.Декабрь2	+ Стр.Январь3	+ Стр.Февраль3	+ Стр.Март3		+ Стр.Апрель3	+ Стр.Май3)		/ 12;
		НСтр.Стр19 = (Стр.Июль2		+ Стр.Август2	+ Стр.Сентябрь2	+ Стр.Октябрь2	+ Стр.Ноябрь2	+ Стр.Декабрь2 	+ Стр.Январь3	+ Стр.Февраль3	+ Стр.Март3		+ Стр.Апрель3	+ Стр.Май3		+ Стр.Июнь3)	/ 12;
		НСтр.Стр20 = (Стр.Август2	+ Стр.Сентябрь2	+ Стр.Октябрь2	+ Стр.Ноябрь2	+ Стр.Декабрь2	+ Стр.Январь3	+ Стр.Февраль3	+ Стр.Март3		+ Стр.Апрель3	+ Стр.Май3		+ Стр.Июнь3		+ Стр.Июль3)	/ 12;
		НСтр.Стр21 = (Стр.Сентябрь2	+ Стр.Октябрь2	+ Стр.Ноябрь2	+ Стр.Декабрь2	+ Стр.Январь3	+ Стр.Февраль3 	+ Стр.Март3		+ Стр.Апрель3	+ Стр.Май3		+ Стр.Июнь3		+ Стр.Июль3		+ Стр.Август3)	/ 12;
		НСтр.Стр22 = (Стр.Октябрь2	+ Стр.Ноябрь2	+ Стр.Декабрь2	+ Стр.Январь3	+ Стр.Февраль3	+ Стр.Март3		+ Стр.Апрель3	+ Стр.Май3		+ Стр.Июнь3		+ Стр.Июль3		+ Стр.Август3	+ Стр.Сентябрь3)	/ 12;
		НСтр.Стр23 = (Стр.Ноябрь2	+ Стр.Декабрь2	+ Стр.Январь3	+ Стр.Февраль3	+ Стр.Март3		+ Стр.Апрель3	+ Стр.Май3		+ Стр.Июнь3		+ Стр.Июль3		+ Стр.Август3	+ Стр.Сентябрь3	+ Стр.Октябрь3)	/ 12;
		НСтр.Стр24 = (Стр.Декабрь2 	+ Стр.Январь3	+ Стр.Февраль3	+ Стр.Март3		+ Стр.Апрель3	+ Стр.Май3		+ Стр.Июнь3		+ Стр.Июль3		+ Стр.Август3	+ Стр.Сентябрь3	+ Стр.Октябрь3	+ Стр.Ноябрь3)	/ 12;
		НСтр.Стр25 = (Стр.Январь3	+ Стр.Февраль3	+ Стр.Март3		+ Стр.Апрель3	+ Стр.Май3		+ Стр.Июнь3		+ Стр.Июль3		+ Стр.Август3	+ Стр.Сентябрь3	+ Стр.Октябрь3	+ Стр.Ноябрь3	+ Стр.Декабрь3)	/ 12;
		НСтр.Стр26 = (Стр.Февраль3 	+ Стр.Март3		+ Стр.Апрель3	+ Стр.Май3		+ Стр.Июнь3		+ Стр.Июль3		+ Стр.Август3	+ Стр.Сентябрь3	+ Стр.Октябрь3	+ Стр.Ноябрь3	+ Стр.Декабрь3	+ Стр.Январь4)	/ 12;
		НСтр.Стр27 = (Стр.Март3		+ Стр.Апрель3	+ Стр.Май3		+ Стр.Июнь3		+ Стр.Июль3		+ Стр.Август3	+ Стр.Сентябрь3	+ Стр.Октябрь3	+ Стр.Ноябрь3	+ Стр.Декабрь3	+ Стр.Январь4	+ Стр.Февраль4)	/ 12;
		НСтр.Стр28 = (Стр.Апрель3	+ Стр.Май3		+ Стр.Июнь3		+ Стр.Июль3		+ Стр.Август3	+ Стр.Сентябрь3	+ Стр.Октябрь3	+ Стр.Ноябрь3	+ Стр.Декабрь3	+ Стр.Январь4	+ Стр.Февраль4	+ Стр.Март4)	/ 12;
		НСтр.Стр29 = (Стр.Май3		+ Стр.Июнь3		+ Стр.Июль3		+ Стр.Август3	+ Стр.Сентябрь3	+ Стр.Октябрь3	+ Стр.Ноябрь3	+ Стр.Декабрь3	+ Стр.Январь4	+ Стр.Февраль4	+ Стр.Март4		+ Стр.Апрель4)	/ 12;
		НСтр.Стр30 = (Стр.Июнь3		+ Стр.Июль3		+ Стр.Август3	+ Стр.Сентябрь3	+ Стр.Октябрь3	+ Стр.Ноябрь3	+ Стр.Декабрь3	+ Стр.Январь4	+ Стр.Февраль4	+ Стр.Март4		+ Стр.Апрель4	+ Стр.Май4)		/ 12;
		НСтр.Стр31 = (Стр.Июль3		+ Стр.Август3	+ Стр.Сентябрь3	+ Стр.Октябрь3	+ Стр.Ноябрь3	+ Стр.Декабрь3 	+ Стр.Январь4	+ Стр.Февраль4	+ Стр.Март4		+ Стр.Апрель4	+ Стр.Май4		+ Стр.Июнь4)	/ 12;
		НСтр.Стр32 = (Стр.Август3	+ Стр.Сентябрь3	+ Стр.Октябрь3	+ Стр.Ноябрь3	+ Стр.Декабрь3	+ Стр.Январь4	+ Стр.Февраль4	+ Стр.Март4		+ Стр.Апрель4	+ Стр.Май4		+ Стр.Июнь4		+ Стр.Июль4)	/ 12;
		НСтр.Стр33 = (Стр.Сентябрь3	+ Стр.Октябрь3	+ Стр.Ноябрь3	+ Стр.Декабрь3	+ Стр.Январь4	+ Стр.Февраль4 	+ Стр.Март4		+ Стр.Апрель4	+ Стр.Май4		+ Стр.Июнь4		+ Стр.Июль4		+ Стр.Август4)	/ 12;
		НСтр.Стр34 = (Стр.Октябрь3	+ Стр.Ноябрь3	+ Стр.Декабрь3	+ Стр.Январь4	+ Стр.Февраль4	+ Стр.Март4		+ Стр.Апрель4	+ Стр.Май4		+ Стр.Июнь4		+ Стр.Июль4		+ Стр.Август4	+ Стр.Сентябрь4)	/ 12;
		НСтр.Стр35 = (Стр.Ноябрь3	+ Стр.Декабрь3	+ Стр.Январь4	+ Стр.Февраль4	+ Стр.Март4		+ Стр.Апрель4	+ Стр.Май4		+ Стр.Июнь4		+ Стр.Июль4		+ Стр.Август4	+ Стр.Сентябрь4	+ Стр.Октябрь4)	/ 12;
		НСтр.Стр36 = (Стр.Декабрь3 	+ Стр.Январь4	+ Стр.Февраль4	+ Стр.Март4		+ Стр.Апрель4	+ Стр.Май4		+ Стр.Июнь4		+ Стр.Июль4		+ Стр.Август4	+ Стр.Сентябрь4	+ Стр.Октябрь4	+ Стр.Ноябрь4)	/ 12;
		НСтр.Стр37 = (Стр.Январь4	+ Стр.Февраль4	+ Стр.Март4		+ Стр.Апрель4	+ Стр.Май4		+ Стр.Июнь4		+ Стр.Июль4		+ Стр.Август4	+ Стр.Сентябрь4	+ Стр.Октябрь4	+ Стр.Ноябрь4	+ Стр.Декабрь4)	/ 12;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервереМеждуДвумяКрайнимиТочками()
	
	Для Каждого Стр из Объект.ПоДвенадцатиТочкам Цикл
		
		Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
			Если НЕ Стр.Номенклатура = Объект.Номенклатура Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		НСтр = Объект.МеждуДвумяКрайнимиТочками.Добавить();
		НСтр.Номенклатура = Стр.Номенклатура;
		НСтр.Стр1 = (Стр.Стр1 + Стр.Стр2) / 2;
		НСтр.Стр2 = (Стр.Стр2 + Стр.Стр3) / 2;
		НСтр.Стр3 = (Стр.Стр3 + Стр.Стр4) / 2;
		НСтр.Стр4 = (Стр.Стр4 + Стр.Стр5) / 2;
		НСтр.Стр5 = (Стр.Стр5 + Стр.Стр6) / 2;
		НСтр.Стр6 = (Стр.Стр6 + Стр.Стр7) / 2;
		НСтр.Стр7 = (Стр.Стр7 + Стр.Стр8) / 2;
		НСтр.Стр8 = (Стр.Стр8 + Стр.Стр9) / 2;
		НСтр.Стр9 = (Стр.Стр9 + Стр.Стр10) / 2;
		НСтр.Стр10 = (Стр.Стр10 + Стр.Стр11) / 2;
		НСтр.Стр11 = (Стр.Стр11 + Стр.Стр12) / 2;
		НСтр.Стр12 = (Стр.Стр12 + Стр.Стр13) / 2;
		НСтр.Стр13 = (Стр.Стр13 + Стр.Стр14) / 2;
		НСтр.Стр14 = (Стр.Стр14 + Стр.Стр15) / 2;
		НСтр.Стр15 = (Стр.Стр15 + Стр.Стр16) / 2;
		НСтр.Стр16 = (Стр.Стр16 + Стр.Стр17) / 2;
		НСтр.Стр17 = (Стр.Стр17 + Стр.Стр18) / 2;
		НСтр.Стр18 = (Стр.Стр18 + Стр.Стр19) / 2;
		НСтр.Стр19 = (Стр.Стр19 + Стр.Стр20) / 2;
		НСтр.Стр20 = (Стр.Стр20 + Стр.Стр21) / 2;
		НСтр.Стр21 = (Стр.Стр21 + Стр.Стр22) / 2;
		НСтр.Стр22 = (Стр.Стр22 + Стр.Стр23) / 2;
		НСтр.Стр23 = (Стр.Стр23 + Стр.Стр24) / 2;
		НСтр.Стр24 = (Стр.Стр24 + Стр.Стр25) / 2;
		НСтр.Стр25 = (Стр.Стр25 + Стр.Стр26) / 2;
		НСтр.Стр26 = (Стр.Стр26 + Стр.Стр27) / 2;
		НСтр.Стр27 = (Стр.Стр27 + Стр.Стр28) / 2;
		НСтр.Стр28 = (Стр.Стр28 + Стр.Стр29) / 2;
		НСтр.Стр29 = (Стр.Стр29 + Стр.Стр30) / 2;
		НСтр.Стр30 = (Стр.Стр30 + Стр.Стр31) / 2;
		НСтр.Стр31 = (Стр.Стр31 + Стр.Стр32) / 2;
		НСтр.Стр32 = (Стр.Стр32 + Стр.Стр33) / 2;
		НСтр.Стр33 = (Стр.Стр33 + Стр.Стр34) / 2;
		НСтр.Стр34 = (Стр.Стр34 + Стр.Стр35) / 2;
		НСтр.Стр35 = (Стр.Стр35 + Стр.Стр36) / 2;
		НСтр.Стр36 = (Стр.Стр36 + Стр.Стр37) / 2;

	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервереСезонность()
	
	Для Каждого Стр из Объект.МеждуДвумяКрайнимиТочками Цикл
		
		Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
			Если НЕ Стр.Номенклатура = Объект.Номенклатура Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		НСтр = Объект.Сезонность.Добавить();
		НСтр.Номенклатура = Стр.Номенклатура;
		
		НайденнаяСтрока = Объект.ДанныеПродаж.НайтиСтроки(Новый Структура("Номенклатура", Стр.Номенклатура));
		
		НСтр.Стр1 = ?(Стр.Стр1 = 0, 0, НайденнаяСтрока[0].Июль1			/ Стр.Стр1);
		НСтр.Стр2 = ?(Стр.Стр2 = 0, 0, НайденнаяСтрока[0].Август1		/ Стр.Стр2);
		НСтр.Стр3 = ?(Стр.Стр3 = 0, 0, НайденнаяСтрока[0].Сентябрь1		/ Стр.Стр3);
		НСтр.Стр4 = ?(Стр.Стр4 = 0, 0, НайденнаяСтрока[0].Октябрь1		/ Стр.Стр4);
		НСтр.Стр5 = ?(Стр.Стр5 = 0, 0, НайденнаяСтрока[0].Ноябрь1		/ Стр.Стр5);
		НСтр.Стр6 = ?(Стр.Стр6 = 0, 0, НайденнаяСтрока[0].Декабрь1		/ Стр.Стр6);
		НСтр.Стр7 = ?(Стр.Стр7 = 0, 0, НайденнаяСтрока[0].Январь2		/ Стр.Стр7);
		НСтр.Стр8 = ?(Стр.Стр8 = 0, 0, НайденнаяСтрока[0].Февраль2		/ Стр.Стр8);
		НСтр.Стр9 = ?(Стр.Стр9 = 0, 0, НайденнаяСтрока[0].Март2			/ Стр.Стр9);
		НСтр.Стр10 = ?(Стр.Стр10 = 0, 0, НайденнаяСтрока[0].Апрель2		/ Стр.Стр10);
		НСтр.Стр11 = ?(Стр.Стр11 = 0, 0, НайденнаяСтрока[0].Май2		/ Стр.Стр11);
		НСтр.Стр12 = ?(Стр.Стр12 = 0, 0, НайденнаяСтрока[0].Июнь2		/ Стр.Стр12);
		НСтр.Стр13 = ?(Стр.Стр13 = 0, 0, НайденнаяСтрока[0].Июль2		/ Стр.Стр13);
		НСтр.Стр14 = ?(Стр.Стр14 = 0, 0, НайденнаяСтрока[0].Август2		/ Стр.Стр14);
		НСтр.Стр15 = ?(Стр.Стр15 = 0, 0, НайденнаяСтрока[0].Сентябрь2	/ Стр.Стр15);
		НСтр.Стр16 = ?(Стр.Стр16 = 0, 0, НайденнаяСтрока[0].Октябрь2	/ Стр.Стр16);
		НСтр.Стр17 = ?(Стр.Стр17 = 0, 0, НайденнаяСтрока[0].Ноябрь2		/ Стр.Стр17);
		НСтр.Стр18 = ?(Стр.Стр18 = 0, 0, НайденнаяСтрока[0].Декабрь2	/ Стр.Стр18);
		НСтр.Стр19 = ?(Стр.Стр19 = 0, 0, НайденнаяСтрока[0].Январь3		/ Стр.Стр19);
		НСтр.Стр20 = ?(Стр.Стр20 = 0, 0, НайденнаяСтрока[0].Февраль3	/ Стр.Стр20);
		НСтр.Стр21 = ?(Стр.Стр21 = 0, 0, НайденнаяСтрока[0].Март3		/ Стр.Стр21);
		НСтр.Стр22 = ?(Стр.Стр22 = 0, 0, НайденнаяСтрока[0].Апрель3		/ Стр.Стр22);
		НСтр.Стр23 = ?(Стр.Стр23 = 0, 0, НайденнаяСтрока[0].Май3		/ Стр.Стр23);
		НСтр.Стр24 = ?(Стр.Стр24 = 0, 0, НайденнаяСтрока[0].Июнь3		/ Стр.Стр24);
		НСтр.Стр25 = ?(Стр.Стр25 = 0, 0, НайденнаяСтрока[0].Июль3		/ Стр.Стр25);
		НСтр.Стр26 = ?(Стр.Стр26 = 0, 0, НайденнаяСтрока[0].Август3		/ Стр.Стр26);
		НСтр.Стр27 = ?(Стр.Стр27 = 0, 0, НайденнаяСтрока[0].Сентябрь3	/ Стр.Стр27);
		НСтр.Стр28 = ?(Стр.Стр28 = 0, 0, НайденнаяСтрока[0].Октябрь3	/ Стр.Стр28);
		НСтр.Стр29 = ?(Стр.Стр29 = 0, 0, НайденнаяСтрока[0].Ноябрь3		/ Стр.Стр29);
		НСтр.Стр30 = ?(Стр.Стр30 = 0, 0, НайденнаяСтрока[0].Декабрь3	/ Стр.Стр30);
		НСтр.Стр31 = ?(Стр.Стр31 = 0, 0, НайденнаяСтрока[0].Январь4		/ Стр.Стр31);
		НСтр.Стр32 = ?(Стр.Стр32 = 0, 0, НайденнаяСтрока[0].Февраль4	/ Стр.Стр32);
		НСтр.Стр33 = ?(Стр.Стр33 = 0, 0, НайденнаяСтрока[0].Март4		/ Стр.Стр33);
		НСтр.Стр34 = ?(Стр.Стр34 = 0, 0, НайденнаяСтрока[0].Апрель4		/ Стр.Стр34);
		НСтр.Стр35 = ?(Стр.Стр35 = 0, 0, НайденнаяСтрока[0].Май4		/ Стр.Стр35);
		НСтр.Стр36 = ?(Стр.Стр36 = 0, 0, НайденнаяСтрока[0].Июнь4		/ Стр.Стр36);

	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервереСезонностьУсредненная()
	
	Для Каждого Стр из Объект.Сезонность Цикл
		
		Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
			Если НЕ Стр.Номенклатура = Объект.Номенклатура Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		НСтр = Объект.СезонностьУсредненная.Добавить();
		НСтр.Номенклатура = Стр.Номенклатура;
		НСтр.Стр1 = (Стр.Стр1 + Стр.Стр13 + Стр.Стр25) / 2;
		НСтр.Стр2 = (Стр.Стр2 + Стр.Стр14 + Стр.Стр26) / 2;
		НСтр.Стр3 = (Стр.Стр3 + Стр.Стр15 + Стр.Стр27) / 2;
		НСтр.Стр4 = (Стр.Стр4 + Стр.Стр16 + Стр.Стр28) / 2;
		НСтр.Стр5 = (Стр.Стр5 + Стр.Стр17 + Стр.Стр29) / 2;
		НСтр.Стр6 = (Стр.Стр6 + Стр.Стр18 + Стр.Стр30) / 2;
		НСтр.Стр7 = (Стр.Стр7 + Стр.Стр19 + Стр.Стр31) / 2;
		НСтр.Стр8 = (Стр.Стр8 + Стр.Стр20 + Стр.Стр32) / 2;
		НСтр.Стр9 = (Стр.Стр9 + Стр.Стр21 + Стр.Стр33) / 2;
		НСтр.Стр10 = (Стр.Стр10 + Стр.Стр22 + Стр.Стр34) / 2;
		НСтр.Стр11 = (Стр.Стр11 + Стр.Стр23 + Стр.Стр35) / 2;
		НСтр.Стр12 = (Стр.Стр12 + Стр.Стр24 + Стр.Стр36) / 2;

	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервереСезонностьУсредненнаяСНормировкой()
	
	Для Каждого Стр из Объект.СезонностьУсредненная Цикл
		
		Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
			Если НЕ Стр.Номенклатура = Объект.Номенклатура Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		НСтр = Объект.СезонностьУсредненнаяСНормировкой.Добавить();
		НСтр.Номенклатура = Стр.Номенклатура;
		
		СуммаКолонок = Стр.Стр1 + Стр.Стр2 + Стр.Стр3 + Стр.Стр4 + Стр.Стр5 + Стр.Стр6 + Стр.Стр7 + Стр.Стр8 + Стр.Стр9 + Стр.Стр10 + Стр.Стр11 + Стр.Стр12;
		
		НСтр.Стр1 = ?(СуммаКолонок = 0, 0, Стр.Стр1 / СуммаКолонок * 12);
		НСтр.Стр2 = ?(СуммаКолонок = 0, 0, Стр.Стр2 / СуммаКолонок * 12);
		НСтр.Стр3 = ?(СуммаКолонок = 0, 0, Стр.Стр3 / СуммаКолонок * 12);
		НСтр.Стр4 = ?(СуммаКолонок = 0, 0, Стр.Стр4 / СуммаКолонок * 12);
		НСтр.Стр5 = ?(СуммаКолонок = 0, 0, Стр.Стр5 / СуммаКолонок * 12);
		НСтр.Стр6 = ?(СуммаКолонок = 0, 0, Стр.Стр6 / СуммаКолонок * 12);
		НСтр.Стр7 = ?(СуммаКолонок = 0, 0, Стр.Стр7 / СуммаКолонок * 12);
		НСтр.Стр8 = ?(СуммаКолонок = 0, 0, Стр.Стр8 / СуммаКолонок * 12);
		НСтр.Стр9 = ?(СуммаКолонок = 0, 0, Стр.Стр9 / СуммаКолонок * 12);
		НСтр.Стр10 = ?(СуммаКолонок = 0, 0, Стр.Стр10 / СуммаКолонок * 12);
		НСтр.Стр11 = ?(СуммаКолонок = 0, 0, Стр.Стр11 / СуммаКолонок * 12);
		НСтр.Стр12 = ?(СуммаКолонок = 0, 0, Стр.Стр12 / СуммаКолонок * 12);

	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервереДанныеПродажБезСезонности()
	
	Для Каждого Стр из Объект.ДанныеПродаж Цикл
		
		Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
			Если НЕ Стр.Номенклатура = Объект.Номенклатура Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		НСтр = Объект.ДанныеПродажБезСезонности.Добавить();
		НСтр.Номенклатура = Стр.Номенклатура;
		
		НайденнаяСтрока = Объект.СезонностьУсредненнаяСНормировкой.НайтиСтроки(Новый Структура("Номенклатура", Стр.Номенклатура));
		
		НСтр.Январь1	= ?(НайденнаяСтрока[0].Стр1 = 0, 0, Стр.Январь1		/ НайденнаяСтрока[0].Стр1);
		НСтр.Февраль1	= ?(НайденнаяСтрока[0].Стр2 = 0, 0, Стр.Февраль1	/ НайденнаяСтрока[0].Стр2);
		НСтр.Март1		= ?(НайденнаяСтрока[0].Стр3 = 0, 0, Стр.Март1		/ НайденнаяСтрока[0].Стр3);
		НСтр.Апрель1	= ?(НайденнаяСтрока[0].Стр4 = 0, 0, Стр.Апрель1		/ НайденнаяСтрока[0].Стр4);
		НСтр.Май1		= ?(НайденнаяСтрока[0].Стр5 = 0, 0, Стр.Май1		/ НайденнаяСтрока[0].Стр5);
		НСтр.Июнь1		= ?(НайденнаяСтрока[0].Стр6 = 0, 0, Стр.Июнь1		/ НайденнаяСтрока[0].Стр6);
		НСтр.Июль1		= ?(НайденнаяСтрока[0].Стр7 = 0, 0, Стр.Июль1		/ НайденнаяСтрока[0].Стр7);
		НСтр.Август1	= ?(НайденнаяСтрока[0].Стр8 = 0, 0, Стр.Август1		/ НайденнаяСтрока[0].Стр8);
		НСтр.Сентябрь1	= ?(НайденнаяСтрока[0].Стр9 = 0, 0, Стр.Сентябрь1	/ НайденнаяСтрока[0].Стр9);
		НСтр.Октябрь1	= ?(НайденнаяСтрока[0].Стр10 = 0, 0, Стр.Октябрь1	/ НайденнаяСтрока[0].Стр10);
		НСтр.Ноябрь1	= ?(НайденнаяСтрока[0].Стр11 = 0, 0, Стр.Ноябрь1	/ НайденнаяСтрока[0].Стр11);
		НСтр.Декабрь1	= ?(НайденнаяСтрока[0].Стр12 = 0, 0, Стр.Декабрь1	/ НайденнаяСтрока[0].Стр12);
		НСтр.Январь2	= ?(НайденнаяСтрока[0].Стр1 = 0, 0, Стр.Январь2		/ НайденнаяСтрока[0].Стр1);
		НСтр.Февраль2	= ?(НайденнаяСтрока[0].Стр2 = 0, 0, Стр.Февраль2	/ НайденнаяСтрока[0].Стр2);
		НСтр.Март2		= ?(НайденнаяСтрока[0].Стр3 = 0, 0, Стр.Март2		/ НайденнаяСтрока[0].Стр3);
		НСтр.Апрель2	= ?(НайденнаяСтрока[0].Стр4 = 0, 0, Стр.Апрель2		/ НайденнаяСтрока[0].Стр4);
		НСтр.Май2		= ?(НайденнаяСтрока[0].Стр5 = 0, 0, Стр.Май2		/ НайденнаяСтрока[0].Стр5);
		НСтр.Июнь2		= ?(НайденнаяСтрока[0].Стр6 = 0, 0, Стр.Июнь2		/ НайденнаяСтрока[0].Стр6);
		НСтр.Июль2		= ?(НайденнаяСтрока[0].Стр7 = 0, 0, Стр.Июль2		/ НайденнаяСтрока[0].Стр7);
		НСтр.Август2	= ?(НайденнаяСтрока[0].Стр8 = 0, 0, Стр.Август2		/ НайденнаяСтрока[0].Стр8);
		НСтр.Сентябрь2	= ?(НайденнаяСтрока[0].Стр9 = 0, 0, Стр.Сентябрь2	/ НайденнаяСтрока[0].Стр9);
		НСтр.Октябрь2	= ?(НайденнаяСтрока[0].Стр10 = 0, 0, Стр.Октябрь2	/ НайденнаяСтрока[0].Стр10);
		НСтр.Ноябрь2	= ?(НайденнаяСтрока[0].Стр11 = 0, 0, Стр.Ноябрь2	/ НайденнаяСтрока[0].Стр11);
		НСтр.Декабрь2	= ?(НайденнаяСтрока[0].Стр12 = 0, 0, Стр.Декабрь2	/ НайденнаяСтрока[0].Стр12);
		НСтр.Январь3	= ?(НайденнаяСтрока[0].Стр1 = 0, 0, Стр.Январь3		/ НайденнаяСтрока[0].Стр1);
		НСтр.Февраль3	= ?(НайденнаяСтрока[0].Стр2 = 0, 0, Стр.Февраль3	/ НайденнаяСтрока[0].Стр2);
		НСтр.Март3		= ?(НайденнаяСтрока[0].Стр3 = 0, 0, Стр.Март3		/ НайденнаяСтрока[0].Стр3);
		НСтр.Апрель3	= ?(НайденнаяСтрока[0].Стр4 = 0, 0, Стр.Апрель3		/ НайденнаяСтрока[0].Стр4);
		НСтр.Май3		= ?(НайденнаяСтрока[0].Стр5 = 0, 0, Стр.Май3		/ НайденнаяСтрока[0].Стр5);
		НСтр.Июнь3		= ?(НайденнаяСтрока[0].Стр6 = 0, 0, Стр.Июнь3		/ НайденнаяСтрока[0].Стр6);
		НСтр.Июль3		= ?(НайденнаяСтрока[0].Стр7 = 0, 0, Стр.Июль3		/ НайденнаяСтрока[0].Стр7);
		НСтр.Август3	= ?(НайденнаяСтрока[0].Стр8 = 0, 0, Стр.Август3		/ НайденнаяСтрока[0].Стр8);
		НСтр.Сентябрь3	= ?(НайденнаяСтрока[0].Стр9 = 0, 0, Стр.Сентябрь3	/ НайденнаяСтрока[0].Стр9);
		НСтр.Октябрь3	= ?(НайденнаяСтрока[0].Стр10 = 0, 0, Стр.Октябрь3	/ НайденнаяСтрока[0].Стр10);
		НСтр.Ноябрь3	= ?(НайденнаяСтрока[0].Стр11 = 0, 0, Стр.Ноябрь3	/ НайденнаяСтрока[0].Стр11);
		НСтр.Декабрь3	= ?(НайденнаяСтрока[0].Стр12 = 0, 0, Стр.Август3	/ НайденнаяСтрока[0].Стр12);
		НСтр.Январь4	= ?(НайденнаяСтрока[0].Стр1 = 0, 0, Стр.Январь4		/ НайденнаяСтрока[0].Стр1);
		НСтр.Февраль4	= ?(НайденнаяСтрока[0].Стр2 = 0, 0, Стр.Февраль4	/ НайденнаяСтрока[0].Стр2);
		НСтр.Март4		= ?(НайденнаяСтрока[0].Стр3 = 0, 0, Стр.Март4		/ НайденнаяСтрока[0].Стр3);
		НСтр.Апрель4	= ?(НайденнаяСтрока[0].Стр4 = 0, 0, Стр.Апрель4		/ НайденнаяСтрока[0].Стр4);
		НСтр.Май4		= ?(НайденнаяСтрока[0].Стр5 = 0, 0, Стр.Май4		/ НайденнаяСтрока[0].Стр5);
		НСтр.Июнь4		= ?(НайденнаяСтрока[0].Стр6 = 0, 0, Стр.Июнь4		/ НайденнаяСтрока[0].Стр6);
		НСтр.Июль4		= ?(НайденнаяСтрока[0].Стр7 = 0, 0, Стр.Июль4		/ НайденнаяСтрока[0].Стр7);
		НСтр.Август4	= ?(НайденнаяСтрока[0].Стр8 = 0, 0, Стр.Август4		/ НайденнаяСтрока[0].Стр8);
		НСтр.Сентябрь4	= ?(НайденнаяСтрока[0].Стр9 = 0, 0, Стр.Сентябрь4	/ НайденнаяСтрока[0].Стр9);
		НСтр.Октябрь4	= ?(НайденнаяСтрока[0].Стр10 = 0, 0, Стр.Октябрь4	/ НайденнаяСтрока[0].Стр10);
		НСтр.Ноябрь4	= ?(НайденнаяСтрока[0].Стр11 = 0, 0, Стр.Ноябрь4	/ НайденнаяСтрока[0].Стр11);
		НСтр.Декабрь4	= ?(НайденнаяСтрока[0].Стр12 = 0, 0, Стр.Август4	/ НайденнаяСтрока[0].Стр12);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервереДанныеПродажТренд()
	
	// у = а * НомерМесяца + в
	// ------------------------------------------------------
	// {КоличествоМесяцев * А + СуммаНомеровМесяцев * B = СуммаВеличин
	// {СуммаНомеровМесяцев * А + СуммаКвадратовНомеровМесяцев * B = СуммаПроизведенийНомеровМесяцевНаВеличину
			
	Лет = Объект.КоличествоЛетДляРасчетаТренда;
	
	Если Лет = 4 Тогда
		КоличествоМесяцев = 48; 
		СуммаНомеровМесяцев = 1176;
		СуммаКвадратовНомеровМесяцев = 38024;
	КонецЕсли;
	Если Лет = 3 Тогда
		КоличествоМесяцев = 36;
		СуммаНомеровМесяцев = 666;
		СуммаКвадратовНомеровМесяцев = 16206;
	КонецЕсли;
	Если Лет = 2 Тогда
		КоличествоМесяцев = 24;
		СуммаНомеровМесяцев = 300;
		СуммаКвадратовНомеровМесяцев = 4900;
	КонецЕсли;
	Если Лет = 1 Тогда
		КоличествоМесяцев = 12;
		СуммаНомеровМесяцев = 78;
		СуммаКвадратовНомеровМесяцев = 650;
	КонецЕсли;
	
	НабЗап = РегистрыСведений.ДанныеПродаж.СрезПоследних();
	ПоследнийМесяц = Месяц(НабЗап[0].Период);
	
	Если НЕ ПоследнийМесяц = 12 Тогда
		
		СтруктураВозврата = ПосчитатьСуммыВычитания(ПоследнийМесяц, КоличествоМесяцев);
		
		КоличествоМесяцев				= КоличествоМесяцев				- СтруктураВозврата.КоличествоМесяцев;
		СуммаНомеровМесяцев				= СуммаНомеровМесяцев			- СтруктураВозврата.СуммаНомеровМесяцев;
		СуммаКвадратовНомеровМесяцев	= СуммаКвадратовНомеровМесяцев	- СтруктураВозврата.СуммаКвадратовНомеровМесяцев;
		
		//Сообщить("ПоследнийМесяц: " + ПоследнийМесяц);
		//Сообщить("Возврат 1: " + СтруктураВозврата.КоличествоМесяцев);
		//Сообщить("Возврат 2: " + СтруктураВозврата.СуммаНомеровМесяцев);
		//Сообщить("Возврат 3: " + СтруктураВозврата.СуммаКвадратовНомеровМесяцев);
		//Сообщить("------------------------------");
		
	КонецЕсли;
	
	СуммаВеличин = 0;
	СуммаПроизведенийНомеровМесяцевНаВеличину = 0;
	
	Для Каждого Стр из Объект.ДанныеПродажБезСезонности Цикл
		
		Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
			Если НЕ Стр.Номенклатура = Объект.Номенклатура Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		НСтр = Объект.ДанныеПродажТренд.Добавить();
		НСтр.Номенклатура = Стр.Номенклатура;
		
		Если Лет = 4 Тогда
		
			СуммаВеличин = Стр.Январь1 + Стр.Февраль1 + Стр.Март1 + Стр.Апрель1 + Стр.Май1 + Стр.Июнь1 + Стр.Июль1 + Стр.Август1 + Стр.Сентябрь1 + Стр.Октябрь1 + Стр.Ноябрь1 + Стр.Декабрь1 + 
						   Стр.Январь2 + Стр.Февраль2 + Стр.Март2 + Стр.Апрель2 + Стр.Май2 + Стр.Июнь2 + Стр.Июль2 + Стр.Август2 + Стр.Сентябрь2 + Стр.Октябрь2 + Стр.Ноябрь2 + Стр.Декабрь2 +
						   Стр.Январь3 + Стр.Февраль3 + Стр.Март3 + Стр.Апрель3 + Стр.Май3 + Стр.Июнь3 + Стр.Июль3 + Стр.Август3 + Стр.Сентябрь3 + Стр.Октябрь3 + Стр.Ноябрь3 + Стр.Декабрь3 +
						   Стр.Январь4 + Стр.Февраль4 + Стр.Март4 + Стр.Апрель4 + Стр.Май4 + Стр.Июнь4 + Стр.Июль4 + Стр.Август4 + Стр.Сентябрь4 + Стр.Октябрь4 + Стр.Ноябрь4 + Стр.Декабрь4;
		
			СуммаПроизведенийНомеровМесяцевНаВеличину = (1 * Стр.Январь1) + (2 * Стр.Февраль1) + (3 * Стр.Март1) + (4 * Стр.Апрель1) + (5 * Стр.Май1) + (6 * Стр.Июнь1) +
		    	                                        (7 * Стр.Июль1) + (8 * Стр.Август1) + (9 * Стр.Сентябрь1) + (10 * Стр.Октябрь1) + (11 * Стр.Ноябрь1) + (12 * Стр.Декабрь1) +
														(13 * Стр.Январь2) + (14 * Стр.Февраль2) + (15 * Стр.Март2) + (16 * Стр.Апрель2) + (17 * Стр.Май2) + (18 * Стр.Июнь2) +
		            	                                (19 * Стр.Июль2) + (20 * Стр.Август2) + (21 * Стр.Сентябрь2) + (22 * Стр.Октябрь2) + (23 * Стр.Ноябрь2) + (24 * Стр.Декабрь2) + 
														(25 * Стр.Январь3) + (26 * Стр.Февраль3) + (27 * Стр.Март3) + (28 * Стр.Апрель3) + (29 * Стр.Май3) + (30 * Стр.Июнь3) +
		                    	                        (31 * Стр.Июль3) + (32 * Стр.Август3) + (33 * Стр.Сентябрь3) + (34 * Стр.Октябрь3) + (35 * Стр.Ноябрь3) + (36 * Стр.Декабрь3) + 
														(37 * Стр.Январь4) + (38 * Стр.Февраль4) + (39 * Стр.Март4) + (40 * Стр.Апрель4) + (41 * Стр.Май4) + (42 * Стр.Июнь4) +
		                            	                (43 * Стр.Июль4) + (44 * Стр.Август4) + (45 * Стр.Сентябрь4) + (46 * Стр.Октябрь4) + (47 * Стр.Ноябрь4) + (48 * Стр.Декабрь4);
														
		КонецЕсли;
													
		Если Лет = 3 Тогда
		
			СуммаВеличин = Стр.Январь2 + Стр.Февраль2 + Стр.Март2 + Стр.Апрель2 + Стр.Май2 + Стр.Июнь2 + Стр.Июль2 + Стр.Август2 + Стр.Сентябрь2 + Стр.Октябрь2 + Стр.Ноябрь2 + Стр.Декабрь2 +
						   Стр.Январь3 + Стр.Февраль3 + Стр.Март3 + Стр.Апрель3 + Стр.Май3 + Стр.Июнь3 + Стр.Июль3 + Стр.Август3 + Стр.Сентябрь3 + Стр.Октябрь3 + Стр.Ноябрь3 + Стр.Декабрь3 +
						   Стр.Январь4 + Стр.Февраль4 + Стр.Март4 + Стр.Апрель4 + Стр.Май4 + Стр.Июнь4 + Стр.Июль4 + Стр.Август4 + Стр.Сентябрь4 + Стр.Октябрь4 + Стр.Ноябрь4 + Стр.Декабрь4;
		
			СуммаПроизведенийНомеровМесяцевНаВеличину = (1 * Стр.Январь2) + (2 * Стр.Февраль2) + (3 * Стр.Март2) + (4 * Стр.Апрель2) + (5 * Стр.Май2) + (6 * Стр.Июнь2) +
		    	                                        (7 * Стр.Июль2) + (8 * Стр.Август2) + (9 * Стр.Сентябрь2) + (10 * Стр.Октябрь2) + (11 * Стр.Ноябрь2) + (12 * Стр.Декабрь2) +
														(13 * Стр.Январь3) + (14 * Стр.Февраль3) + (15 * Стр.Март3) + (16 * Стр.Апрель3) + (17 * Стр.Май3) + (18 * Стр.Июнь3) +
		            	                                (19 * Стр.Июль3) + (20 * Стр.Август3) + (21 * Стр.Сентябрь3) + (22 * Стр.Октябрь3) + (23 * Стр.Ноябрь3) + (24 * Стр.Декабрь3) + 
														(25 * Стр.Январь4) + (26 * Стр.Февраль4) + (27 * Стр.Март4) + (28 * Стр.Апрель4) + (29 * Стр.Май4) + (30 * Стр.Июнь4) +
		                    	                        (31 * Стр.Июль4) + (32 * Стр.Август4) + (33 * Стр.Сентябрь4) + (34 * Стр.Октябрь4) + (35 * Стр.Ноябрь4) + (36 * Стр.Декабрь4);														
														
		КонецЕсли;
													
		Если Лет = 2 Тогда
		
			СуммаВеличин = Стр.Январь3 + Стр.Февраль3 + Стр.Март3 + Стр.Апрель3 + Стр.Май3 + Стр.Июнь3 + Стр.Июль3 + Стр.Август3 + Стр.Сентябрь3 + Стр.Октябрь3 + Стр.Ноябрь3 + Стр.Декабрь3 +
						   Стр.Январь4 + Стр.Февраль4 + Стр.Март4 + Стр.Апрель4 + Стр.Май4 + Стр.Июнь4 + Стр.Июль4 + Стр.Август4 + Стр.Сентябрь4 + Стр.Октябрь4 + Стр.Ноябрь4 + Стр.Декабрь4;
		
			СуммаПроизведенийНомеровМесяцевНаВеличину = (1 * Стр.Январь3) + (2 * Стр.Февраль3) + (3 * Стр.Март3) + (4 * Стр.Апрель3) + (5 * Стр.Май3) + (6 * Стр.Июнь3) +
		    	                                        (7 * Стр.Июль3) + (8 * Стр.Август3) + (9 * Стр.Сентябрь3) + (10 * Стр.Октябрь3) + (11 * Стр.Ноябрь3) + (12 * Стр.Декабрь3) +
														(13 * Стр.Январь4) + (14 * Стр.Февраль4) + (15 * Стр.Март4) + (16 * Стр.Апрель4) + (17 * Стр.Май4) + (18 * Стр.Июнь4) +
		            	                                (19 * Стр.Июль4) + (20 * Стр.Август4) + (21 * Стр.Сентябрь4) + (22 * Стр.Октябрь4) + (23 * Стр.Ноябрь4) + (24 * Стр.Декабрь4);
														
		КонецЕсли;
													
		Если Лет = 1 Тогда
		
			СуммаВеличин = Стр.Январь4 + Стр.Февраль4 + Стр.Март4 + Стр.Апрель4 + Стр.Май4 + Стр.Июнь4 + Стр.Июль4 + Стр.Август4 + Стр.Сентябрь4 + Стр.Октябрь4 + Стр.Ноябрь4 + Стр.Декабрь4;
		
			СуммаПроизведенийНомеровМесяцевНаВеличину = (1 * Стр.Январь4) + (2 * Стр.Февраль4) + (3 * Стр.Март4) + (4 * Стр.Апрель4) + (5 * Стр.Май4) + (6 * Стр.Июнь4) +
		    	                                        (7 * Стр.Июль4) + (8 * Стр.Август4) + (9 * Стр.Сентябрь4) + (10 * Стр.Октябрь4) + (11 * Стр.Ноябрь4) + (12 * Стр.Декабрь4);
														
		КонецЕсли;
				
//		в = ((СуммаВеличин * (СуммаНомеровМесяцев / КоличествоМесяцев)) - СуммаПроизведенийНомеровМесяцевНаВеличину) / ((СуммаНомеровМесяцев * (СуммаНомеровМесяцев / КоличествоМесяцев)) - СуммаКвадратовНомеровМесяцев);
		в = ((КоличествоМесяцев * СуммаПроизведенийНомеровМесяцевНаВеличину) - (СуммаНомеровМесяцев * СуммаВеличин)) / ((КоличествоМесяцев * СуммаКвадратовНомеровМесяцев) - (СуммаНомеровМесяцев * СуммаНомеровМесяцев));
		а = (СуммаВеличин - (СуммаНомеровМесяцев * в)) / КоличествоМесяцев; 
		
		ВычестьГоды = ?(Лет = 3, 12, ?(Лет = 2, 24, ?(Лет = 1, 36, 0)));           
		
		//Сообщить("Лет: " + Лет);
		//Сообщить("СуммаВеличин: " + СуммаВеличин);
		//Сообщить("СуммаПроизведенийНомеровМесяцевНаВеличину: " + СуммаПроизведенийНомеровМесяцевНаВеличину);
		//Сообщить("СуммаНомеровМесяцев :" + СуммаНомеровМесяцев);
		//Сообщить("КоличествоМесяцев :" + КоличествоМесяцев);
		//Сообщить("СуммаКвадратовНомеровМесяцев :" + СуммаКвадратовНомеровМесяцев);
		Сообщить("------------------------------");
		Сообщить("в :" + в);
		Сообщить("а :" + а);
		
		НСтр.Январь		= в * (49 - ВычестьГоды) + а;
		НСтр.Февраль	= в * (50 - ВычестьГоды) + а;
		НСтр.Март		= в * (51 - ВычестьГоды) + а;
		НСтр.Апрель		= в * (52 - ВычестьГоды) + а;
		НСтр.Май		= в * (53 - ВычестьГоды) + а;
		НСтр.Июнь		= в * (54 - ВычестьГоды) + а;
		НСтр.Июль		= в * (55 - ВычестьГоды) + а;
		НСтр.Август		= в * (56 - ВычестьГоды) + а;
		НСтр.Сентябрь	= в * (57 - ВычестьГоды) + а;
		НСтр.Октябрь	= в * (58 - ВычестьГоды) + а;
		НСтр.Ноябрь		= в * (59 - ВычестьГоды) + а;
		НСтр.Декабрь	= в * (60 - ВычестьГоды) + а;
		
		
		ННСтр = Объект.ДанныеПродажТрендДалее.Добавить();
		ННСтр.Номенклатура = Стр.Номенклатура;
		
		НайденнаяСтрока2 = Объект.СезонностьУсредненная.НайтиСтроки(Новый Структура("Номенклатура", Стр.Номенклатура));
		
		ННСтр.Январь	= (в * (61 - ВычестьГоды) + а) * НайденнаяСтрока2[0].Стр1;
		ННСтр.Февраль	= (в * (62 - ВычестьГоды) + а) * НайденнаяСтрока2[0].Стр2;
		ННСтр.Март		= (в * (63 - ВычестьГоды) + а) * НайденнаяСтрока2[0].Стр3;
		ННСтр.Апрель	= (в * (64 - ВычестьГоды) + а) * НайденнаяСтрока2[0].Стр4;
		ННСтр.Май		= (в * (65 - ВычестьГоды) + а) * НайденнаяСтрока2[0].Стр5;
		ННСтр.Июнь		= (в * (66 - ВычестьГоды) + а) * НайденнаяСтрока2[0].Стр6;
		ННСтр.Июль		= (в * (67 - ВычестьГоды) + а) * НайденнаяСтрока2[0].Стр7;
		ННСтр.Август	= (в * (68 - ВычестьГоды) + а) * НайденнаяСтрока2[0].Стр8;
		ННСтр.Сентябрь	= (в * (69 - ВычестьГоды) + а) * НайденнаяСтрока2[0].Стр9;
		ННСтр.Октябрь	= (в * (70 - ВычестьГоды) + а) * НайденнаяСтрока2[0].Стр10;
		ННСтр.Ноябрь	= (в * (71 - ВычестьГоды) + а) * НайденнаяСтрока2[0].Стр11;
		ННСтр.Декабрь	= (в * (72 - ВычестьГоды) + а) * НайденнаяСтрока2[0].Стр12;
				
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервереДанныеПродажОшибкиПрогноза()
	
	Для Каждого Стр из Объект.ДанныеПродажТренд Цикл
		
		Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
			Если НЕ Стр.Номенклатура = Объект.Номенклатура Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		
		НСтр = Объект.ДанныеПродажОшибкиПрогноза.Добавить();
		НСтр.Номенклатура = Стр.Номенклатура;
		
		НайденнаяСтрокаФакт = Объект.ДанныеПродаж.НайтиСтроки(Новый Структура("Номенклатура", Стр.Номенклатура));
		
		Если НайденнаяСтрокаФакт.Количество() > 0 Тогда
			
			Если ?(НайденнаяСтрокаФакт[0].Январь4 > Стр.Январь, НайденнаяСтрокаФакт[0].Январь4, Стр.Январь) > 0 Тогда
				НСтр.Январь		= 1 - (?(НайденнаяСтрокаФакт[0].Январь4 > Стр.Январь, Стр.Январь, НайденнаяСтрокаФакт[0].Январь4) / ?(НайденнаяСтрокаФакт[0].Январь4 > Стр.Январь, НайденнаяСтрокаФакт[0].Январь4, Стр.Январь));
			Иначе
				НСтр.Январь		= 0;
			КонецЕсли;
			Если ?(НайденнаяСтрокаФакт[0].Февраль4 > Стр.Февраль, НайденнаяСтрокаФакт[0].Февраль4, Стр.Февраль) > 0 Тогда
				НСтр.Февраль	= 1 - (?(НайденнаяСтрокаФакт[0].Февраль4 > Стр.Февраль, Стр.Февраль, НайденнаяСтрокаФакт[0].Февраль4) / ?(НайденнаяСтрокаФакт[0].Февраль4 > Стр.Февраль, НайденнаяСтрокаФакт[0].Февраль4, Стр.Февраль));
			Иначе
				НСтр.Февраль	= 0;
			КонецЕсли;
			Если ?(НайденнаяСтрокаФакт[0].Март4 > Стр.Март, НайденнаяСтрокаФакт[0].Март4, Стр.Март) > 0 Тогда
				НСтр.Март		= 1 - (?(НайденнаяСтрокаФакт[0].Март4 > Стр.Март, Стр.Март, НайденнаяСтрокаФакт[0].Март4) / ?(НайденнаяСтрокаФакт[0].Март4 > Стр.Март, НайденнаяСтрокаФакт[0].Март4, Стр.Март));
			Иначе
				НСтр.Март		= 0;
			КонецЕсли;
			Если ?(НайденнаяСтрокаФакт[0].Апрель4 > Стр.Апрель, НайденнаяСтрокаФакт[0].Апрель4, Стр.Апрель) > 0 Тогда
				НСтр.Апрель		= 1 - (?(НайденнаяСтрокаФакт[0].Апрель4 > Стр.Апрель, Стр.Апрель, НайденнаяСтрокаФакт[0].Апрель4) / ?(НайденнаяСтрокаФакт[0].Апрель4 > Стр.Апрель, НайденнаяСтрокаФакт[0].Апрель4, Стр.Апрель));
			Иначе
				НСтр.Апрель		= 0;
			КонецЕсли;
			Если ?(НайденнаяСтрокаФакт[0].Май4 > Стр.Май, НайденнаяСтрокаФакт[0].Май4, Стр.Май) > 0 Тогда
				НСтр.Май		= 1 - (?(НайденнаяСтрокаФакт[0].Май4 > Стр.Май, Стр.Май, НайденнаяСтрокаФакт[0].Май4) / ?(НайденнаяСтрокаФакт[0].Май4 > Стр.Май, НайденнаяСтрокаФакт[0].Май4, Стр.Май));
			Иначе
				НСтр.Май		= 0;
			КонецЕсли;
			Если ?(НайденнаяСтрокаФакт[0].Июнь4 > Стр.Июнь, НайденнаяСтрокаФакт[0].Июнь4, Стр.Июнь) > 0 Тогда
				НСтр.Июнь		= 1 - (?(НайденнаяСтрокаФакт[0].Июнь4 > Стр.Июнь, Стр.Июнь, НайденнаяСтрокаФакт[0].Июнь4) / ?(НайденнаяСтрокаФакт[0].Июнь4 > Стр.Июнь, НайденнаяСтрокаФакт[0].Июнь4, Стр.Июнь));
			Иначе
				НСтр.Июнь		= 0;
			КонецЕсли;
			Если ?(НайденнаяСтрокаФакт[0].Июль4 > Стр.Июль, НайденнаяСтрокаФакт[0].Июль4, Стр.Июль) > 0 Тогда
				НСтр.Июль		= 1 - (?(НайденнаяСтрокаФакт[0].Июль4 > Стр.Июль, Стр.Июль, НайденнаяСтрокаФакт[0].Июль4) / ?(НайденнаяСтрокаФакт[0].Июль4 > Стр.Июль, НайденнаяСтрокаФакт[0].Июль4, Стр.Июль));
			Иначе
				НСтр.Июль		= 0;
			КонецЕсли;
			Если ?(НайденнаяСтрокаФакт[0].Август4 > Стр.Август, НайденнаяСтрокаФакт[0].Август4, Стр.Август) > 0 Тогда
				НСтр.Август		= 1 - (?(НайденнаяСтрокаФакт[0].Август4 > Стр.Август, Стр.Август, НайденнаяСтрокаФакт[0].Август4) / ?(НайденнаяСтрокаФакт[0].Август4 > Стр.Август, НайденнаяСтрокаФакт[0].Август4, Стр.Август));
			Иначе
				НСтр.Август		= 0;
			КонецЕсли;
			Если ?(НайденнаяСтрокаФакт[0].Сентябрь4 > Стр.Сентябрь, НайденнаяСтрокаФакт[0].Сентябрь4, Стр.Сентябрь) > 0 Тогда
				НСтр.Сентябрь	= 1 - (?(НайденнаяСтрокаФакт[0].Сентябрь4 > Стр.Сентябрь, Стр.Сентябрь, НайденнаяСтрокаФакт[0].Сентябрь4) / ?(НайденнаяСтрокаФакт[0].Сентябрь4 > Стр.Сентябрь, НайденнаяСтрокаФакт[0].Сентябрь4, Стр.Сентябрь));
			Иначе
				НСтр.Сентябрь	= 0;
			КонецЕсли;
			Если ?(НайденнаяСтрокаФакт[0].Октябрь4 > Стр.Октябрь, НайденнаяСтрокаФакт[0].Октябрь4, Стр.Октябрь) > 0 Тогда
				НСтр.Октябрь	= 1 - (?(НайденнаяСтрокаФакт[0].Октябрь4 > Стр.Октябрь, Стр.Октябрь, НайденнаяСтрокаФакт[0].Октябрь4) / ?(НайденнаяСтрокаФакт[0].Октябрь4 > Стр.Октябрь, НайденнаяСтрокаФакт[0].Октябрь4, Стр.Октябрь));
			Иначе
				НСтр.Октябрь	= 0;
			КонецЕсли;
			Если ?(НайденнаяСтрокаФакт[0].Ноябрь4 > Стр.Ноябрь, НайденнаяСтрокаФакт[0].Ноябрь4, Стр.Ноябрь) > 0 Тогда
				НСтр.Ноябрь		= 1 - (?(НайденнаяСтрокаФакт[0].Ноябрь4 > Стр.Ноябрь, Стр.Ноябрь, НайденнаяСтрокаФакт[0].Ноябрь4) / ?(НайденнаяСтрокаФакт[0].Ноябрь4 > Стр.Ноябрь, НайденнаяСтрокаФакт[0].Ноябрь4, Стр.Ноябрь));
			Иначе
				НСтр.Ноябрь		= 0;
			КонецЕсли;
			Если ?(НайденнаяСтрокаФакт[0].Декабрь4 > Стр.Декабрь, НайденнаяСтрокаФакт[0].Декабрь4, Стр.Декабрь) > 0 Тогда
				НСтр.Декабрь	= 1 - (?(НайденнаяСтрокаФакт[0].Декабрь4 > Стр.Декабрь, Стр.Декабрь, НайденнаяСтрокаФакт[0].Декабрь4) / ?(НайденнаяСтрокаФакт[0].Декабрь4 > Стр.Декабрь, НайденнаяСтрокаФакт[0].Декабрь4, Стр.Декабрь));
			Иначе
				НСтр.Декабрь	= 0;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаТекущийПериодУжеЕстьДанные(ТекПериод, ТекНоменклатура)
	
	ДанныеЕсть = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПрогнозСпроса.Номенклатура), 0) КАК Номенклатура
	|ИЗ
	|	РегистрСведений.ПрогнозСпроса КАК ПрогнозСпроса
	|ГДЕ
	|	ПрогнозСпроса.Период = &Период
	|	" + ?(ТекНоменклатура = Неопределено, "", "	И ПрогнозСпроса.Номенклатура = &Номенклатура") + "
	|
	|ИМЕЮЩИЕ
	|	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПрогнозСпроса.Номенклатура), 0) > 0";
	Запрос.УстановитьПараметр("Период", ТекПериод);
	Запрос.УстановитьПараметр("Номенклатура", ТекНоменклатура);
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		ДанныеЕсть = Истина;
	КонецЕсли;
	
	Возврат ДанныеЕсть;
	
КонецФункции

&НаСервере
Процедура ЗаписатьДанныеНаСервере()
	
	Для Каждого Стр из Объект.ДанныеПродажТрендДалее Цикл
		
		НабЗап = РегистрыСведений.ПрогнозСпроса.СоздатьНаборЗаписей();
		НабЗап.Отбор.Период.Установить(КонецГода(Объект.ДатаАнализа) + 1);
		НабЗап.Отбор.Номенклатура.Установить(Стр.Номенклатура);	
	
		Зап = НабЗап.Добавить();
		ЗаполнитьЗначенияСвойств(Зап, Стр);
		Зап.Период = КонецГода(Объект.ДатаАнализа) + 1;
		
		НабЗап.Записать();
		
	КонецЦикла;		
	
КонецПроцедуры

&НаСервере
Процедура ПостроитьДиаграммуНаСервере()
	
	Объект.ДиаграммаДанных.Очистить();
	Объект.ДиаграммаДанных.Обновление = Ложь;
	
	Объект.ДиаграммаДанных.ОбластьЗаголовка.Текст = "Диаграмма данных: " + Объект.Номенклатура;
	
	Объект.ДиаграммаДанных.ТипДиаграммы = ТипДиаграммы.График;
	
	НайденнаяСтрока = Объект.ДанныеПродаж.НайтиСтроки(Новый Структура("Номенклатура", Объект.Номенклатура));
	
	Если НайденнаяСтрока.Количество() > 0 Тогда
				
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(1), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Январь1);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(2), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Февраль1);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(3), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Март1);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(4), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Апрель1);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(5), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Май1);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(6), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Июнь1);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(7), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Июль1);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(8), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Август1);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(9), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Сентябрь1);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(10), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Октябрь1);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(11), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Ноябрь1);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(12), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Декабрь1);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(13), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Январь2);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(14), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Февраль2);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(15), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Март2);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(16), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Апрель2);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(17), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Май2);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(18), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Июнь2);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(19), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Июль2);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(20), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Август2);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(21), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Сентябрь2);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(22), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Октябрь2);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(23), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Ноябрь2);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(24), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Декабрь2);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(25), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Январь3);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(26), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Февраль3);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(27), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Март3);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(28), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Апрель3);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(29), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Май3);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(30), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Июнь3);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(31), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Июль3);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(32), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Август3);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(33), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Сентябрь3);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(34), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Октябрь3);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(35), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Ноябрь3);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(36), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Декабрь3);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(37), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Январь4);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(38), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Февраль4);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(39), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Март4);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(40), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Апрель4);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(41), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Май4);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(42), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Июнь4);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(43), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Июль4);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(44), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Август4);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(45), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Сентябрь4);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(46), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Октябрь4);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(47), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Ноябрь4);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(48), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж"), НайденнаяСтрока[0].Декабрь4);
				
	КонецЕсли;
	
	НайденнаяСтрока = Объект.ПоПятиТочкам.НайтиСтроки(Новый Структура("Номенклатура", Объект.Номенклатура));
	
	Если НайденнаяСтрока.Количество() > 0 Тогда
				
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(1), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр1);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(2), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр2);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(3), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр3);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(4), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр4);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(5), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр5);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(6), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр6);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(7), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр7);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(8), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр8);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(9), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр9);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(10), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр10);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(11), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр11);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(12), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр12);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(13), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр13);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(14), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр14);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(15), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр15);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(16), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр16);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(17), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр17);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(18), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр18);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(19), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр19);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(20), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр20);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(21), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр21);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(22), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр22);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(23), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр23);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(24), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр24);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(25), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр25);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(26), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр26);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(27), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр27);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(28), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр28);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(29), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр29);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(30), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр30);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(31), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр31);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(32), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр32);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(33), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр33);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(34), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр34);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(35), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр35);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(36), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр36);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(37), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр37);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(38), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр38);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(39), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр39);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(40), Объект.ДиаграммаДанных.УстановитьСерию("По 5 точкам"), НайденнаяСтрока[0].Стр40);
				
	КонецЕсли;
	
	НайденнаяСтрока = Объект.ПоДвенадцатиТочкам.НайтиСтроки(Новый Структура("Номенклатура", Объект.Номенклатура));
	
	Если НайденнаяСтрока.Количество() > 0 Тогда
				
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(1), Объект.ДиаграммаДанных.УстановитьСерию("По 12 точкам"), НайденнаяСтрока[0].Стр1);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(2), Объект.ДиаграммаДанных.УстановитьСерию("По 12 точкам"), НайденнаяСтрока[0].Стр2);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(3), Объект.ДиаграммаДанных.УстановитьСерию("По 12 точкам"), НайденнаяСтрока[0].Стр3);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(4), Объект.ДиаграммаДанных.УстановитьСерию("По 12 точкам"), НайденнаяСтрока[0].Стр4);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(5), Объект.ДиаграммаДанных.УстановитьСерию("По 12 точкам"), НайденнаяСтрока[0].Стр5);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(6), Объект.ДиаграммаДанных.УстановитьСерию("По 12 точкам"), НайденнаяСтрока[0].Стр6);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(7), Объект.ДиаграммаДанных.УстановитьСерию("По 12 точкам"), НайденнаяСтрока[0].Стр7);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(8), Объект.ДиаграммаДанных.УстановитьСерию("По 12 точкам"), НайденнаяСтрока[0].Стр8);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(9), Объект.ДиаграммаДанных.УстановитьСерию("По 12 точкам"), НайденнаяСтрока[0].Стр9);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(10), Объект.ДиаграммаДанных.УстановитьСерию("По 12 точкам"), НайденнаяСтрока[0].Стр10);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(11), Объект.ДиаграммаДанных.УстановитьСерию("По 12 точкам"), НайденнаяСтрока[0].Стр11);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(12), Объект.ДиаграммаДанных.УстановитьСерию("По 12 точкам"), НайденнаяСтрока[0].Стр12);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(13), Объект.ДиаграммаДанных.УстановитьСерию("По 12 точкам"), НайденнаяСтрока[0].Стр13);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(14), Объект.ДиаграммаДанных.УстановитьСерию("По 12 точкам"), НайденнаяСтрока[0].Стр14);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(15), Объект.ДиаграммаДанных.УстановитьСерию("По 12 точкам"), НайденнаяСтрока[0].Стр15);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(16), Объект.ДиаграммаДанных.УстановитьСерию("По 12 точкам"), НайденнаяСтрока[0].Стр16);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(17), Объект.ДиаграммаДанных.УстановитьСерию("По 12 точкам"), НайденнаяСтрока[0].Стр17);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(18), Объект.ДиаграммаДанных.УстановитьСерию("По 12 точкам"), НайденнаяСтрока[0].Стр18);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(19), Объект.ДиаграммаДанных.УстановитьСерию("По 12 точкам"), НайденнаяСтрока[0].Стр19);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(20), Объект.ДиаграммаДанных.УстановитьСерию("По 12 точкам"), НайденнаяСтрока[0].Стр20);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(21), Объект.ДиаграммаДанных.УстановитьСерию("По 12 точкам"), НайденнаяСтрока[0].Стр21);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(22), Объект.ДиаграммаДанных.УстановитьСерию("По 12 точкам"), НайденнаяСтрока[0].Стр22);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(23), Объект.ДиаграммаДанных.УстановитьСерию("По 12 точкам"), НайденнаяСтрока[0].Стр23);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(24), Объект.ДиаграммаДанных.УстановитьСерию("По 12 точкам"), НайденнаяСтрока[0].Стр24);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(25), Объект.ДиаграммаДанных.УстановитьСерию("По 12 точкам"), НайденнаяСтрока[0].Стр25);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(26), Объект.ДиаграммаДанных.УстановитьСерию("По 12 точкам"), НайденнаяСтрока[0].Стр26);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(27), Объект.ДиаграммаДанных.УстановитьСерию("По 12 точкам"), НайденнаяСтрока[0].Стр27);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(28), Объект.ДиаграммаДанных.УстановитьСерию("По 12 точкам"), НайденнаяСтрока[0].Стр28);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(29), Объект.ДиаграммаДанных.УстановитьСерию("По 12 точкам"), НайденнаяСтрока[0].Стр29);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(30), Объект.ДиаграммаДанных.УстановитьСерию("По 12 точкам"), НайденнаяСтрока[0].Стр30);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(31), Объект.ДиаграммаДанных.УстановитьСерию("По 12 точкам"), НайденнаяСтрока[0].Стр31);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(32), Объект.ДиаграммаДанных.УстановитьСерию("По 12 точкам"), НайденнаяСтрока[0].Стр32);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(33), Объект.ДиаграммаДанных.УстановитьСерию("По 12 точкам"), НайденнаяСтрока[0].Стр33);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(34), Объект.ДиаграммаДанных.УстановитьСерию("По 12 точкам"), НайденнаяСтрока[0].Стр34);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(35), Объект.ДиаграммаДанных.УстановитьСерию("По 12 точкам"), НайденнаяСтрока[0].Стр35);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(36), Объект.ДиаграммаДанных.УстановитьСерию("По 12 точкам"), НайденнаяСтрока[0].Стр36);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(37), Объект.ДиаграммаДанных.УстановитьСерию("По 12 точкам"), НайденнаяСтрока[0].Стр37);
				
	КонецЕсли;
	
	НайденнаяСтрока = Объект.МеждуДвумяКрайнимиТочками.НайтиСтроки(Новый Структура("Номенклатура", Объект.Номенклатура));
	
	Если НайденнаяСтрока.Количество() > 0 Тогда
		
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(1), Объект.ДиаграммаДанных.УстановитьСерию("Между двумя крайними"), НайденнаяСтрока[0].Стр1);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(2), Объект.ДиаграммаДанных.УстановитьСерию("Между двумя крайними"), НайденнаяСтрока[0].Стр2);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(3), Объект.ДиаграммаДанных.УстановитьСерию("Между двумя крайними"), НайденнаяСтрока[0].Стр3);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(4), Объект.ДиаграммаДанных.УстановитьСерию("Между двумя крайними"), НайденнаяСтрока[0].Стр4);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(5), Объект.ДиаграммаДанных.УстановитьСерию("Между двумя крайними"), НайденнаяСтрока[0].Стр5);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(6), Объект.ДиаграммаДанных.УстановитьСерию("Между двумя крайними"), НайденнаяСтрока[0].Стр6);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(7), Объект.ДиаграммаДанных.УстановитьСерию("Между двумя крайними"), НайденнаяСтрока[0].Стр7);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(8), Объект.ДиаграммаДанных.УстановитьСерию("Между двумя крайними"), НайденнаяСтрока[0].Стр8);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(9), Объект.ДиаграммаДанных.УстановитьСерию("Между двумя крайними"), НайденнаяСтрока[0].Стр9);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(10), Объект.ДиаграммаДанных.УстановитьСерию("Между двумя крайними"), НайденнаяСтрока[0].Стр10);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(11), Объект.ДиаграммаДанных.УстановитьСерию("Между двумя крайними"), НайденнаяСтрока[0].Стр11);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(12), Объект.ДиаграммаДанных.УстановитьСерию("Между двумя крайними"), НайденнаяСтрока[0].Стр12);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(13), Объект.ДиаграммаДанных.УстановитьСерию("Между двумя крайними"), НайденнаяСтрока[0].Стр13);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(14), Объект.ДиаграммаДанных.УстановитьСерию("Между двумя крайними"), НайденнаяСтрока[0].Стр14);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(15), Объект.ДиаграммаДанных.УстановитьСерию("Между двумя крайними"), НайденнаяСтрока[0].Стр15);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(16), Объект.ДиаграммаДанных.УстановитьСерию("Между двумя крайними"), НайденнаяСтрока[0].Стр16);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(17), Объект.ДиаграммаДанных.УстановитьСерию("Между двумя крайними"), НайденнаяСтрока[0].Стр17);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(18), Объект.ДиаграммаДанных.УстановитьСерию("Между двумя крайними"), НайденнаяСтрока[0].Стр18);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(19), Объект.ДиаграммаДанных.УстановитьСерию("Между двумя крайними"), НайденнаяСтрока[0].Стр19);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(20), Объект.ДиаграммаДанных.УстановитьСерию("Между двумя крайними"), НайденнаяСтрока[0].Стр20);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(21), Объект.ДиаграммаДанных.УстановитьСерию("Между двумя крайними"), НайденнаяСтрока[0].Стр21);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(22), Объект.ДиаграммаДанных.УстановитьСерию("Между двумя крайними"), НайденнаяСтрока[0].Стр22);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(23), Объект.ДиаграммаДанных.УстановитьСерию("Между двумя крайними"), НайденнаяСтрока[0].Стр23);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(24), Объект.ДиаграммаДанных.УстановитьСерию("Между двумя крайними"), НайденнаяСтрока[0].Стр24);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(25), Объект.ДиаграммаДанных.УстановитьСерию("Между двумя крайними"), НайденнаяСтрока[0].Стр25);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(26), Объект.ДиаграммаДанных.УстановитьСерию("Между двумя крайними"), НайденнаяСтрока[0].Стр26);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(27), Объект.ДиаграммаДанных.УстановитьСерию("Между двумя крайними"), НайденнаяСтрока[0].Стр27);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(28), Объект.ДиаграммаДанных.УстановитьСерию("Между двумя крайними"), НайденнаяСтрока[0].Стр28);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(29), Объект.ДиаграммаДанных.УстановитьСерию("Между двумя крайними"), НайденнаяСтрока[0].Стр29);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(30), Объект.ДиаграммаДанных.УстановитьСерию("Между двумя крайними"), НайденнаяСтрока[0].Стр30);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(31), Объект.ДиаграммаДанных.УстановитьСерию("Между двумя крайними"), НайденнаяСтрока[0].Стр31);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(32), Объект.ДиаграммаДанных.УстановитьСерию("Между двумя крайними"), НайденнаяСтрока[0].Стр32);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(33), Объект.ДиаграммаДанных.УстановитьСерию("Между двумя крайними"), НайденнаяСтрока[0].Стр33);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(34), Объект.ДиаграммаДанных.УстановитьСерию("Между двумя крайними"), НайденнаяСтрока[0].Стр34);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(35), Объект.ДиаграммаДанных.УстановитьСерию("Между двумя крайними"), НайденнаяСтрока[0].Стр35);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(36), Объект.ДиаграммаДанных.УстановитьСерию("Между двумя крайними"), НайденнаяСтрока[0].Стр36);
				
	КонецЕсли;
	
	НайденнаяСтрока = Объект.Сезонность.НайтиСтроки(Новый Структура("Номенклатура", Объект.Номенклатура));
	
	Если НайденнаяСтрока.Количество() > 0 Тогда
		
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(1), Объект.ДиаграммаДанных.УстановитьСерию("Сезонность"), НайденнаяСтрока[0].Стр1);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(2), Объект.ДиаграммаДанных.УстановитьСерию("Сезонность"), НайденнаяСтрока[0].Стр2);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(3), Объект.ДиаграммаДанных.УстановитьСерию("Сезонность"), НайденнаяСтрока[0].Стр3);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(4), Объект.ДиаграммаДанных.УстановитьСерию("Сезонность"), НайденнаяСтрока[0].Стр4);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(5), Объект.ДиаграммаДанных.УстановитьСерию("Сезонность"), НайденнаяСтрока[0].Стр5);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(6), Объект.ДиаграммаДанных.УстановитьСерию("Сезонность"), НайденнаяСтрока[0].Стр6);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(7), Объект.ДиаграммаДанных.УстановитьСерию("Сезонность"), НайденнаяСтрока[0].Стр7);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(8), Объект.ДиаграммаДанных.УстановитьСерию("Сезонность"), НайденнаяСтрока[0].Стр8);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(9), Объект.ДиаграммаДанных.УстановитьСерию("Сезонность"), НайденнаяСтрока[0].Стр9);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(10), Объект.ДиаграммаДанных.УстановитьСерию("Сезонность"), НайденнаяСтрока[0].Стр10);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(11), Объект.ДиаграммаДанных.УстановитьСерию("Сезонность"), НайденнаяСтрока[0].Стр11);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(12), Объект.ДиаграммаДанных.УстановитьСерию("Сезонность"), НайденнаяСтрока[0].Стр12);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(13), Объект.ДиаграммаДанных.УстановитьСерию("Сезонность"), НайденнаяСтрока[0].Стр13);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(14), Объект.ДиаграммаДанных.УстановитьСерию("Сезонность"), НайденнаяСтрока[0].Стр14);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(15), Объект.ДиаграммаДанных.УстановитьСерию("Сезонность"), НайденнаяСтрока[0].Стр15);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(16), Объект.ДиаграммаДанных.УстановитьСерию("Сезонность"), НайденнаяСтрока[0].Стр16);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(17), Объект.ДиаграммаДанных.УстановитьСерию("Сезонность"), НайденнаяСтрока[0].Стр17);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(18), Объект.ДиаграммаДанных.УстановитьСерию("Сезонность"), НайденнаяСтрока[0].Стр18);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(19), Объект.ДиаграммаДанных.УстановитьСерию("Сезонность"), НайденнаяСтрока[0].Стр19);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(20), Объект.ДиаграммаДанных.УстановитьСерию("Сезонность"), НайденнаяСтрока[0].Стр20);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(21), Объект.ДиаграммаДанных.УстановитьСерию("Сезонность"), НайденнаяСтрока[0].Стр21);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(22), Объект.ДиаграммаДанных.УстановитьСерию("Сезонность"), НайденнаяСтрока[0].Стр22);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(23), Объект.ДиаграммаДанных.УстановитьСерию("Сезонность"), НайденнаяСтрока[0].Стр23);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(24), Объект.ДиаграммаДанных.УстановитьСерию("Сезонность"), НайденнаяСтрока[0].Стр24);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(25), Объект.ДиаграммаДанных.УстановитьСерию("Сезонность"), НайденнаяСтрока[0].Стр25);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(26), Объект.ДиаграммаДанных.УстановитьСерию("Сезонность"), НайденнаяСтрока[0].Стр26);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(27), Объект.ДиаграммаДанных.УстановитьСерию("Сезонность"), НайденнаяСтрока[0].Стр27);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(28), Объект.ДиаграммаДанных.УстановитьСерию("Сезонность"), НайденнаяСтрока[0].Стр28);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(29), Объект.ДиаграммаДанных.УстановитьСерию("Сезонность"), НайденнаяСтрока[0].Стр29);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(30), Объект.ДиаграммаДанных.УстановитьСерию("Сезонность"), НайденнаяСтрока[0].Стр30);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(31), Объект.ДиаграммаДанных.УстановитьСерию("Сезонность"), НайденнаяСтрока[0].Стр31);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(32), Объект.ДиаграммаДанных.УстановитьСерию("Сезонность"), НайденнаяСтрока[0].Стр32);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(33), Объект.ДиаграммаДанных.УстановитьСерию("Сезонность"), НайденнаяСтрока[0].Стр33);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(34), Объект.ДиаграммаДанных.УстановитьСерию("Сезонность"), НайденнаяСтрока[0].Стр34);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(35), Объект.ДиаграммаДанных.УстановитьСерию("Сезонность"), НайденнаяСтрока[0].Стр35);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(36), Объект.ДиаграммаДанных.УстановитьСерию("Сезонность"), НайденнаяСтрока[0].Стр36);
				
	КонецЕсли;
	
	НайденнаяСтрока = Объект.ДанныеПродажБезСезонности.НайтиСтроки(Новый Структура("Номенклатура", Объект.Номенклатура));
	
	Если НайденнаяСтрока.Количество() > 0 Тогда
				
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(1), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Январь1);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(2), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Февраль1);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(3), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Март1);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(4), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Апрель1);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(5), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Май1);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(6), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Июнь1);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(7), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Июль1);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(8), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Август1);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(9), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Сентябрь1);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(10), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Октябрь1);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(11), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Ноябрь1);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(12), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Декабрь1);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(13), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Январь2);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(14), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Февраль2);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(15), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Март2);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(16), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Апрель2);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(17), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Май2);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(18), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Июнь2);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(19), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Июль2);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(20), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Август2);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(21), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Сентябрь2);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(22), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Октябрь2);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(23), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Ноябрь2);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(24), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Декабрь2);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(25), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Январь3);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(26), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Февраль3);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(27), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Март3);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(28), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Апрель3);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(29), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Май3);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(30), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Июнь3);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(31), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Июль3);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(32), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Август3);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(33), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Сентябрь3);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(34), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Октябрь3);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(35), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Ноябрь3);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(36), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Декабрь3);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(37), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Январь4);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(38), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Февраль4);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(39), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Март4);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(40), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Апрель4);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(41), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Май4);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(42), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Июнь4);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(43), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Июль4);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(44), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Август4);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(45), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Сентябрь4);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(46), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Октябрь4);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(47), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Ноябрь4);
		Объект.ДиаграммаДанных.УстановитьЗначение(Объект.ДиаграммаДанных.УстановитьТочку(48), Объект.ДиаграммаДанных.УстановитьСерию("Данные продаж без сезонности"), НайденнаяСтрока[0].Декабрь4);
				
	КонецЕсли;
	
	Объект.ДиаграммаДанных.Обновление = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПостроитьДиаграммуТрендНаСервере()
	
	Объект.ДиаграммаТренд.Очистить();
	Объект.ДиаграммаТренд.Обновление = Ложь;
	
	Объект.ДиаграммаТренд.ОбластьЗаголовка.Текст = "Диаграмма. Тренд: " + Объект.Номенклатура;
	
	Объект.ДиаграммаТренд.ТипДиаграммы = ТипДиаграммы.График;
	
	НайденнаяСтрока = Объект.ДанныеПродажТренд.НайтиСтроки(Новый Структура("Номенклатура", Объект.Номенклатура));
	
	Если НайденнаяСтрока.Количество() > 0 Тогда
				
		Объект.ДиаграммаТренд.УстановитьЗначение(Объект.ДиаграммаТренд.УстановитьТочку(1), Объект.ДиаграммаТренд.УстановитьСерию("Тренд"), НайденнаяСтрока[0].Январь);
		Объект.ДиаграммаТренд.УстановитьЗначение(Объект.ДиаграммаТренд.УстановитьТочку(2), Объект.ДиаграммаТренд.УстановитьСерию("Тренд"), НайденнаяСтрока[0].Февраль);
		Объект.ДиаграммаТренд.УстановитьЗначение(Объект.ДиаграммаТренд.УстановитьТочку(3), Объект.ДиаграммаТренд.УстановитьСерию("Тренд"), НайденнаяСтрока[0].Март);
		Объект.ДиаграммаТренд.УстановитьЗначение(Объект.ДиаграммаТренд.УстановитьТочку(4), Объект.ДиаграммаТренд.УстановитьСерию("Тренд"), НайденнаяСтрока[0].Апрель);
		Объект.ДиаграммаТренд.УстановитьЗначение(Объект.ДиаграммаТренд.УстановитьТочку(5), Объект.ДиаграммаТренд.УстановитьСерию("Тренд"), НайденнаяСтрока[0].Май);
		Объект.ДиаграммаТренд.УстановитьЗначение(Объект.ДиаграммаТренд.УстановитьТочку(6), Объект.ДиаграммаТренд.УстановитьСерию("Тренд"), НайденнаяСтрока[0].Июнь);
		Объект.ДиаграммаТренд.УстановитьЗначение(Объект.ДиаграммаТренд.УстановитьТочку(7), Объект.ДиаграммаТренд.УстановитьСерию("Тренд"), НайденнаяСтрока[0].Июль);
		Объект.ДиаграммаТренд.УстановитьЗначение(Объект.ДиаграммаТренд.УстановитьТочку(8), Объект.ДиаграммаТренд.УстановитьСерию("Тренд"), НайденнаяСтрока[0].Август);
		Объект.ДиаграммаТренд.УстановитьЗначение(Объект.ДиаграммаТренд.УстановитьТочку(9), Объект.ДиаграммаТренд.УстановитьСерию("Тренд"), НайденнаяСтрока[0].Сентябрь);
		Объект.ДиаграммаТренд.УстановитьЗначение(Объект.ДиаграммаТренд.УстановитьТочку(10), Объект.ДиаграммаТренд.УстановитьСерию("Тренд"), НайденнаяСтрока[0].Октябрь);
		Объект.ДиаграммаТренд.УстановитьЗначение(Объект.ДиаграммаТренд.УстановитьТочку(11), Объект.ДиаграммаТренд.УстановитьСерию("Тренд"), НайденнаяСтрока[0].Ноябрь);
		Объект.ДиаграммаТренд.УстановитьЗначение(Объект.ДиаграммаТренд.УстановитьТочку(12), Объект.ДиаграммаТренд.УстановитьСерию("Тренд"), НайденнаяСтрока[0].Декабрь);
				
	КонецЕсли;
	
	НайденнаяСтрока = Объект.ДанныеПродажТрендДалее.НайтиСтроки(Новый Структура("Номенклатура", Объект.Номенклатура));
	
	Если НайденнаяСтрока.Количество() > 0 Тогда
				
		Объект.ДиаграммаТренд.УстановитьЗначение(Объект.ДиаграммаТренд.УстановитьТочку(1), Объект.ДиаграммаТренд.УстановитьСерию("Тренд на следующий период с сезонностью"), НайденнаяСтрока[0].Январь);
		Объект.ДиаграммаТренд.УстановитьЗначение(Объект.ДиаграммаТренд.УстановитьТочку(2), Объект.ДиаграммаТренд.УстановитьСерию("Тренд на следующий период с сезонностью"), НайденнаяСтрока[0].Февраль);
		Объект.ДиаграммаТренд.УстановитьЗначение(Объект.ДиаграммаТренд.УстановитьТочку(3), Объект.ДиаграммаТренд.УстановитьСерию("Тренд на следующий период с сезонностью"), НайденнаяСтрока[0].Март);
		Объект.ДиаграммаТренд.УстановитьЗначение(Объект.ДиаграммаТренд.УстановитьТочку(4), Объект.ДиаграммаТренд.УстановитьСерию("Тренд на следующий период с сезонностью"), НайденнаяСтрока[0].Апрель);
		Объект.ДиаграммаТренд.УстановитьЗначение(Объект.ДиаграммаТренд.УстановитьТочку(5), Объект.ДиаграммаТренд.УстановитьСерию("Тренд на следующий период с сезонностью"), НайденнаяСтрока[0].Май);
		Объект.ДиаграммаТренд.УстановитьЗначение(Объект.ДиаграммаТренд.УстановитьТочку(6), Объект.ДиаграммаТренд.УстановитьСерию("Тренд на следующий период с сезонностью"), НайденнаяСтрока[0].Июнь);
		Объект.ДиаграммаТренд.УстановитьЗначение(Объект.ДиаграммаТренд.УстановитьТочку(7), Объект.ДиаграммаТренд.УстановитьСерию("Тренд на следующий период с сезонностью"), НайденнаяСтрока[0].Июль);
		Объект.ДиаграммаТренд.УстановитьЗначение(Объект.ДиаграммаТренд.УстановитьТочку(8), Объект.ДиаграммаТренд.УстановитьСерию("Тренд на следующий период с сезонностью"), НайденнаяСтрока[0].Август);
		Объект.ДиаграммаТренд.УстановитьЗначение(Объект.ДиаграммаТренд.УстановитьТочку(9), Объект.ДиаграммаТренд.УстановитьСерию("Тренд на следующий период с сезонностью"), НайденнаяСтрока[0].Сентябрь);
		Объект.ДиаграммаТренд.УстановитьЗначение(Объект.ДиаграммаТренд.УстановитьТочку(10), Объект.ДиаграммаТренд.УстановитьСерию("Тренд на следующий период с сезонностью"), НайденнаяСтрока[0].Октябрь);
		Объект.ДиаграммаТренд.УстановитьЗначение(Объект.ДиаграммаТренд.УстановитьТочку(11), Объект.ДиаграммаТренд.УстановитьСерию("Тренд на следующий период с сезонностью"), НайденнаяСтрока[0].Ноябрь);
		Объект.ДиаграммаТренд.УстановитьЗначение(Объект.ДиаграммаТренд.УстановитьТочку(12), Объект.ДиаграммаТренд.УстановитьСерию("Тренд на следующий период с сезонностью"), НайденнаяСтрока[0].Декабрь);
				
	КонецЕсли;
		
	Объект.ДиаграммаТренд.Обновление = Истина;
	
КонецПроцедуры

&НаСервере
Функция ВыгрузитьВExcelНаСервере(Вариант)
	
	ТабДок = Новый ТабличныйДокумент;
			
	Макет = Обработки.ПрогнозПродаж.ПолучитьМакет("ДанныеПродаж");
	
	ОблШапка = Макет.ПолучитьОбласть("Шапка");
	ОблСтрока = Макет.ПолучитьОбласть("Строка");
	
	ТабДок.Вывести(ОблШапка);
	
	Если Вариант = 1 Тогда // Данные продаж
	
		Для Каждого Стр из Объект.ДанныеПродаж Цикл
			
			Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
				Если НЕ Стр.Номенклатура = Объект.Номенклатура Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			ОблСтрока.Параметры.Заполнить(Стр);
			ТабДок.Вывести(ОблСтрока);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если Вариант = 2 Тогда // Данные продаж без сезонности
	
		Для Каждого Стр из Объект.ДанныеПродажБезСезонности Цикл
			
			Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
				Если НЕ Стр.Номенклатура = Объект.Номенклатура Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			ОблСтрока.Параметры.Заполнить(Стр);
			ТабДок.Вывести(ОблСтрока);
			
		КонецЦикла;
		
	КонецЕсли;
		
	Возврат ТабДок;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПосчитатьСуммыВычитания(ТекМесяц, ВсегоМесяцев)
	
	НачальныййМесяц = ВсегоМесяцев - (12 - ТекМесяц) + 1;
	
	КоличествоМесяцев				= 0;
	СуммаНомеровМесяцев				= 0;
	СуммаКвадратовНомеровМесяцев	= 0;
	
	Для Сч = НачальныййМесяц по ВсегоМесяцев Цикл
		
		КоличествоМесяцев				= КоличествоМесяцев + 1;
		СуммаНомеровМесяцев				= СуммаНомеровМесяцев + Сч;
		СуммаКвадратовНомеровМесяцев	= СуммаКвадратовНомеровМесяцев + (Сч * Сч);
		
	КонецЦикла;
	
	Возврат Новый Структура("КоличествоМесяцев, СуммаНомеровМесяцев, СуммаКвадратовНомеровМесяцев", КоличествоМесяцев, СуммаНомеровМесяцев, СуммаКвадратовНомеровМесяцев);
	
КонецФункции
