
// Запросы к Третьей Бухгалтерии

//get_last_sale
Функция ПолучитьНомерИзБухгатерии(СтруктураДанных) Экспорт
	
	// Создадим запрос
	
	Сервер 			= КэшируемыеФункции.ПолучитьИмяСервераТретьейБухгалтерии();
	База 			= "Intrade"; 
	Пользователь 	= "HTTPБух";
	Пароль = "";//Пароль = ;
	Порт			= 80;
	
	ЗапросHTTP = Новый HTTPЗапрос("/" + База + "/hs/Garage/get_last_sale/");

	ЗапросHTTP.УстановитьТелоИзСтроки(w1_Json.JSON(СтруктураДанных, Истина));
	
	// Отправим на сервак
	
	Попытка		Соединение 	= Новый HTTPСоединение(Сервер, Порт, Пользователь, Пароль);
	Исключение	стрОшибки = ОписаниеОшибки();
				Возврат ""; КонецПопытки;
	
	Попытка		Результат = Соединение.ОтправитьДляОбработки(ЗапросHTTP);
	Исключение	стрОшибки = ОписаниеОшибки();
				Возврат ""; КонецПопытки;
	
	// Проверим результат
	
	Если Результат.КодСостояния <> 200 Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат Результат.ПолучитьТелоКакСтроку(); 
	
КонецФункции

//create_sale
Функция ПеренестиРеализациюВБухгалтерию(СтруктураДанных) Экспорт
	
	// Создадим запрос
	
	Сервер 			= КэшируемыеФункции.ПолучитьИмяСервераТретьейБухгалтерии();
	База 			= "Intrade"; 
	Пользователь 	= "HTTPБух";
	Пароль 			= "";//Пароль 			= ;
	Порт			= 80;
	
	ЗапросHTTP = Новый HTTPЗапрос("/" + База + "/hs/Garage/create_sale/");

	
	// Вложим в него данные
	
	ЗапросHTTP.УстановитьТелоИзСтроки(w1_Json.JSON(СтруктураДанных, Истина));
	
	// Отправим на сервер
	
	Попытка		Соединение 	= Новый HTTPСоединение(Сервер, Порт, Пользователь, Пароль);
	Исключение	стрОшибки = ОписаниеОшибки();
				Возврат Ложь; КонецПопытки;
	
	Попытка		Результат = Соединение.ОтправитьДляОбработки(ЗапросHTTP);
	Исключение	стрОшибки = ОписаниеОшибки();
				Возврат Ложь; КонецПопытки;
	
	// Проверим результат
	
	Если Результат.КодСостояния <> 200 Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат	Ложь;
	
КонецФункции
