
&НаСервере
Процедура ОбработкаСписка(СписокТоваров)
	
	НачатьТранзакцию();	
		
	Для Каждого ТоварСсылка Из СписокТоваров Цикл
		
		ТоварОбъект = ТоварСсылка.Значение.ПолучитьОбъект();
		
		ТоварОбъект.Производитель = Производитель; 
		
		ТоварОбъект.Записать();
			
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();

КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ОбработкаСписка(ВыбТовары);
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВыбТовары = Параметры.ВыбранныеТовары;
	
КонецПроцедуры
