
&НаКлиенте
Процедура ПоказатьРезультат(Заголовок, стрТекст)
	
	Текст = Новый ТекстовыйДокумент;
	Текст.УстановитьТекст(стрТекст);
	Текст.Показать(Заголовок);
	
КонецПроцедуры


&НаКлиенте
Функция ПроверитьМодифицированность()
	
	Если Модифицированность Тогда
		
		ПоказатьПредупреждение(,"Необходимо сперва записать");
		Возврат Ложь;
		
	Иначе
		Возврат Истина; КонецЕсли;
	
КонецФункции


&НаСервере
Функция ПолучитьСоединение(ОбменДанными) Экспорт
	
	Перем Соединение;
	
	Попытка
		Выполнить(ОбменДанными.АлгоритмИнициализацииСоединения);
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
	
	Возврат Соединение;
	
КонецФункции
&НаСервере
Функция тест_ПроверитьПодключение()
	
	Возврат Строка(ПолучитьСоединение(Объект.Ссылка));
	
КонецФункции

&НаКлиенте
Процедура ТестПолучениеЗначения(Команда)
	
	Если ПроверитьМодифицированность() И Не Объект.Ссылка.Пустая() Тогда
		
		стрОшибки 	= "";
		Ответ 		= тест_ПроверитьПодключение();
		
		Если Ответ <> Неопределено Тогда
			ПоказатьРезультат("Результат вычисления ключа", "Соединение = " + Ответ); КонецЕсли; КонецЕсли;

КонецПроцедуры
