
&НаСервере
Функция ПолучитьСсылкиЗаписи(Ссылки)
	
	Запрос = Новый Запрос("ВЫБРАТЬ Ссылка, Владелец, Владелец.ДатаНачала ДатаНачала, Владелец.ДатаОкончания ДатаОкончания ИЗ Справочник.ЗаписиУО ГДЕ Владелец В(&Ссылки) И НЕ ПометкаУдаления И СпособПолученияРезультата = 3 И Результат = АвтоРезультат");
	Запрос.УстановитьПараметр("Ссылки", Ссылки);
	
	Возврат КонвертацияТипов.ПолучитьМассивИзТаблицыЗначений(Запрос.Выполнить().Выгрузить());
	
КонецФункции
&НаСервере
Функция ПолучитьРезультат(Структура)
	
	Результат = Справочники.ЗаписиУО.ПолучитьРезультат(Структура.Ссылка, Структура.ДатаНачала, КонецДня(Структура.ДатаОкончания));
	Если Результат = Неопределено Тогда Возврат Ложь КонецЕсли;
		
	Возврат Структура.Ссылка.ПолучитьОбъект().ЗаписатьНовыйПоказатель(Результат);	
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Записи = ПолучитьСсылкиЗаписи(ПараметрКоманды);
	
	Ном = 0; Кол = Записи.Количество();
	Для Каждого Структура Из Записи Цикл Ном = Ном + 1;
		ОбработкаПрерыванияПользователя();
		
		Если Не ПолучитьРезультат(Структура) Тогда Возврат КонецЕсли;
		Состояние("Обновление " + Структура.Владелец, ном / Кол * 100, Структура.Ссылка); КонецЦикла; 
	
КонецПроцедуры
