
// ОТОБРАЖЕНИЕ

&НаСервере
Процедура ОбновитьСостоПроцеяние()

	Список.Параметры.УстановитьЗначениеПараметра("ВыбраноСостояние", 	Не Состояние.Пустая());
	Список.Параметры.УстановитьЗначениеПараметра("Состояние", 			Состояние);
	Список.Параметры.УстановитьЗначениеПараметра("ТолькоМои", 			ТолькоМои);
	Список.Параметры.УстановитьЗначениеПараметра("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	
КонецПроцедуры

// ТИПОВЫЕ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("СостояниеЧерновик", Перечисления.СостоянияЗаказа.Черновик);
	
	ОбновитьСостоПроцеяние();
	
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры

// ЭЛЕМЕНТЫ

&НаКлиенте
Процедура СостояниеФильтрПриИзменении(Элемент)
	
	ОбновитьСостоПроцеяние();
	
КонецПроцедуры
&НаКлиенте
Процедура СостояниеФильтрОчистка(Элемент, СтандартнаяОбработка)
	
	ОбновитьСостоПроцеяние();
	
КонецПроцедуры
&НаКлиенте
Процедура ТолькоМоиПриИзменении(Элемент)
	
	ОбновитьСостоПроцеяние();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = СобытияСистемы.Событие_ЗаписанаЗадача() Тогда
		
		Элементы.Список.Обновить();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗагрузкойДанныхИзНастроекНаСервере(Настройки)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура УправлениеВидимостьюДоступностью()
	Элементы.Менеджер.Видимость          = РольДоступна("РазрешеноМенятьМенеджераЗаказа");
	Элементы.ИзменитьМенеджера.Видимость = РольДоступна("РазрешеноМенятьМенеджераЗаказа");
КонецПроцедуры

&НаСервере
Процедура ИзменитьМенеджераНаСервере()
	ЗаказО=Элементы.Список.ТекущаяСтрока.Заказ.ПолучитьОбъект();
	ЗаказО.МенеджерЗаказа=Менеджер;
    ЗаказО.Записать();
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьМенеджера(Команда)
	ИзменитьМенеджераНаСервере();
КонецПроцедуры
